{"/account-and-license":{"title":"Account and License","data":{}},"/account-and-license/obtaining-metafox-license-key":{"title":"Obtaining MetaFox License Key","data":{"":"License keys and License ID, also known as software serial keys, are widely used for software activation or re-activation when you first installed or reinstalled the product. This is important information and it will be sent to you via email when you first purchase a license.When upgrading your site, purchasing, or posting reviews at our store, you will be asked to enter your site's License ID and Key. Here is the way to find them.","method-1-find-license-id-and-key-under-admin-cp#Method 1: Find License ID and Key under Admin CP":"From Admin cp dashboard, choose the License Key under the Setting tab from the left menu. Here you will find License keys and License ID","method-2-find-license-id-and-key-under-client-area#Method 2: Find License ID and Key under Client Area":"From your Client Area dashboard, just click your license under the \"Your Active Services/Products\" block.On the next page, you'll find the License ID and Key with the associated domain.","how-to-reset-the-license-key#How to reset the license key":"If you would like to change the license key as well as the licensed domain, you can click on the \"Reset License\" button on this page. A new license key will be generated and the associated domain will be removed right then."}},"/account-and-license/upgrade-license":{"title":"Upgrade license","data":{"":"The assumption is that you are holding a MetaFox-Pro license and want to upgrade to the MetaFox-Ultimate license to get the Premium White-label MOBILE APP. If so, please follow the below steps:Step 1: Go to https://clients.phpfox.com/ and log in to your accountStep 2: Clicking on Services will redirect you to the My Products & Services page**>Continue clicking on your active MetaFox-Pro license and choosing Actions**>Upgrade Package.Step 3: It will take you to the Upgrade Package page>Please scroll down to see the button Choose ProductStep 4: Checkout and complete the payment. After that, the Support team will reach out to you to convert the license and instruction some needed work."}},"/account-and-license/purchase-license":{"title":"Purchase license","data":{"":"This article is going to guide you to purchase MetaFox licenses.You can check all available MetaFox license types on the MetaFox Landing page or place an order hereClick on Order Now button of the license you would like to purchase, then go to the Review & Checkout pageIn the Review & Checkout page, you can:\nVerify the license you are going to purchase\nAdd Promotion code if having\nIn the Billing Details, if you don't have an account, please choose Create a new Account option and provide all required details\nStick the checkbox to agree with Terms of Service\nCheckout to make payment via Paypal payment gateway.\nOnce payment is made, you will receive a confirmation email with purchase details.Yay, we are almost done with the license purchase. If you have any difficulties with the purchasing process, you can contact us via: https://clients.phpfox.com/"}},"/advanced-setups/change-domain":{"title":"Change domain","data":{"":"This article will guide you to change the domain of MetaFox site. Assume that your MetaFox site has been installed successfully at the URL: https://olddomain.com . Now, you would like to change the domain to https://newdomain.com You should update the license domain in Client Area before updating the domain on your MetaFox site.","configure-new-domain-with-the-server#Configure new domain with the server":"Assume that you have purchased the new domain from the domain issuer. You will need to make sure that the new domain (newdomain.com) has been set up properly as below\nDNS of new domain is pointed to your current server\nNew domain has been set up with the webserver (Apache or NginX).\nSet up SSL for the new domain on server (optional)\nYou can contact your hosting provider for support to set up new domain on your server if you don't know how to do it.","update-the-env-file#Update the .env file":"The .env file will be generated automatically under the webroot folder when installing MetaFox site. This file contains many critical configuration for database and site URL.To access and update this with your new domain, you'll need to find your FTP credentials from your hosting provider, or use File Manager of Server Management Tool (such as cPanel, Plesk).Once you have access to the server, browse to the webroot folder (such as public_html), edit the .env file. What you will see is similar below:You can look for the config APP_URL and update it with the new domain as below. Then, Save the .env file.","clear-cache-and-rebuild-frontend-in-admincp#Clear cache and rebuild frontend in AdminCP":"You can log into the AdminCP and go to clear cache and rebuild frontend in AdminCP.Congratulation. The procedure to change domain is done. You can check your site with the new domain now."}},"/advanced-setups":{"title":"Advanced setups","data":{}},"/advanced-setups/configure-cache":{"title":"Configure Cache","data":{"":"This section to have how-to articles about Cache system on MetaFox site"}},"/advanced-setups/configure-cache/clear-cache":{"title":"Clear cache","data":{"":"This article will guide to how to clear cache on MetaFox siteLog into AdminCP of your site. Click on the Broom icon on the top header bar.Click on the Clear Cache button.Done! All caches have been removed properly then."}},"/advanced-setups/optimize-php-settings":{"title":"Optimize PHP settings","data":{"":"You need to optimize some PHP settings in order to be  able to upload larger size files, have more connections at the same time, etc. , including:\nIncrease execution time \nPHP param max_execution_time is 30 seconds by default. Recommended value for phpFox site is 60 seconds\nIncrease Max Upload Size \nThe Max Upload Size is limited by 2 PHP params: post_max_size and upload_max_filesize.  The default PHP values are 2 MB for upload_max_filesize, and 8 MB for post_max_size. You should increase 2 these params to appropriate values, specially if your phpFox site supports video upload.\nIn general, these PHP settings can be configured on server. If you are NOT familiar with server management, we strongly recommend you to reach out to hosting provider or technicians for assistances to configure PHP settings.In this tutorial, I will guide you to how to update on both Nginx and Apache server.","changes-in-phpini#Changes in php.ini":"On CentOS: php.ini is saved in: /etc/php.iniOn Ubuntu: php.ini is saved in: /etc/php/8.1/fpm/php.ini (which 8.1 is php version that installed in your server)bashtrue(Increase php execution time to 3000 seconds, max upload size to 20M)","changes-in-nginx-config#Changes in Nginx Config":"On file nginx config for your site, add this line fastcgi_read_timeout 3000; like this:bashtrue(Increase request time out to 3000 seconds). Just add this line fastcgi_read_timeout 3000; keep default other configurations. You can preference this tutorial  for more detailBy Default, the path of nginx config is saved in /etc/nginx/nginx.conf (CentOS) or /etc/nginx/sites-available/default (Ubuntu)","reload-nginx-and-php#Reload NginX and PHP":"Run these commands:bashtrue","check-your-result#Check your result":"Check on phpinfo","changes-in-phpini-1#Changes in php.ini":"On CentOS: php.ini is saved in: /etc/php.iniOn Ubuntu: php.ini is saved in: /etc/php/8.1/apache2/php.ini (which 8.1 is php version that installed in your server)bashtrue(Increase php execution time to 3000 seconds, max upload size to 20M)","reload-apache#Reload apache":"Run these commands:bashtrue"}},"/advanced-setups/block-ip-addresses-with-htaccess-file":{"title":"Block IP Addresses with htaccess file","data":{"":"Blocking an IP address in the .htaccess file is a common way to prevent unwanted traffic from reaching your website. Here are the steps to block an IP address using the .htaccess file:Access Your .htaccess File:This file is usually located in the root directory of your website.Use an FTP client, a file manager provided by your web hosting control panel, or SSH to access the file.Add the IP Block Rule:To block a specific IP address, add the following lines to the top of your .htaccess file:Replace 123.456.789.000 with the IP address you want to block.You can block multiple IP addresses by adding additional deny from lines:Save and Upload the .htaccess File:Save the changes to your .htaccess file.If you used FTP or SSH, upload the modified file back to your server.Test the Configuration:Verify that the IP address is blocked by attempting to access your website from the blocked IP address.You can use a proxy service or ask someone with the specific IP address to test it.","additional-notes#Additional Notes":"Blocking an IP Range: If you need to block an entire range of IP addresses, you can use CIDR notation or a partial IP match:Or:Blocking by Hostname: To block by hostname, use:Be careful when editing the .htaccess file as incorrect configurations can lead to website downtime or other issues. Always keep a backup of the original .htaccess file before making any changes.By following these steps, you can effectively block specific IP addresses from accessing your website using the .htaccess file."}},"/advanced-setups/install-php-pcntl-extension-on-ubuntu":{"title":"Install PHP pcntl extension on Ubuntu","data":{"":"PHP pcntl extension (Process Control Extension) is required by MetaFox script. In some cases that the PHP pcntl extension isn't available on the default PHP build or is restricted to web server, you might have to compile this PHP extension pcntl from the source manually. This guide will walk you through the process of compiling and installing the pcntl extension on an Ubuntu server using the command line.If you're using CentOS or Red Hat Enterprise Linux, the process is similar. Instead of using apt-get, use yum for package installation, and follow the steps accordingly.","prerequisites#Prerequisites":"Before you begin, make sure you have the following:\nAn Ubuntu server with root or sudo privileges.\nPHP and the necessary build tools installed on your server.","step-1-install-build-dependencies#Step 1: Install Build Dependencies":"To compile the pcntl extension, you'll need the necessary build tools and development packages. Open a terminal and run the following command to install them:","step-2-download-php-source-code#Step 2: Download PHP Source Code":"To compile the extension, you'll need the PHP source code corresponding to the PHP version you're using. Follow these steps to download the source code:Check PHP Version: Determine your PHP version by running the following command:Note down the PHP version for later use.Download PHP Source: Visit the PHP website's downloads page and download the source code for your PHP version. Alternatively, you can use the following command to download it directly:Replace X.Y.Z with your PHP version (e.g., 8.1.22).Extract Source Code: Extract the downloaded archive:","step-3-compile-the-pcntl-extension#Step 3: Compile the pcntl Extension":"Navigate to Extension Directory: Change into the directory containing the PHP source code:Compile the Extension: Use the following commands to compile the pcntl extension:","step-4-install-the-extension#Step 4: Install the Extension":"After successfully compiling the extension, you can proceed to install it:Install Extension: Run the following command to install the compiled extension:","step-5-enable-the-extension#Step 5: Enable the Extension":"To enable the pcntl extension, follow these steps:Create .ini file for PHP extension: Create the PHP configuration file in a text editor (e.g., nano):Replace X.Y with your PHP version (e.g., 8.1)Add Extension: Add the following line to enable the pcntl extension. Add it under the \"Dynamic Extensions\" section:Save and Exit: Save the file and exit the text editor.","step-6-restart-services-php-fpm-and-web-server-apache#Step 6: Restart services PHP-FPM and Web server (Apache)":"Restart PHP-FPM: If you are using PHP-FPM, run following command to restart PHP-FPM serviceRestart Apache: If you are using webserver with Apache, run following command to restart","#":"You have successfully compiled and installed the pcntl extension for PHP on your Ubuntu server."}},"/advanced-setups/set-up-google-recaptcha":{"title":"Set up Google reCaptcha","data":{"what-is-recaptcha#What is reCAPTCHA?":"reCAPTCHA is a free service from Google that helps protect your website from spammers and abuse. A “CAPTCHA” is a turing test to tell human and bots apart. It is easy for humans to solve, but hard for “bots” and other malicious software to figure out. By adding reCAPTCHA to a site, you can block automated software while helping your welcome users to enter with ease.To Enable the CAPTCHA app, go to your AdminCP>> Setting >> Captcha. MetaFox supports 2 default captcha that are ReCaptcha v3 and Image captcha","setting-up-recaptcha-v3#Setting up Recaptcha v3":"First of all, you'll need to set up your Google reCAPTCHA account.  \nAdd a Label so you know which site this is for.\nSelect ReCaptcha v3\nAdd your domain such as yourdomain.com . It will be for the full domain range so if you have subfolders or subdomains, it will work for those.\nOwner: enter your email address as the owner\nChoose if you want to get alerts if Google detects problems with your site, such as misconfiguration errors or an increase in suspicious traffic.\nHit submit button to register.\nOnce you've registered, you'll get the Site Key and Secret Key. Copy those as you'll need them for the next step.\nGo back to AdminCP >> Settings >> Captcha >> Select the reCaptcha V3>> choose Edit \nOn the next page, you'll see there are 2 fields where you paste the Site Key and Secret Key. Don't forget to Save changes. \nTipIt's always a good idea to clear your site's cache after adding anything.After setting up ReCaptcha v3, you can enable the captcha on login and registration.Select the Rules tab on the top right, and you will see the list of options including  2 options 'Captcha on Login' & 'Captcha on Registration'.Remember to hit Save Changes to save each setting.Now registration form and login form of your site will be protected by Captcha. Users need to finish the captcha before submitting the form.","setting-up-image-captcha#Setting up Image Captcha ":"It's more simple to set up an image captcha. From Admin cp>> Settings>> Captcha>> Settings>> Select Image CaptchaThis is how the image captcha challenge looks like"}},"/advanced-setups/generate-sitemap-xml-for-seo":{"title":"Generate Sitemap XML for SEO","data":{"":"Sitemaps show the structure and webpages of your site in a XML format Google’s bots can understand. A sitemap guides the crawl bots through your site, showing them the most important pages. Remember, you want Google’s bots to crawl your site, so the search engine understands which search terms your website is most relevant for. This guide will guide you how to configure and get Sitemap for Google Search ConsoleNow, let's log in your MetaFox site with Admin user and go to AdminCP > Settings > SEO. Then click on the Sitemap Settings menu on the top-right corner to go to the Sitemap Settings pageOn this page, you can choose which apps will be published in the Sitemap. Then, click Save Changes button to apply your selection.You can verify the Sitemap Index page at http://yourdomainsite.com/sitemap/index.xml . Please replace the yourdomainsite.com with your actual domain.You can use this Sitemap link to submit on Google Search Console"}},"/build-mobile-apps":{"title":"Build Mobile Apps","data":{"":"This section provides step-by-step instructions to help you create and publish your MetaFox mobile applications for both iOS and Android. You’ll find detailed articles covering everything from preparing your development environment, configuring app settings, customizing branding to compiling the apps and submitting them to the App Store and Google Play.Whether you’re building the apps yourself or working with a developer, these guides ensure a smooth, organized, and successful build process."}},"/build-mobile-apps/build-android-app-with-mobile-source-code":{"title":"Build Android app with Mobile source code","data":{"":"This article will guide you to build your Android apps with Mobile source code","prerequisites#Prerequisites":"","mobile-devices#Mobile Devices":"- Supported Android versions: 8.0+","development-environment#Development Environment":"We recommend to use macOS system as a development environment because:\nAble to develop cross platform Mobile application (Android, iOS).\nWe got tons of utilities scripts that were mainly written in Bash Script, which tested and worked compatibly only with Unix environment.\nWe assume that you have experiences in React Native project and how to build React Native mobile apps. Please following this Environment Setup guide to set up the development environment for React Native (RN) project\nNode version >= 16.14\nYarn version = 1.21.0\nReact Native version: 0.70.6","project-structure#Project structure":"Folder packages: contains all main RN/Javascript codeFolder app: Contains entrypoint for each module section from folder `packages`. Do not change anything here, we got the script to handle these generated codeFolder android: Contains Java/Kotlin native code - mostly handle native things for Android appFolder scripts: contains all utilities scripts","setup#Setup":"","configuration#Configuration":"You can update our mobile configuration and assets for Android app in:\nCopy the android/app/configuration_example.json to android/app/configuration.json and configure this file with proper values.\nSet `enableGooglePay: true` to enable Google Pay\nFirebase config file android/app/google-services.json\nPlease refer this guide to download it from your Firebase project for Android app\nKeyStore file at android/app/<your_app>.keystore\nRefer to this guide to create your keystore file","mobile-assets#Mobile assets":"Update images of app icon, logo and login background in the folder android/app/src/main/res \nUpdate splash screen: You can run the following command to generate splash screen after updating app icon:\n--logo-width=100 --assets-path=assets","load-configuration#Load configuration":"Whenever you change the configuration files above, you need to re-run these steps again:","quick-start#Quick start":"Start React Native metro package managerRun the following commands to start Android app on Android emulator (default basing on Android Studio config)","other-utilities-scripts---cli#Other Utilities scripts - CLI":"Build release app.apk for Android alternatively Gradle buildBuild release app.bundle for Android alternatively Gradle bundle"}},"/build-mobile-apps/build-ios-app-with-mobile-source-code":{"title":"Build iOS app with Mobile source code","data":{"":"This article will guide you to build your iOS app with Mobile source code","prerequisites#Prerequisites":"","mobile-devices#Mobile Devices":"- Supported iOS versions: 13+","development-environment#Development Environment":"We recommend to use macOS system as a development environment because:\nAble to develop cross platform Mobile application (Android, iOS).\nWe got tons of utilities scripts that were mainly written in Bash Script, which tested and worked compatibly only with Unix environment.\nWe assume that you have experience in React Native projects and how to build React Native mobile apps. Please following this Environment Setup guide to set up the development environment for React Native (RN) project\nNode version >= 18\nYarn version = 1.21.0\nReact Native version: 0.73.9","project-structure#Project structure":"Folder packages: contains all main RN/Javascript codeFolder app: Contains entrypoint for each module section from folder `packages`. Do not change anything here, we got the script to handle these generated codeFolder ios: Contains ObjectiveC/Swift native code - mostly handle native things for iOS appFolder scripts: contains all utilities scripts","setup#Setup":"","configuration#Configuration":"You can update our mobile configuration and assets for iOS app in:\nCopy ios/configuration_example.json to  ios/configuration.json file and configure this file with proper value\nSet `merchantId` to enable Apple Pay\nFirebase config file ios/GoogleService-Info.plist\nPlease refer this guide to download it from your Firebase project for iOS app","mobile-assets#Mobile assets":"Update images in the folder ios/Mobile/Images.xcassets/AppIcon.appiconset\nUpdate splash screen: You can run following command to generate splash screen after updating app icon\n--logo-width=100 --assets-path=assets]] >","load-configuration#Load configuration":"Whenever you change the configuration files above, you need to re-run these steps again:","run-your-ios-app#Run your iOS app":"Start React Native metro package managerRun the following commands to start iOS app on iOS simulator"}},"/build-mobile-apps/accounts-and-mobile-assets-to-build-mobile-apps":{"title":"Accounts and mobile assets to build mobile apps","data":{"":"**Table of Content\n**Requirements- Please follow carefully and provide us with all required information for app building process as follow.\n- If any information or asset is invalid upon verification, we are unable to proceed you to the app building process and you are required to provide us with valid pieces again.Note on image requirementsPlease send us only 1 version for each required image with the right size (in pixels) and format (in PNG).","app-details-and-mobile-assets#App details and mobile assets":"","1-app-title#1. App Title":"","2-app-icons#2. App Icons":"A. Main app icon (displayed on Home screen or App listing)\nSize: 1024 x 1024 pixels (square image doesn't have rounded corners) \nFormat: PNG\nB. Push notification icon (for Android)\nSize: 1024 x 1024 pixels\nFormat: PNG\nImage needs to have logo in white color and transparent background\nC. Foreground app icon\nSize: 1024 x 1024 pixels\nFormat: PNG\nImage needs to have logo and transparent background. See the image below for reference.\nIn order for your app icon to display well on Android devices, please follow Google Guidance to design at https://medium.com/google-design/designing-adaptive-icons-515af294c783\nWidth and Height of the main logo image should be 50% - 60% Off the width and height of the foreground image\nD. Background app icon\nSize: 1024 x 1024 pixels\nFormat: PNG\nImage needs to have only a background.  See the image below for reference.","3-logo-and-background-on-login-page#3. Logo and Background on Login Page":"A. Background Color: such as #2681D5 B. Logo: 960 x 260 pixels\nBackground of the image should be transparent so that when it's attached to the background, it will look more properly.The logo should include the app icon and app name.Here is an example of the logo of phpFox mobile app. Please note that this example phpFox logo has a transparent background and the app name is in white color so you can click on it to check.Note: The grey area in the logo is transparent background.Format: Both are in PNG","4-default-colors#4. Default Colors":"Give us a primary color code of your mobile app. This color code will be the main color which reflects the theme of your mobile app. Below is the example of our default color code.","accounts#Accounts":"Below are account details that we will need to build your Premium mobile apps","google-firebase#Google Firebase":"The mobile apps use Firebase for push notifications and other functionalities on mobile apps.Please register a Fireabase project with your Google account and invite us to be Owner on your Firebase project by following this guide.","google-developer-account#Google Developer Account ":"If you don't intend to have an Android app, you can skip enrolling in the Google Developer account.You need to enroll in Google Developer program. Please refer to the Guide to register for a Google Developer account.\nMake sure your developer subscription on your account is activated. To check the status of your enrollment, sign in to your account on the developer website with the Google ID you used to enroll.We will need you to invite us to be Developer role on your Google developer account for this task. Please follow the instruction here and invite us with email: mobile.phpfox4@gmail.com","apple-developer-account#Apple Developer Account":"If you don't intend to have an iOS app, you can skip the Apple Developer account.You need to enroll in Apple Developer Program. Please refer to the guide Guide to register for an Apple Developer account.\nMake sure your developer subscription on your account is activated. To check the status of your enrollment, sign in to your account on the developer website with the Apple ID you used to enroll.We need 2 invitations from your Apple accountA. Apple Developer accountWe need to access your Apple Developer account to set up app certificates, app bundle ID and provisioning profiles.- If your Apple Developer account is Personal subscription, you have to give us the credentials to access. Otherwise, we are unable to proceed to build your iOS app. Since Apple requires login verification, we can schedule a quick chat at our appropriate time so you can support us to pass the login verification of the Apple Developer account.- If your Apple Developer account is Organization type, you can invite us (with account email mobile-dev@phpfox.net ) to be Developer role on your Apple developer account.\nPlease follow the instruction here to invite us using email mobile-dev@phpfox.netTips: Convert your Apple Developer account program from Individual to Organization.B. Apple Appstore ConnectAfter building the iOS app, we will need to access your Apple Appstore Connect to upload iOS build to TestFlight so you can install and verify it.To invite us on Appstore (iTunes) Connect, please follow the guide How to Invite Users to your App Store Connect Account.","facebook-login#Facebook Login":"This item is to set up Log in with Facebook on the mobile apps. If you don't want to have this feature on mobile apps, you can skip the Facebook App Invitation.Please follow the steps below to invite us as Developer on your Facebook app- From Facebook Developer page > My Apps > Add a New App.\n- From there, you can choose any option (Let's choose WWW and we will help to configure later).\n- Type your website URL into the text field and follow the on-screen instruction.\n- After finishing, click on \"Roles\" on the left-side menu then click on \"Add Developers\". Input \"paul.kell.353\" and then Submit.Reuse Facebook app1. If you don't want to create a new Facebook app to host your phpFox app, and you would like to re-use your current Facebook app to preserve all data and reports on your Facebook app. You will need to notify us and give us permission to overwrite our data to your current Facebook app. Also, be ready to give us the keystore or certification on your Facebook app (You might need to request a 3rd-party developer who previously developed the app), so we can overwrite our data.2. Please also note that there is a high chance that once we overwrite our data, any instances which connect to use your current Facebook app will not work anymore. Have the plan to backup prior to allowing us, we will not be responsible for any failure from other apps after overwriting our data.","site-info#Site Info":"Please provide us with 3 important pieces of information about your site:- Site URL- Admin login account- cPanel/FTP access to your server","ads-with-google-admob#Ads with Google Admob":"If you want your mobile apps to support ads of Google Admob, please register Google Admob and provide us Admob App ID . Otherwise, you can skip this info"}},"/build-mobile-apps/use-multi-site-metafox-mobile-apps":{"title":"Use multi-site MetaFox Mobile apps","data":{"":"Step 1: Install the iOS and Android app\nYou will need to go to the Apple Store or Google Play on your device and search for our app named MetaFox, then proceed with downloading and installing the app.\nStep 2: Getting started\nAfter installing successfully, open the app\nOn the first screen, please enter the URL of your MetaFox site in the Server Address field. For example: if your site is at URL: https://yourdomain.com, please put the value \"https://yourdomain.com\" into this field.\n                                Then tap Connect button.Step 3: If the Mobile API app has been set up correctly on your site, users will go directly to the login Screen.                              \nOn this Login Screen, enter the user's login credentials on the MetaFox site. There are options for users to Sign up for a new account or reset their password and log in with other options like Facebook and Google.\nAfter signing in/up, users can enjoy your social with the multiple-site MetaFox Mobile app.\nAnd finally, hope you will have a good time with our app!"}},"/build-mobile-apps/set-up-sign-in-with-apple-on-ios-app":{"title":"Set up Sign in with Apple on iOS app","data":{"":"This article will guide you how to set up Apple Login with your iOS App. The setup includes 2 steps: Generate Service Key on Apple Developer and configure that key on the MetaFox site.","generate-service-key-on-apple-developer#Generate Service Key on Apple Developer":"Now, let's log into your Apple Developer and go to the Certificates, Identifiers & ProfilesClick on the  button to register a new identifier for Apple Login. In the Register page, please choose the Service IDs option as belowClick Continue button to move the next step to fill the Identifier and Description.The Identifier should be prefixed by the App Bundle ID. For example, if your iOS app is having bundle ID com.metafoxapp.mobile , you can use the identifier of com.metafoxapp.mobile.apple1 as belowThen click the Continue button.In this step, you can select the Sign in with Apple option. Then Click on the Configure button to configure App IDIn this Configure Key screen, you will choose the App Bundle ID of your iOS app as below. Then click the Continue buttonClick on the Register button to complete the registration.You will need to download the key as well as note the Key ID to configure in the MetaFox site.You have registered successfully the Identifier for Sign in with Apple on Apple Developer. Now, we will move ahead to configure the MetaFox site for the Sign in with Apple","configure-metafox-site#Configure Metafox site":"Let's log into your MetaFox site with Admin user and go to the AdminCP > App Settings > Social Connect. Then, choose the Apple tab on the top headerYou will configure the settings as below and then save to complete the setup.Congratulation. You have completed the setup for the Sign in with Apple for your iOS now."}},"/getting-started/essential-steps-after-installing-metafox":{"title":"Essential steps after installing MetaFox","data":{"":"What should you do after installing MetaFox? This is a very common question asked by beginners. This article will show you the top most essential things you SHOULD do."}},"/getting-started":{"title":"Getting Started","data":{"":"On this page:Child pages will be listed here"}},"/build-mobile-apps/premium-mobile-build-process":{"title":"Premium Mobile Build Process","data":{"":"This article is for clients who are holding MetaFox Ultimate license. In this article, we will provide you with a completed step-by-step guide for the Premium Mobile app-building process. Please carefully review and follow each step to ensure your apps can be built with the best quality and on time.We assume that the Mobile API has been set up and verified properly. If not, please refer to this article to set up Mobile API. You can use the phpFox Mobile app to verify if Mobile API has been set up correctly or not.","step-1---initiate-the-premium-mobile-build-service#Step 1 - Initiate the Premium Mobile Build Service. ":"When you kick start setting up your MetaFox site and be ready to get a mobile app of your own. You can initiate the mobile app-building process for your site, log in to Client Area and Submit a ticket to us.Note that you have to open a ticket under the account holding the MetaFox Ultimate license. You need to prepare and provide us with all the required assets we need for building your app by completely filling out this form MetaFox Mobile App Requirements form.Please check the How to request to build your Premium Mobile app article for more requirements details and instructions.","step-2---verify-the-information-and-assets-we-received#Step 2 - Verify the information and assets we received":"After all the required information and assets of the mobile app are received, it takes us a little bit of time to verify your assets.In general, the verification process usually takes about 1 business day to finish, but it depends and might take longer.- We will inform you of any invalid info or asset, then you can provide us again valid pieces.- If all the items are valid to our criteria, we will confirm and proceed with the next step.","step-3---build-and-test-your-mobile-app#Step 3 - Build and test your mobile app":"Once your mobile assets are all good and ready to proceed with the build. Our team will schedule and inform you about the detailed timeline. Normally, it takes about 2-4 business days for us to build and test your mobile apps. After successfully building an application, it is necessary that the quality of the application is ensured to be on point.","step-4---providing-build-files-for-testing-purposes#Step 4 - Providing build files for testing purposes":"When the build of your app is completed, now it's ready for you to review. You can test your iOS app via TestFlight and your Android app via AAB file. The AAB file will be delivered to you for testing. After installation, you can now start the app and begin your testing process. Please go through all the features and functionality of the app, if you are confused or encounter any bugs/errors/problems, please report them to us. We will help check to fix/resolve reported issues.Details on Resolving IssuesAt this stage, the below rules will be applied for fixing issues:1. We will fix critical issues of the mobile app which impact significantly the main functionalities or user experiences... We will examine this case by case and provide you with clear information on this.2. Any issue that we check and confirm is the issue of our mobile app (For instance the issues also appear in the demo mobile app), we will consider and provide you support to resolve them. However, for minor issues, the patch will be included next releases of the mobile app.\n3. To fix issues, depending on the complexity of the issues, our team will arrange a specific timeline to resolve each issue. Please work with us on this timeline.","step-5---resolving-issues-and-rebuild-the-app-if-needed#Step 5 - Resolving issues and rebuild the app (if needed)":"After all the reported issues are recorded and confirmed, we will process fixing and rebuilding the app for you.Test the app carefully and report as many issues as you can at one time in the previous step as the rebuild time is limited to 3 times. It means you have the first build from us to test for issues/problems, then you will have another 2 builds to fix the issues you reported. After we fixed and rebuilt, we will distribute the app to you for verification again, and you can test the app again just like what you do in step 4 above.falseRebuild Fee PolicyIn case after 3 builds and you still figure more issues on the mobile app, you can request us to rebuild the app to fix these. But now you will be charged for the build request.","step-6---distributing-apps-and-publishing-the-app-to-stores#Step 6 - Distributing apps and Publishing the app to Stores":"Once you finish your internal testing process and your apps are ready for users to download, you can request to take the build service to the next step - publishing your apps to Stores.The iOS and Android builds will be uploaded under your Apple Developer and Google Developer accounts.  You will find them on App store connect and Google play console. You will need to go ahead to fill in all the required app details and then submit them for app review and approval. It is necessary to note that our Mobile Build Service doesn't cover app distribution. You are supposed to work directly with the reviewer to explain their inquiries if having any.Our Mobile Build Service doesn't include follow works:\nConfigure App Details on Apple Store and Google Play\nTherefore, we are NOT responsible for app rejection due to reasons relating to site content, app details, or missing materials.","after-the-upload-of-the-builds-to-your-developer-account-the-build-process-is-finished#After the upload of the builds to your Developer Account, the Build Process is finished.":""}},"/getting-started/dowload-metafox-source":{"title":"Dowload MetaFox Source","data":{"":"Assume that you have purchased MetaFox license successfully. In this article, we will guide you to download the MetaFox source package.Let's log into the Client Area with your client account. Then go to the Services page. This page will list your active MetaFox license as the screenshot belowClick on an active MetaFox License in the Product/Service list to go to the Product Details page. In this page, you can click on the Download Latest Version button at the bottom of License Information section.Or go to the Downloads section to download source packages associated with the purchased license. Note that if you purchased the MetaFox Ultimate License, you will see the item to download the Mobile Source (React Native) as below."}},"/getting-started/install-metafox":{"title":"Install MetaFox","data":{"":"MetaFox can be installed with either Docker or LAMP server. Before starting, you will need to complete all preparation steps for Installation with either or .Now, we will walk you through the steps to properly install MetaFox with MetaFox Installation WizardAssume that your webserver has been set up with the domain yourdomain.com. You can visit the Installation Wizard at the link: https://yourdomain.com/install/ Follow installation steps and input all required info in the Installation Wizard to complete the installation:\nSystem Requirements: Please make sure that all items under System Requirements have green checks as below.\nLicense Key and Private Key: You can get the license info within Client Area. Note that your license domain will be verified at this step also.\nDatabase: At this step, you will fill in all database credentials that you have created during the preparation steps.\nSite Info: You are going to fill in info of Site Name and the Super Administrator user (username, email address and password) in this step.\nApplications: If you have purchased apps on the Appstore, such as ChatPlus, etc. you can select those apps to install at this stepAfter all info is given properly, you can proceed the last step to install MetaFox site.Done: When installation is completed successfully, you will see this screenNow, going to the Landing page at the main URL, you should see the default Landing page of MetaFoxAfter the installation is completed, you should remove the public/install folder to avoid security risks.","setup-cron#Setup Cron":"Many features require cron to work. Please configure two following crons. You can get the cron command in AdminCP > Settings > Schedule pageCron for Schedule runs every minute/dev/null 2>&1]] >Cron for Queue runs every 5 minutes/dev/null 2>&1]] >","the-metafox-installation-is-done-you-can-start-to-enjoy-and-go-ahead-to-configure-your-metafox-site#The MetaFox Installation is done. You can start to enjoy and go ahead to configure your MetaFox site.":""}},"/getting-started/install-metafox/prepare-for-installation-on-lamp-server":{"title":"Prepare for Installation on LAMP server","data":{"":"Assume that your server already meets MetaFox System Requirements. In this article, we will walk you through the preparation steps to install MetaFox on a normal server with the LAMP stack (Apache2, PHP, and MySQL), includes following steps:\nUpload MetaFox source on your server\nConfigure proper permissions of folders\nCreate database and database user","upload-metafox-source-on-your-server#Upload MetaFox source on your server":"You can download the zip file of the latest MetaFox version in Client Area and extract it on your local machine at /path/to/metafox folder.Then, extract the /path/to/metafox/upload.zip file you will see the following source structure under the upload folderThen, upload ALL folders and files under the upload folder to the webroot folder of webserver. Normally, the webroot folder of your server usually has the name public_html. \nIf you aren't sure where is the webroot folder, you should ask your hosting provider or system administrator.\nTo avoid unexpected issues when uploading source files onto the server, it is highly recommended to upload the upload.zip file on your server and then extract source files to the webroot folder.\nFor easy explanation from now on, we will assume that the webroot folder is /home/metafox/public_html","create-htaccess-file#Create .htaccess file":"After extracting all source files at /home/metafox/public_html, now can you can go to /home/metafox/public_html and copy the content of htaccess.example to  the existing .htaccess file . If the .htaccess file doesn't exist, you can simply rename the htaccess.example to .htaccess","configure-proper-permissions-of-folders#Configure proper permissions of folders":"You will need to grant the write permission on the following folders:\nstorage/* (recursively)\npublic/* (recursively)\nbootstrap/cache/* (recursively)\nconfig/* (recursively)","create-database-and-database-user#Create database and database user":"Next step is to prepare the database user and database for the MetaFox site. There are many ways to set up database user and database on your server. Hosting service provider usually provide a server management tools, such as cPanel, Plesk, DirectAdmin, etc. \ncPanel\nPlesk\nIf your hosting is using another server management tool, they should have the detailed guide on this setup so please feel free to contact the Help Desk of your hosting provider if you don't know how to create database.You need to note the following details when completing this step:\nDatabase Host (if database is on the same server, the host will be localhost)\nDatabase Name\nDatabase User\nPassword\nPort (default 3306 for MySQL and 5432 for Postgres)\nCongratulation! All preparation steps have been done. All are ready to start site now."}},"/getting-started/install-metafox/prepare-for-installation-with-docker":{"title":"Prepare for Installation with docker","data":{"":"MetaFox can be set up and installed quickly with Docker. Assume that your server supports Docker and Docker Compose with Linux docker images. In this guide, we are going to walk you though steps to install MetaFox siteAfter downloading the MetaFox package in Client Area, you can extract the MetaFox package to the /path/to/metafox folder on your local machine or server having Docker. You can follow this guide to quickly start MetaFox site with docker:\nModify the database name, user and password in the file server.env under /path/to/metafox/docker folder if needed. The database info will be used on the Installation Wizard when installing MetaFox later. Note that the database host name is postgres . Below is the sample config of file server.env\nOpen terminal, log in to your server with SSH user having permission to run docker\nGo to the folder that the package has been extracted to\nRun following command in terminal:\nPlease don't forget to replace the /path/to/metafox in the above command with your actual folder pathNow, you can start installing MetaFox with the Installation Wizard at http://your_server_ip:8080/install/ as the  article.","build-frontend-manually#Build Frontend Manually":"The Frontend source for the web is located at the /path/to/metafox/source/frontend-web folder. If you are familiar with React, you can customize the Frontend web in this folder if you want and then rebuild the frontend with the following command"}},"/getting-started/update-metafox":{"title":"Update MetaFox","data":{"":"MetaFox site can be updated easily and quickly in 2 ways:\nUpdate in AdminCP \nUpdate manually\nBefore updating MetaFox site, please create full backup first so you can restore your site if having any problems during the Product Update process. MetaFox already supports Backup feature in AdminCP > Maintenance > BackupAssume that you already back up your site successfully. Now, we can go ahead to update MetaFox site.","update-in-admincp#Update in AdminCP":"In AdminCP > Site status, there will be a Update link if new version is available for your site to upgrade.Click on the Update link to go to the Update WizardAssume to you have created backup, click the Continue button to move to the next step to select apps to updateIn the Application step, you can select apps you would like to upgrade along with MetaFox Core at this time. Select All to update all apps. Then click the Continue button to start updatingNew MetaFox package and apps will be downloaded and updated on your site. It will take a few minutes to complete the updating.","update-manually#Update manually":"In this way, you will need to download the latest MetaFox package in Client Area and upload source on your server.Then, go to the MetaFox Installation Wizard at URL: yourdomain.com/install/ to start updating MetaFox. Note: you need to replace the yourdomain.com with the actual domain of your MetaFox site. At the 1st Prepare step, you are recommended to back up your site before proceeding the Product Update.Once your MetaFox is backed up, you can click on Continue button to start updating the MetaFox site.After the Product Update process will automatically go through all the necessary steps to upgrade your site and rebuild the frontend (web). The site will be inaccessible during the Product Update process and launched after completed."}},"/getting-started/system-requirements":{"title":"System Requirements","data":{"":"In this article, we are going to give you more details about the standard recommendations for a server when running MetaFox.","here-is-the-minimal-serverconfiguration#Here is the Minimal Server Configuration":"CPU: Single core (2 GHz)\nRAM: 2GB\nDisk: SSD\nMetaFox can be installed with either Docker or normal hosting service. Now we will take a deeper look into the requirements for each setup option below","setup-with-docker#Setup with Docker":"This is the easiest and highly recommended setup for MetaFox as it can be quickly installed and run well on servers or cloud hosting supporting Docker applications. You can consider using the following hosting service type for the MetaFox site:\nDedicated server: On a dedicated server, you will have root permission to set up Docker environment and install the MetaFox site quickly and easily.\nVPS / Cloud Hosting: Your SSH account needs to have permission to run the Docker application\nDocker hosting platforms: There are many hosting platforms providing powerful, reliable infrastructure and services for Docker applications such as Amazon ECS, Digital Ocean, Google Cloud Run, etc.","normal-setup-on-hosting-service-with-lamp-or-lemp-stack#Normal Setup on hosting service with LAMP or LEMP stack":"Hosting plans of hosting service providers usually supports a bundle of software technology for websites to run, such as LAMP or LEMP stack, etc by default. MetaFox can also be installed on such server or web hosting with the following requirements: \nServer OS: Linux\nWeb server:  Apache or (NginX + PHP-FPM)\nIf using Apache server, mod_rewrite is required\nDatabase: Postgres (13.0 or higher), MySQL (8.0 or higher), MariaDB (10.6 or higher)\nPostgres is recommended\nPHP: PHP 8.2 or higher\nThe new PHP 8.4 has recently been released and will soon be fully compatible with MetaFox.\nPHP params:\ndisable_function does not include:\nexec\nshell_exec\nproc_open\nproc_close\nmemory_limit: at least 256MB\nPHP Extensions:\nRequired: \nmysqlnd (nd_pdo_mysql) (recommended) or MySQLi: if using MySQL database\npgsql: if using Postgres database\ngd\ncURL\nzip\nmbstring\nxml\ndom\njson\nbcmath\nctype\nopenssl\npcntl\npcre\nfileinfo\ntokenizer\nexif\nsodium\nintl\nsocket\nOptional:\nimagick\nredis\napcu\nopcache\nAdditional Requirement for the Video App : \nIf you want to allow users to upload videos from their computer, your server must be able to encode/transcode videos so that they can be displayed on your website properly. So FFMPEG mus be installed on your server. Be aware that video encoding/transcoding is a CPU-intension task and can take a long time to run, you should only install it on a dedicated environment such as a dedicated server. If you are using Shared Hosting or VPS / Cloud Hosting environments, be sure to check with your hosting provider to see if they allow this encoding task.\nIf you are unsure if your server meets the product requirements, please contact your host and send them this page."}},"/":{"title":"Welcome to phpFox User Manual","data":{"":"Welcome to the comprehensive user manual for phpFox, your complete social networking platform solution.","what-is-phpfox#What is phpFox?":"phpFox is a powerful and flexible social networking platform that allows you to create and manage your own social community. With phpFox, you can build engaging online communities with features like:\nUser Profiles - Customizable user profiles with photos, videos, and personal information\nActivity Feeds - Real-time updates and social interactions\nGroups & Events - Create and manage communities and gatherings\nMarketplace - Buy and sell items within your community\nMobile Ready - Responsive design that works on all devices","getting-started#Getting Started":"📦 Installation\nLearn how to install and set up phpFox on your server\n🚀 Quick Start\nGet up and running with phpFox in minutes\n📚 User Guide\nComprehensive guide to using phpFox features","key-features#Key Features":"","for-users#For Users":"Create and customize your profile\nShare photos, videos, and updates\nConnect with friends and family\nJoin groups and participate in discussions\nAttend and create events","for-administrators#For Administrators":"Complete admin control panel\nUser management and moderation tools\nTheme and layout customization\nPlugin and app marketplace\nAnalytics and reporting","need-help#Need Help?":"Check out our Getting Started Guide\nBrowse the User Guide for detailed instructions\nExplore Advanced Features for power users\nReview the API Reference for developers","about-this-documentation#About This Documentation":"This documentation is organized into several sections:\nGetting Started - Installation and initial setup\nUser Guide - Day-to-day usage and features\nAdvanced - Customization and advanced configurations\nAPI Reference - Developer documentation and API guides"}},"/manage-community":{"title":"Manage Community","data":{}},"/manage-community/manage-ban-filters":{"title":"Manage ban filters","data":{}},"/manage-community/check-logs":{"title":"Check logs","data":{}},"/manage-community/manage-reported-items":{"title":"Manage Reported items","data":{}},"/manage-community/manage-users":{"title":"Manage users","data":{"":"The Manage Users section provides comprehensive guidance on efficiently administering user accounts within the system. Whether you are an administrator or a user with specific roles, this manual equips you with the knowledge and tools to effectively manage user profiles, access levels, and security settings"}},"/manage-community/manage-users/configure-role-permissions":{"title":"Configure Role Permissions","data":{"":"This section serves as your detailed guide to customizing and fine-tuning role-based access control within the MetaFox product. This manual empowers administrators and users with elevated privileges to effectively manage and define permissions associated with various roles, ensuring a secure and tailored user experience.Let's start by logging into your MetaFox site with the Admin user. Then go to AdminCP Dashboard > Members > PermissionsSelect the Role you would like to configure permissions and the App Name to filter its available permissions. In the screenshot below, we will configure the permissions of Registered Users on the Blog app.You can toggle the option of certain permission to enable or disable that permission on the chosen user role.Click the Save Changes button to apply your configuration.","configure-permissions-within-app-settings#Configure permissions within App Settings":"In the other way, some apps, such as Events, Blogs, etc., may support configuring permission directly within their App Settings area for convenience.For example, you can configure the permissions of the Blog app by going to AdminCP > App Settings > Blog > PermissionsThat's all."}},"/manage-community/manage-users/assign-users-to-certain-roles":{"title":"Assign users to certain roles","data":{"":"This article will show you how to find and change the user's role. This assumes you are already logged in as the Admin user and are logged into the AdminCP.On the slide of the Menu bar, go to Members, then select BrowseYou will be redirected to the Browser page and can see the user list. Click on the Gear icon of the user you want to update role and choose Edit option.From the Role section, choose the specific user group that want to move the user to. Then, you can click the button Save Changes to update the user with the selected role."}},"/manage-community/manage-users/create-user-roles":{"title":"Create user roles","data":{"":"This guide will walk you through steps to create user roles in MetaFox. Let's go.Log into  your MetaFox site with Admin user. Then go to AdminCP Dashboard > Members > Roles and click the Add New Role link on the top-right corner to create a new role.In the Create New Role form, fill in the role name and choose an existing role to copy permissions of that role to the new one. It will save you much time to set up role permissions Then, click the Create button.That's it. You just completed the procedure of Role creation. You can go ahead to , as well as associated with this role."}},"/release-notes":{"title":"Release Notes","data":{}},"/release-notes/metafox-release-notes":{"title":"MetaFox - Release Notes","data":{"welcome-to-our-release-notes-hub#Welcome to Our Release Notes Hub":"At phpFox, we're committed to delivering excellence in every software update. Our commitment to innovation, security, and user experience is reflected in each new version we release.This Release Notes Page serves as a central repository for detailed insights into every version of our software. Whether you're an eager user, a dedicated administrator, or a curious visitor, this page is your gateway to understanding the evolution of our product.","metafox-versions#MetaFox Versions":""}},"/manage-community/view-site-statistics":{"title":"View site statistics","data":{"in-this-post-we-show-you-where-you-can-take-a-closer-look-at-the-traffic-stats-you-can-quickly-view-on-your-website-the-numbers-that-show-how-your-site-is-doing#In this post, we show you where you can take a closer look at the traffic stats you can quickly view on your website, the numbers that show how your site is doing. ":"Select the Dashboard tab in Admin CP. Here you'll see a overview of the general information needed to know. \nYou can find your total number of users, blogs, pages..... depending on the type of app you choose, you can also view the statistics graph in Daily and Weekly.\n On the right, you'll see the in-depth stats of your site including the Today Statistics and Site Statistics. Click on the View more button for more apps to view. Scrolling down a little bit, you find the following information:\nLatest ACP Logins:  \nNew and Updates:  Admin can stay updated on new blogs here\nSite Status: here you can find the status of your license, the expiration of your support plan, and the site version."}},"/release-notes/metafox-release-notes/metafox-501":{"title":"MetaFox 501","data":{"whats-new#What's new":"IDDescription1UI/UX Improvements2Support multiple languages3Add Core settings in AdminCP3Support the Chat app4Bug fixes"}},"/release-notes/metafox-release-notes/metafox-502":{"title":"MetaFox 502","data":{"whats-new#What's new":"New Features / Improvements\nUI/UX Improvements on all apps\nNavigation: add breadcrumbs, counts , etc. \nContent display: straightforward phrases, number format, page layout, feed items, icons, etc.\nChat/ChatPlus\nImprove display of replies to messages having photo and text\nPhotos\nUpdate feed items of new albums of Page/Group\nRemove the \"Can download images\" permission\nGroups\nSend a notification to the group's owner after members edit and re-submit their declined posts.\nDon't show the \"Add new item\" button for guests\nRemove the accept/decline option on the group listing page when users are invited to become admin/ moderator.\nQuizzes\nUsers can view the list of people who answered this question when clicking on the number of total plays\nRemove the Delete button on the \"This quiz is in pending state\" section\nPolls\nSupport CAPTCHA challenge when submitting a new poll\nComments\nHide 'Remove Preview' option for Guests\nHide sort comment section after users delete comments\nForums\nAdd bottom pagination in Forum Details and Thread Details page\nSticky threads are displayed in Forum and Subforums only. Not display sticky threads on Forum Home\nSupport \"Can reply all threads?\" permission\nSet the default Sort option with the last replies\nUsers can search wiki threads\nSupport Forum description\nRemove \"Display on Wiki\" option when creating a new thread on Page/Group\nMarketplace\nListings displayed on the History page are ordered by latest, based on the time of the first visit.\nSEO\nSupport generating Sitemap for SEO\nSupport preview info when sharing items on Social network, such as Facebook, Twitter\nNotification\nSupport web push notification on browsers\nSaved Items\nSupport actions of View Member list and Leave Collection \nEvents\nEvent owner cannot invite hosts if the \"Can edit own events\" permission is turned off\nImprove navigation flow when users view on map in the Event detail\nOthers\nHave “Show your location” button when users view content on map\nAdmin can edit members' usernames\nAdmin can configure the site that how long the notification will be automatically refreshed\nAdd more permissions for apps, such as forum, events, etc. in AdminCP\nAble to filter users having \"Not approved\" status\nSupport Manage Categories and Auto responder for Contact form\nHide \"Invite people to come\" on items that have \"Only me\" privacy\nImprove workflow when admin edits the user's info in AdminCP\nCreate Feed items of new announcements for Super Admin and users who have permission to view\nAnd, many bugs found have been resolved."}},"/release-notes/metafox-release-notes/metafox-503":{"title":"MetaFox 503","data":{"whats-new#What's new":"IDDescription1Support Social Login (Google, Facebook, Apple on iOS)2Support SMS notifications3Support manage Status Backgrounds4Bug fixes"}},"/release-notes/metafox-release-notes/metafox-511":{"title":"MetaFox 511","data":{"whats-new#What's new":"IDDescription1Submit apps (Blog, Event,...) to MetaFox App Store2Build Core with only Core Apps3Support upgrade Core from AdminCP3Support installing/upgrading the app alone from AdminCP4Mobile apps:\n+ Improve audio/video call5Bug fixes"}},"/release-notes/metafox-release-notes/metafox-510":{"title":"MetaFox 510","data":{"whats-new#What's new?":"New Apps\nLive Streaming\nAdvertising\nMusic\nImprovements\nSupport attachment image to the editor\nSupport audio/video calls on Mobile application\nOther bug fixes"}},"/release-notes/metafox-release-notes/metafox-5111":{"title":"MetaFox 5111","data":{"":"Release Date: June 26th, 2024","core#Core ":"Admin can define custom error messages for different contexts.\nUI/UX Improvements on Web\nLayout for Text Displaying on Presets of Editor Mode, Navigation.\nPagination on the Members page\nLayout when viewing the feedback on the Cancel Members page.\nLayout of Manage notification setting section when editing user\nUnify the UX of the 'Add New' menu actions in AdminCP.\nDescription of the \"Verify After Changing Phone Number\" setting.\nDescription of some Quota Control's settings.\nManage Reports - Hide the search form when there are no reported items.\nManage Members: Rephrase \"Pending Verification Email / Phone Number\" as \"Unverified Email / Phone Number\"\nUsers can input a number to modify the photo scale on CK Editor.\nLogin Popup - Add a link to the registration page and social login buttons.\nKeep the current page(URL) when logging in to AdminCP instead of redirecting to the Dashboard\nAdminCP\nManage Members:\nAble to filter members by registration date and country.\nDisplay the total count of search results.\nUpdate the URL on the address bar with search parameters when searching.\nHide the Ban User option on the Super Admin.\nNotify users having administrative privileges to approve members when new pending members are awaiting approval.\nUser Settings: revise the \"User Role Filter Excludes\" setting to control whether users of a specific role can be searched.\nCustom Fields - The admin can reorder the Basic Information section\nImprove the query performance when checking for blocked user relations.\nAdd Payment Settings group menu in Account Settings\nImprove Payment app for third-party gateways\nSupport rules and request validation for 3party gateways in all payment apps\nSupport multiple-step payment form.\nCan search Members by applicable custom fields upon choosing a specific role.\nShow item's category on the Item Detail page even though the category has been disabled.\nSupport opt-in for using email and SMS services on the Registration form\nAdd a new setting to control whether the opt-in agreement should be shown in the registration process.\nUsers will still receive email/SMS for Email Welcome, Verification Code , Authentication Code even though they don't check this opt-in during Registration.\nRemove default MetaFox Favicon for Fresh Site Installation\nAccount Setting - Notifications\nAdd a setting that allows users to control the entire notification channel.\nAdd the SMS Notifications page\nMobile Apps\nThe admin can configure menu items of the Account Settings menu in AdminCP.\nUse logo configured in AdminCP on the Login screen.\nShow No Internet page when device is offline\nAdd the option \"Copy Link Profile\" on the User Profile\nSupport grid layout for app menu and account settings menu\nUsers can unselect the current State/City on the Edit Profile Info page.\nAdd the search field when viewing the gender (I am) drop-down.\nFix bugs","page#Page":"Page admins can manage the scheduled posts on the Page.\nFix bugs","advertise#Advertise":"AdminCP - Add a setting to control whether users will be asked to purchase sponsorship after creating an item.\nMobile apps - Support the Create New Ad and Edit Ad screens\nUI/UX Improvement on the breadcrumb when viewing the transaction detail in AdminCP","event#Event":"UI/UX Improvements\nReplace the Start time with End Time on the Past event\nEnhance the RSVP workflow by replacing the default \"Not Interested\" option with a grayed-out Interested button.\nHide the Discussion tab and the Composer post on event when a user can moderate event, but they don't have permissions to start/view the discussion\nMobile apps - Hide the option \"Generate Invite Link\" on the private event\nFix bugs","follow#Follow":"Optimize performance as the follower database grows larger over time.","friends#Friends":"Friend Requests: Update phrase when there are no requests displayed\nFix bugs","groups#Groups":"UI/UX Improvements\nDiscussions: Improve the layout for the Photos block\nRemove redundant space characters on the notification that the user updates the cover photo of the group\nShow item preview when sharing an item from a Closed/Secret group to the comment section in the same group.\nSend notifications to group moderators when there are new member requests.\nFix bugs","newsletter#Newsletter":"Improve compatibility with v5.1.11.","stories#Stories":"Not allow to upload a video story if video services (Mux, FFMPEG) are unavailable.\nAdminCP: Add a new setting to control the duration of the video story.\nFix bugs","announcement#Announcement":"Admin can select multiple genders and locations when configuring announcements.\nFix bugs","activity-points#Activity Points":"Update for Compatibility with version 5.1.11.","photos#Photos":"UI/UX Improvements\nTheme Default - Apply round corners on photos in the listing page and detail album.\nUpdate the default title of the avatar added during registration.\nFix bugs","chatplus#ChatPlus":"UI/UX Improvements\nConversation listing when viewing it on the header menu.\nLayout when editing Group Name on All Messages screen.\nPhrases on the action menu of conversation.\nFix bugs","marketplace#Marketplace":"Users can reorder photos when adding/editing the listing.\nUI/UX Improvements\nReorder the currency fields on the Add New Listing page.\nUpdate the time format between the Invoice Listing and the Invoice Detail pages.\nUpdate the placeholder text in the search field.\nFix bugs","subscriptions#Subscriptions":"UI/UX Improvements\nThe breadcrumb when viewing the transaction detail in AdminCP\nSubscription - Layout on the recurring package.\nFix bugs","ewallet#EWallet":"UI/UX Improvements\nAdd more spaces between items in the Insights page\nAdd a line below the \"Available\" block to distinguish it from others.","featured-items#Featured Items":"UI/UX Improvements\nOn the Items/ Invoices page, disable future days for the date picker of the From/To field, only allowing the user can search data to the current date.\nOn the Items/ Invoices page, increase the padding above the Search filters.\nFont size for the column name on some pages.\nMobile Apps:\nMobile Flatten - Support search by Time for the Items/Invoices page\nMobile Flatten - Items: Improve the layout of the package name and the Items/Invoices page.\nFix bugs","forums#Forums":"Hide the attachment file on the Quote Post form","live-videos#Live Videos":"UI/UX Improvement on the live video detail page after users reload the page or edit the video.","music#Music":"UI/UX Improvements\nLayout on the Navigation menu.\nHover state of the music bar.\nLayout for the song title on Album detail page.\nFix bugs","polls#Polls":"Integrate with Featured Items app.\nUI/UX Improvements on the Navigation menu.\nFix bugs","quizzes#Quizzes":"Integrate with Featured Items app.\nUI/UX Improvements on the Navigation menu.\nFix bugs","paypal#PayPal":"Support the payment process with multiple steps.","reactions#Reactions":"Fix bugs","status-background#Status Background":"Fix bugs","forum#Forum":"Fix bugs","saved-items#Saved Items":"Fix bugs","feed#Feed":"Fix bugs","comment#Comment":"Fix bugs"}},"/release-notes/metafox-release-notes/metafox-5110":{"title":"MetaFox 5110","data":{"":"Release Date: May 22, 2024","core-and-app-updates#Core  and App Updates":"","featured-items-new#Featured Items (NEW)":"","user-features#User Features":"Dashboard\nOverview of featured items\nQuick access to invoice management\nItem Management\nSubmit items to be featured\nTrack status of submitted items\nInvoice Management\nView and download invoices\nPayment history\nOutstanding payments\nPayment methods (credit card, PayPal, etc.)\nPackage Selection\nBrowse and select packages for featuring items\nDetailed package descriptions and pricing\nNotifications\nEmail and in-app notifications for invoice due dates","admin-features#Admin Features":"Dashboard\nOverview of total earnings\nQuick access to manage invoices, packages, and transactions\nSystem alerts and notifications\nInvoice Management\nView and manage all user invoices\nCreate, edit, and delete invoices\nTrack payment statuses\nGenerate reports on invoice activities\nPackage Management\nCreate, edit, and delete featured packages\nSet pricing, duration for each featured package\nSpecial promotions and discounts management\nTransaction Management\nView and manage all transactions\nTrack payment gateway integrations\nRefund processing\nTransaction history and reporting","core#Core":"UI/UX Improvements\nOn User Profile when switching tabs or showing user details\nWhen editing items that belong to deactivated categories\nCustom Fields\nEnable validation on the Text field with regex rules.\nSupport sortable options for Multiple Selection field\nAble to control role-based field visibilities.\nAdminCP - Storage: Add setting to control file deletion upon removing related entities.","feed#Feed":"Support translation on posts with Google Translate\nAdministrators can delete feeds and all of its related items.\nSupport new permission to control \"How many posts per day that user can post?\"\nSupport Setting to control maximum characters for Post Status\nUI/UX Improvements\nThe layout on the Feed Type's table\nChange the Title on the Edit Post screen on mobile apps\nSpace between the keyboard and icon bar when sharing the feed","pages#Pages":"Integrate with the Featured Items app\nUsers can input an \"External Link\" when creating a page.\nUI/UX Improvements\nAdminCP - Manage Custom/Section fields: Add \"Add Custom Field\"/ \"Add Section\" link to the manage page.\nChange the label on the Manage Group screen on mobile app.\nHide profile/cover photo on page detail after the admin deletes the photo.\nUsers can upload a profile picture for the page when creating it.","groups#Groups":"Integrate with the Featured Items app\nManage Group:\nAllow group administrators to view the history of Membership Requests.\nSupport Membership Requests on mobile apps\nAllow non-registered users to access secret groups via invitation links.\nUI/UX Improvements\nOn workflow of sharing an item link from a Closed/Secret group to the discussion in the same group.\nAdd a confirmation message before saving the group privacy setting.\nThe success message when users invite friends to join the group.\nChange the label on the Manage Group screen on mobile app.\nAdminCP - Manage Custom/Section fields: Add \"Add Custom Field\"/ \"Add Section\" link to the manage page\nAdd \"Who can view members?\" permission to control who can view the group members.","comments#Comments":"Support translation on comments/replies with Google Translate\nUI/UX Improvements \nMobile app - Add the background per comment when viewing the comment/reply listing.\nMobile app - The comment screen when there is no comment display.","social-connect#Social Connect":"Update for compatibility with Core v5.1.10","blog#Blog":"Support removing storage files after deleting the Blog.\nIntegrate with the Featured Items app.","events#Events":"Integrate with the Featured Items app\nSupport exporting events to ICS file\nSupport importing events to Mobile Calendar\nUI/UX Improvements\nRemove the text \"Commenting on this post has been turned off.\" below the event feed.\nDisplay the Name Page/Group on the Event detail when the user role has no permission to view the Page/Group\nAdminCP: Enable event ordering by default for ongoing and upcoming events.","stories#Stories":"UI/UX improvements\nFor the progress bar when viewing the video story.\nThe video story layout when waiting for processing.\nThe layout of the text story when viewing the detail.\nAdd the pointer on the Create Text Story page on mobile apps.\nThe line below the header on the story detail page.\nImprove performance\nSupport parsing hyperlinks in the content when creating a new story on mobile apps.","friends#Friends":"Optimize performance of Friend Suggestion.\nMinor UI/UX Improvements.","e-wallet#E-Wallet":"UI/UX Improvements\nAdminCP - The text on the Exchange Rates page.\nThe message when there are no currencies to withdraw.\nSupport users can define the minimum withdrawal for each currency.","site-background#Site Background":"Update for compatibility with Core v5.1.10","status-background#Status Background":"AdminCP - Admin can configure text color (black / white) for individual background photo.","sticker#Sticker":"UI/UX Improvements\nAdd the message when the Recent tab is empty","search#Search":"UI/UX Improvements\nAutomatically focus the cursor on search text box when opening the Global Search.","marketplace#Marketplace":"Support Manage Invoices in AdminCP\nIntegrate with the Featured Items app\nUI/UX Improvements\nAdminCP - The workflow when users view the order details on ACP.\nAdminCP - Phrases for an invoice detail page.\nMobile apps - The \"To\" field when searching for the Sold/Bought Invoices screen.","photos#Photos":"UI/UX Improvements \nWhen adding photos to the album\nRemove the black background on the Photo/Video on the Photo Album\nThe layout on the Photo Block\nAdd the pending icon in the pending video on the photo album\nMobile apps - Support editing video after uploading them to the album photo\nIntegrate with the Featured Items app","video#Video":"Integrate with the Featured Items app\nUI/UX Improvements\nLayout for the Videos block when the video does not title\nHide the dot on \"Remove from Saved list\" on the saved video.\nThe loading page when users cancel the \"Add New Video\" page on the page, group, or user profile.\nRemove a space on the notification when follower users upload a video.","live-video#Live Video":"Integrate with the Featured Items app.\nUI/UX Improvements\nThe workflow when viewing the live video detail page.\nThe loading screen on create live video page.","music#Music":"Integrate with the Featured Items app.\nSupport removing storage files after deleting music songs or albums.\nUI/UX Improvements\nLayout on \"Your Playlist\" block.","poll#Poll":"Integrate with the Featured Items app.\nSupport removing storage files after deleting polls.","reactions#Reactions":"Support creating reactions using GIF files.","hashtag#Hashtag":"UI/UX Improvement on the hashtag when viewing the edit history popup (Post, Comment,..)","advertise#Advertise":"AdminCP - Improve the workflow when users view the order details on ACP.","invitation#Invitation":"Add a new setting to control whether invited users can be approved automatically after registration.","subscription#Subscription":"Mobile apps - Support \"View Packages\" on Register Form like Web version.\nUI/UX Improvements\nAdminCP - Update the empty description when there is no result to show on the Manage Subscription page.","activity-points#Activity Points":"UI/UX Improvements\nPhrase when Admin revoked user's point\nMobile apps - Hide the submit button on the Conversion Request screen when users do not have points.\nMobile apps - Disable the Activity Point option on the Payment Gateway popup when users do not have enough points to pay.\nThe notification when admins give 1 point to a user.\nThe warning message when adjusting the member point.\nThe notification when users receive 1 point from other users.","quizzes#Quizzes":"Integrate with the Featured Items app.\nSupport removing storage files after deleting quizzes.","saved-items#Saved Items":"Support removing storage files after deleting saved items.\nUpdates for Compatibility with MetaFox 5.1.10","chat#Chat":"UI/UX Improvements\nAdd the tooltip on the listing header for the New Conversation button\nThe Settings form in AdmiCP.","chatplus#Chatplus":"Apply Firebase settings from Firebase app\nUI/UX Improvements on layout of action sheet, typing icon, video player on mobile app.","forum#Forum":"UI/UX Improvements on the layout of dropdown in Search thread form.\nUpdates for Compatibility with MetaFox 5.1.10"}},"/release-notes/metafox-release-notes/metafox-5112":{"title":"MetaFox 5112","data":{"":"Release Date: July 30th, 2024","core#Core ":"Mobile apps - Update to SDK 34 to comply new target API requirement on Android 14\nUI/UX Improvements\nFrontend Web\nMembers - Improve UI of the Date Custom field\nAccount Settings - The Current Password field should be hidden the first time users register via the Social Connect app and set their passwords.\nOn the long setting forms in AdminCP, apply fixed position of the Submit buttons \nRefresh the breadcrumb automatically after the forum thread is changed.\nUser Profile - Adjust the locate of the search bar to the right side to sync with other pages on the Tablet layout\nNot show required label on fields of country city\nCancel Account: Update the warning message on the Password field\nOn the Registration form, trim spaces before triggering email validation when handling email input\nAdminCP\nMenus - Hide menu items if associated apps are deactivated.\nMobile Apps\nMove the settings option to the header view for better accessibility.\nUpdate the phrase of the \"Videos and Photos\" setting.\nUpdate the \"Videos and Photos\" text to \"Video Settings\" on the Account Settings page.\nSocialite - Add a new setting to control whether the system should prompt users to set their passwords for the first time they register via the Socialite app.\nCustom Fields:\nAdministrators can duplicate custom fields.\nAdd a new custom field component to enable users to enter URLs.\nNot allow similar names of fields and sections to avoid overlapping issues when translating their labels.\nMail Settings: the email signature can be translatable into multiple languages.\nSecurity Enhancement for MIME Proofing\nSEO Improvements: Support canonical tags\nEditor Mode: Support admin can config show/hide Icon menu on Header (Mobile Responsive)\nOrdering items by \"Recent\" will be based on the creation date rather than by the item IDs.\nRegistration: Only send Pending approval user notifications to administrators after users verify their accounts.\nPerformance Improvements\nImprove loading speed on frontend web by reducing chunk size.\nScan & refactor code that calls command cache:reset under a loop that might cause performance issues.\nOptimize the performance of the cleanup notification jobs.\nMFA: the email/SMS authentication should only be shown if the email and SMS channels have been configured accordingly.\nChange user password:\nOpen a new page to suggest users log out of other devices after changing password.\nShow the warning message if using an invalid password before showing the \"Logout Other Devices\" popup.\nFix bugs","page#Page":"UI/UX Improvements\nMobile app:\nShow \"Landing Page\" field on the Edit Page Info.\nAdjust the padding of thumbnail for better displaying when sharing the page on Mobile Flatten app\nFrontend Web:\nOn the Page Details, move the External Link to the About block.\nUpdate the header page from \"Page About\" to \"About page\"\nPage Photo: Support page admin can select the photo from the page when creating/editing the photo album\nFix bugs","advertise#Advertise":"UI/UX Improvements for Advertise block\nFix bugs","event#Event":"UI/UX Improvements on Mobile apps -  Add a line between the post and description.\nFix bugs","follow#Follow":"Define specific notification types to control the follower notification based on the entity types/context.\nOptimize performance as the follower database grows more significant over time.\nFix bugs","friends#Friends":"UI/UX Improvements\nApply the same popup layout for \"Add New List\" and \"Edit Friend List\".\nOn the Mutual Friends popup - Improve the layout when friends' names are too long\nDisplay info of \"Mutual Friends\" on the Friend Requests\nFix bugs","groups#Groups":"UI/UX Improvements\nMobile apps:\nManage Group - Add the \"Landing Page\" setting\nImprove phrases in the option list.\nGroup Browse - Hide the redundant dot on the group item when user cannot view the group type.\nFix bugs","comment#Comment":"UI Improvement on the Pending Comments page\nFix bug","social-connect#Social Connect":"In Invite Only mode, users are required to enter the invite code when signing up with social accounts.\nFix bugs","sms#SMS":"Use the new 3rd library for the phone number validator.","stories#Stories":"Hide the \"Created Story\" notification after the story has ended.\nFix bugs","announcement#Announcement":"Fix bugs","activity-points#Activity Points":"UI/UX Improvement\nHide the \"Point Packages\" page when the \"Allow member to purchase Activity Points?\" setting is turned off.\nFix bugs","photos#Photos":"When updating profile cover, not allow users to use warning photos.\nFix bugs","chat#Chat":"UI/UX Improvements for reply message in the conversation when clicking on it\nAdd the Permission page to manage the Chat app\nFix bugs","chatplus#ChatPlus":"UI/UX Improvements\nWeb\nAdd a dot to the member card on the Recent Active page to display the user's current status.\nHide the Attachment button when editing the message.\nMobile apps\nImprove the file icon when the file name is too long.\nSupport users to back to the previous screen when users use the Back button on the device (Android).\nImprove the background for the selected reaction on the reaction icon dialog.\nFix bugs","marketplace#Marketplace":"Fix bugs","subscriptions#Subscriptions":"UI/UX Improvements for the title on the Edit package form\nFix bugs","ewallet#EWallet":"UI/UX Improvements\nImprove layout for the Insights page\nAdd the description below a currency on the Select Balance popup.\nFix bugs","video#Video":"Add a setting for control the timeout of processing video job.\nUI/UX Improvements\nImprove the video status when users act on the video detail page.\nImprove the Menu app on the search result page when opening the first time.\nHave the progress bar when users upload a video from the device.\nFix bugs","status-background#Status Background":"Allow administrators to select text color (black / white) for individual background photo.\nUI/UX Improvements\nImprove the pointer when creating/editing the background feed.\nbold the text when creating and editing the status background feed.\nFix bugs","feed#Feed":"Enable selecting different sort orders for the activity feeds either by recent comments or recent posts.\nUI/UX Improvements\nShow a friendly error message when configuring  an invalid Google Translate API key. \nLayout of feed item of new registration\nFix bugs","invitations#Invitations":"Add the Reset button on the All Invitations page.\nFix bugs","blog#Blog":"Fix bugs","reactions#Reactions":"Fix bugs","search#Search":"Fix bugs","newsletter#Newsletter":"Fix bug"}},"/release-notes/metafox-release-notes/metafox-5115":{"title":"MetaFox 5115","data":{"":"Release Date: Dec 2nd, 2024","new-feature--strengthened-security-with-change-file-checksum-verification#New Feature - Strengthened Security with Change File Checksum Verification":"Checksum verification ensures the integrity and authenticity of your MetaFox files. With this feature, administrators can:\n    •    Detect unauthorized changes to core files, configurations, or scripts.\n    •    Maintain a secure and consistent deployment environment.\n    •    Quickly identify modifications that could compromise security or lead to functionality issues.This enhancement is particularly valuable in guarding against potential threats, such as malware injections or unauthorized updates, giving you peace of mind that your MetaFox installation remains secure and reliable."}},"/release-notes/metafox-release-notes/metafox-5113":{"title":"MetaFox 5113","data":{"":"Release Date: Sep 10th, 2024","core#Core ":"Mobile apps \nUpgrade Facebook SDK\nUI/UX Improvements\nFrontend Web\nLocalization - Support detecting language based on the browser setting.\nLogin with MFA\nUser will be back to the original page after logging in using MFA.\nFirst authentication option should be automatically selected by default.\nUnify the icon style across the platform using the outlined variant.\nSign-In - Improve the layout of the Social Login button\nScroll to the top of the Homepage when the user is on the Homepage and clicks on Home menu or Site logo\nAuthenticator page - Hide Create account link\nAdminCP\nLocalization - Countries:\nMake Fips Code, Geonames Code optional when creating/editing states.\nAdd action to add new items to the Options menu.\nMembers/Inactive: Support auto-compete on City field.\nSEO\nImprove Apps filter in SEO settings manage page\nImprove SEO manage settings page\nSchedule Jobs - Add the Settings page with detailed cron commands\nPoint Settings - Users can input the integer starting with 0 in the Point Settings\nMobile Services/Smart Banner - Moving Google/Apple ID Settings from Admob page to the Smart Banner page\nEmail Inactive Members - Improve the UI/UX for processing inactive email.\nHealth Check: improve the process of checking the queue worker state.\nInstall / Reinstall App - Display popup whenever the installation process is successful\nLogin with MFA - Admin will be redirected to AdminCP via the AdminCP Login form\nStorage: hide storage configurations unless they are properly configured.\nMobile Apps\nRemove the redundant line on the profile page (Android).\nImprove the Featured/Sponsored label on the feed item.\nSettings: Improve the layout for the action sheet header when viewing some setting pages\nImprove phrase for the Privacy menu\nSupport Progressive Web App on Chrome\nSupport settings to require users in specific roles to enable MFA.\nSEO - Support descriptive URLs.\nToggle Site: support WYSIWYG editor for Offline Message\nSite Statistic: Add a new page to manage Site Statistics.\nNotification: Allow administrators to disable notifications for the entire app.\nBrute-force Protection: improve the brute-force workflow.\nPerformance Improvement - Not to reset the global cache when performing specific actions\nAdminCP Site Settings - Support translating some components on the Site Settings page.\nEmail Inactive Members: Process inactive email in batch to avoid being marked as spam\nFlatten Theme - Move background default to asset\nSupport environment variable to control site backups.\nInstallation Wizard: Improve validation for database version\nSmart Banner: Support setting to allow administrators to reposition the Smart Banner.\nFix bugs","stories#Stories":"Allow a user to mute stories from other users.\nSupport users to view archived stories that are created on the same date.\nSupport user can add multiple text on the story\nApply permission settings of the Reaction app to the stories\nUI/UX Improvements\nImprove phrase for the Story Archive page\nImprove text for the Story Archive menu on mobile layout\nImprove layout for the Comment section on the story\nFix bugs","saved-items#Saved Items":"UI/UX Improvements\nChange the phrases of the \"Remove from Saved list\" option and the Add Friends popup.\nImprove the Save button status on the Add Collection popup after clicking.\nAdd the \"maximum number of characters\" description when editing the collection.\nFix bugs","stickers#Stickers":"UI/UX Improvements\nImprove the sticker file type on the listing page in the mobile browser layout.\nImprove the order of the sticker collection on the All Stickers/ My Stickers tab for the web browser and mobile app.\nFix bugs","page#Page":"UI/UX Improvements\nMobile Apps - Add labels on the post and comment of Admin and Moderator users.\nAdd the Featured/Sponsored icon on the Page feed.\nUpdate layout on the pending page.\nMy Claim Page: Update the success message when the user cancels the claim request\nFix bugs","advertise#Advertise":"Fix bugs\nUI/UX Improvements\nHide the Edit/Delete option when the users have not permission \nHide the Edit action on the Completed Ads\nManage Sponsorship - Users can filter sponsorship created in Feed","event#Event":"Support slugs in event URL\nUI/UX Improvements\nMobile Flatten - Add the \"Going\" option on the \"Interested\" button\nMobile App - Improve the layout of the Action list on the Event\nHide the Sort Feeds action when users cannot view the Discussions tab\nFix bugs","quiz#Quiz":"Support slugs in quiz URL\nFix bugs","poll#Poll":"Support slugs in poll URL\nUI/UX Improvements - Improve the notification after the poll is approved.\nFix bugs","follow#Follow":"Improve compatibility with Core v5.1.13","friends#Friends":"Performance: optimize the performance of Friend Suggestions query.\nUI/UX Improvements:\nUser Profile - Add the sub-tab \"Mutual Friends\" on the Friends tab\nUser profiles - Add total of Friends, Requests, Following, Follower request on the title of tabs\nAdminCP - Focus on the Settings page when users access the Friends app","groups#Groups":"Group Members: Able to sort group members by name or joined date.\nUI/UX Improvements\nChange layout of custom fields on the Search Group page\nThe member count is based on the \"Who can view members?\" permission, regardless of the group privacy.\nChange the phrase from \"Publish Date\" to \"Created At\".\nThe group cover photo has the same size as the listing cover and detail.\nManage Example Group Rules - Add the message when users deactivate/activate an Example Group Rules.\nMobile Apps\nAdd the Admin/Moderator label on the post and comment\nCentralize the selected sub-tab on the Search Members page\nFix bugs","live-videos#Live Videos":"UI/UX Improvements\nImprove the Live Videos block on the Home Feed page.\nImprove the pointer when replying to the comment on the live video.\nFix bugs","comment#Comment":"Mobile Apps - When edit history, add the hyperlink on the mentioned user/group/page \nFix bugs","social-connect#Social Connect":"Fix bugs","music#Music":"Support slugs in music URL\nUI/UX Improvements\nImprove the line color between the menu list and the Saved Playlists section.\nImprove the layout of the song/music album/playlist item.\nFix bugs","sms#SMS":"Fix bugs","announcement#Announcement":"Hide the number of views on the announcement listing and detail pages.","hashtag#Hashtag":"Updates for compatibilities with Core v5.1.13.","activity-points#Activity Points":"AdminCP - Improve performance on the Manage Packages page when the Google and Apple payment methods are inactivated.\nFix bugs","photos#Photos":"Support slugs in photo detail URL.\nUI/UX Improvements\nImprove the background on the suggestion list when tagging a user in a photo.\nImprove the action click when tagging a user in the photo.\nImprove page title when editing media on the composer post in the mobile app.\nFix bugs","chat#Chat":"UI/UX Improvements\nImprove the order in the bubble conversation section.\nImprove the text when users reply to themselves.\nFix bugs","chatgpt-bot#ChatGPT Bot":"Allows Admin to select number of days to apply for permission \"Limit messages with Chat Bot\".\nChange permission \"Limit the length of returned messages\" to \"Limit the length of returned tokens”.","chatplus#ChatPlus":"Allow users to view another profile from the Reacted by popup.\nAdd the warning message on AdminCP Dashboard when having new version of ChatPlus server.\nUI/UX Improvements\nImprove phrases.\nThe pointer automatically displays on the text field when opening the conversation.\nDisplay progress bar per file when sending many files simultaneously (Videos, audio,....).\nAdd the \"Edited\" icon on the edited message.\nImprove the file name when viewing the Files tab.\nImprove playback rate for audio message.\nMobile Apps\nAllow users to choose playback speeds like 1x, 1.5x, and 2x.\nImprove the layout when viewing the reaction list per icon.\nFix bugs","marketplace#Marketplace":"Support setting to show/hide Short description when creating/editing Listing.\nSupport slugs in listing URL.\nUI/UX Improvements\nMobile Apps - Support users in reordering photos when adding/editing the listing.\nMove Sold/Expired label to same position with Sponsor/Feature Label\nFix bugs","subscriptions#Subscriptions":"Manage Reasons: Define the search filters in Manage Reasons page.\nAdminCP - Improve performance on the Manage Packages and Manage Subscriptions page when the Google and Apple payment methods are inactivated.\nManage Comparison: enable drag and drop feature to enable administrators to reorder the comparisons.\nFix bugs","ewallet#EWallet":"UI/UX Improvements\nImprove the currency when users convert their points to the currency.\nImprove the layout for the Transactions page.\nMobile Apps - Improve the layout for the Transactions listing page.\nUpdate phases on the Deny Request form.","video#Video":"UI/UX Improvements\nImprove the video progress bar layout when users hover over it.\nSupport opening the video detail page from the feed when clicking on it.\nMobile Apps - Improve the video layout when editing the post (has only 1 video).\nFix bugs","newsletter#Newsletter":"Support to send test newsletter.\nSupport to select the SMS channel when creating a new newsletter.\nFix bugs","site-background#Site Background":"Improve the warning message when user drop and drag the photo to upload\nFix bugs","status-background#Status Background":"Updates for compatibilities with Core 5.1.13","feed#Feed":"Improve the feed layout when users remove tags.\nFix bugs","blog#Blog":"Support slugs in blog URL\nFix bugs","reactions#Reactions":"Updates for compatibilities with Core 5.1.13\nImprove performances.\nFix bugs","search#Search":"Improve the scrolling position of the page in the mobile browser when users navigate tabs.","forum#Forum":"Fix bugs","featured-items#Featured Items":"Fix bugs"}},"/release-notes/metafox-release-notes/metafox-5114":{"title":"MetaFox 5114","data":{"":"Release Date: Nov 10th, 2024","core#Core ":"SEO: Admin can control bot indexing and configure canonical URL for specific pages\nImprove performance on Frontend web \nGDPR Cookie Privacy: Administrators can change the URL to the cookie policy page.\nCustom Field - Support multiple languages for Multiple Select option\nSEO: Support descriptive URLs in all apps\nRegex Rules - Apply the Setting \"Display Name Regex Rule\" for Group/Page\nSupport config Light/Dark mode for As Guest user\nCurrencies - Support administrators to list users who are using a specific currency.\nNotification\nAdmin can check whether a notification type channel can be enabled/disabled based on the type configurations\nSuppress notifications from being sent to banned users.\nSuppress emails / SMS messages from being sent to unverified emails / phone numbers.\nUI/UX Improvements\nFrontend Web\nImprove slider form field\nOn the Search Result,  improve layout for click icon when hovering on the Reset link.\nWhen dragging a photo to reorder photo items on the Create/Edit page, the photo of this position must be pushed to the next position.\nWhen users open the Check-in modal / Location field on Composer post/ Marketplace/ Event, the suggested location list will be displayed based on the current location.\nImprove the warning message for Multi-Factor Authentication, SignIn, Registration Settings, etc.\nMFA - Users should be navigated directly to the authentication code step if only one authentication method is available.\nAdd the Follow/Unfollow actions on the \"Profile Popup Viewer\"\nSupport spell check on Chrome default (Feed Post Editor )\nHide Uploading Image file on Text Editor for Guest Users\nCheck-In - Improve the layout on the scroll bar on Dark Mode.\nAdminCP\nMembers\nHide the city drop when no country is selected.\nThe city dropdown now supports automatic completion.\nFix the expanded field after searching. They only collapse when clicking on the \"View less\" link.\nUpdate success message when admin approve the user\nChange the ordering on the Cancelled Members\nDashboard - Add Pending Reports metric under Site Statistics.\nReport Items: the 'Process Report' action is  relabeled as 'Mark as Processed'\nMobile Apps\nAfter changing password and logging out, users are required to log in again when tappping on the saved profile.\nSupport Deep links with multiple domains. \nImprove the layout of  Mutual Friends pop-up\nMobile apps \nSupport iPhone 16 device\nFix bugs","event#Event":"UI/UX Improvements\nFrontend Web:\nManage Hosts - Improve layout when user name is too long\nHide the \"View on map\" action on the event on Group/Page\nEnhance the RSVP workflow by reworking the default \"Not Interested\" option.\nMobile app - View Event on Map - Display the loading icon instead of the \"No events are found\" message when users filter event\nFix bugs","marketplace#Marketplace":"Support Commission Fee\nFix bugs","friends#Friends":"All Friends - Support Sort default on the All Friends\nSupport birthday block on Side Slot","groups#Groups":"Group Invites: Invitations via link can be listed under the Group Invites page.\nSupport Announcement block on mobile  layout\nUI/UX Imrprovements\nMobile apps:\nGroup Membership Request - Add a submit button below the Answer Group Question form.\nChange the phrase from \"Publish Date\" to \"Created At\".\nFrontend Web:\nRelease the associated vanity group URL right after a group is deleted.\nLoad the cover section once when users switch between tabs.\nMembership Question/Group Rules -  Keep the Create/Edit form opened when users click outside it.\nMute Members - Hide the Submit button when users mute member on group.\nNotification - Delete all \"New Group Member Notifications\" from moderator/admin when member has been approved/cancelled.\nFix bugs","pages#Pages":"UI/UX Improvements\nFrontend Web\nUpdate layout on the pending page\nRelease the associated vanity group URL right after a page is deleted.\nLoad the cover section once when users switch between tabs.\nImprove the alert popup when the owner reassigns the owner without admins on the page.\nMake the total likes of Page clickable\nMobile\nImprove the alignment on the page info\nFix bugs","social-connect#Social Connect":"Improve compatibility with Core v5.1.14.\nFix bugs","sms#SMS":"Improve compatibility with Core v5.1.14.\nFix bugs","twilio#Twilio":"Improve compatibility with Core v5.1.14.\nFix bugs","newsletter#Newsletter":"Improve compatibility with Core v5.1.14.\nFix bugs","captcha#Captcha":"Improve compatibility with Core v5.1.14.","stories#Stories":"UI/UX Improvements\nFrontend Web\nImprove line border on avatar users when they have the story\nImprove layout for click icon when hovering on the Muted link\n[Mobile] - Improve the layout of the story that containing a link.\nAdminCP\nAdd a configuration for administrators to define the available story lifespan options.\nManage Collection: Disable the 'Active' toggle on the only active collection.\nFix bugs","photos#Photos":"UI/UX Improvements\nFrontend Web\nImprove layout for the friend tag suggestion list\nAdd Take photo/video function on the Android device when uploading media item on mobile layout.\nImprove layout of the photo's author info when it is too long\nPhoto on Group/Page - Improve the layout when the owner's photo is too long\nMobile app\nHide some actions 'View Avatar/ Cover' on User Profile/Page/Group when the permission to view photo is disabled\nMake the author's name bold on the photo/album detail\nFix bugs","reactions#Reactions":"UI/UX Improvement\nImprove layout for the reaction image when viewing on the feed\nFix bugs","status-background#Status Background":"UI/UX Improvement\nImprove the clickable area on the status background.\nFix bugs","stickers#Stickers":"Improve compatibility with Core v5.1.14.","videos#Videos":"UI/UX Improvements\nVideo Processing - Users should be informed whenever the video processing is failed.\nFrontend Web\nImprove the default icon on the Videos tab (Page/Group/Profile) when no videos are displayed.\nImprove The breadcrumb icon on the video detail page.\nMobile app\nImprove the space between the Reaction and Comment icons on the video detail screen.\nFix bugs\nCompatible with Quota Control app","apple-pay#Apple Pay":"Improve compatibility with Core v5.1.14","google-pay#Google Pay":"Improve compatibility with Core v5.1.14","blogs#Blogs":"Compatible with Quota Control app","chat#Chat":"Improve the search result page when no conversations are found.","chatplus#ChatPlus":"UI/UX Improvements\nFrontend Web\nRemove list of current group members on adding member popup\nPointer will be automatically focused on the Compose box when opening the minimize conversation.\nSome improvements on UI related to text color, preview image size, action icon.\nImprove the notification of the last message on the conversation listing page\nFix bugs","chatgpt-bot#ChatGPT BOT":"Enhance chatbot responses and behavior","forums#Forums":"UI/UX Improvements\nImprove the UX when editing threads that belong to the sub-forum once the deactivated parent forum\nFix bugs","music#Music":"Compatible with Quota Control app\nUI/UX Improvements\nFrontend Web\nAdd the \"Turn on repeat one\" feature on the Music Album/ Playlist on mobile layout.\nImprove layout for the music song/album when viewing from user profile on mobile layout.\nImprove the size of the Cover Photo field on the Add New Music Album form.\nImprove the warning message when users upload an invalid number of songs.\nMobile apps\nAllow users to open the music album from the song details that belong to the album.\nFix bugs","polls#Polls":"[Mobile] Improve the close time format for the poll details.\nCompatible with Quota Control app\nFix bugs","quizzes#Quizzes":"Improve compatibility with Core v5.1.14\nFix bugs","saved-items#Saved Items":"Improve compatibility with Core v5.1.14\nFix bugs"}},"/release-notes/metafox-release-notes/metafox-513":{"title":"MetaFox 513","data":{"":"Release Date: July 12, 2023","whats-new#What's new":"","new-flatten-theme-variant---a-clean-and-minimalist-approach-to-the-design#New Flatten theme variant - a clean and minimalist approach to the design":"The Flatten theme variant introduces a clean and minimalist approach to the design, focusing on simplicity and elegance. The user interface elements are thoughtfully arranged, providing a clutter-free experience that allows users to navigate effortlessly throughout the platform.With its sleek and streamlined aesthetic, Flatten offers a visually appealing user interface that is both visually captivating and user-friendly.The Flatten theme variant is fully responsive, ensuring a seamless experience across various devices, including desktops, tablets, and mobile phones. Users who access your social networking platform from a large desktop screen or a small mobile device will enjoy a consistent and optimized user experience.Additionally, the Flatten theme is free for Admin to customize. Admin users can choose from various customization options via Layout Editor, including personalized background images, color schemes, and font styles, enabling them to create a visually distinctive presence within the social networking community.","powerful-live-layout-editor---effortlessly-modify-page-layouts-and-customize-styles#Powerful Live Layout Editor - Effortlessly modify page layouts and customize styles":"Introducing the powerful Layout Editor feature in our social networking software, allowing administrators to effortlessly modify page layouts and customize styles in a visual and intuitive manner. With this feature, admins can take full control over the design and appearance of their social networking platform, creating a unique and tailored experience for their users.The Layout Editor provides a user-friendly interface that simplifies the process of customizing page layouts. Administrators can easily rearrange and add various blocks, such as static HTML content, profile sections, activity feeds, widgets, navigation menus, and more. Drag-and-drop functionality makes it a breeze to reposition and organize these blocks, enabling admins to create the perfect layout for their platform's specific needs.Not only does the Layout Editor offer flexibility in arranging page elements, but it also allows administrators to customize the styles and visual attributes of their platform. With a comprehensive set of styling options, admins can easily adjust colors, fonts, borders, backgrounds, and other visual elements to match their brand identity or create a visually appealing theme. The real-time preview functionality ensures that admins can see their changes instantly, providing a seamless and efficient customization experience.The visual nature of the Layout Editor eliminates the need for coding or technical expertise, empowering admins with the ability to make significant design modifications without any programming knowledge. This puts the power of customization directly into the hands of administrators, enabling them to create visually stunning and personalized experiences for their users.Experience the power of the Layout Editor feature in our latest version, and take customization to the next level in your social networking platform. Empower your administrators to unleash their creativity and design visually stunning layouts that captivate and delight users.","seamlessly-update-metafox-in-admincp#Seamlessly Update MetaFox in AdminCP":"This is the exciting new feature in our upcoming product version — the ability to update the software seamlessly from within the AdminCP. With this convenient and streamlined feature, administrators can easily update their product to the latest version with just a few clicks directly from the intuitive AdminCP interface, eliminating the need for manual update routines. The system will handle the entire Software Updates procedure, including database updates and necessary configuration changes, ensuring a smooth transition to the latest version.By offering an in-built Software Updates mechanism within the AdminCP, we aim to simplify the software update experience for our valued users. This feature ensures that administrators can effortlessly keep their products up to date, benefiting from the latest enhancements, bug fixes, security patches, and exciting new features we introduce with each version.Our goal is to provide a user-friendly and efficient update experience, empowering administrators to stay current with the product's advancements and continually enjoy its improved performance, functionality, and user experience. The in-built Software Updates feature within the AdminCP ensures that updating your product is a hassle-free and time-saving process.","ads-management-on-mobile-apps#Ads management on Mobile apps":"This new feature empowers users to efficiently manage their advertisements directly from their mobile devices.With the ability to manage ads on mobile app, users gain greater convenience and flexibility in promoting their content and reaching their target audience. Whether it's promoting a personal brand, a business, or a cause, users can easily create, monitor, and adjust their ad campaigns right from the palm of their hand.By extending ad management capabilities to mobile apps, our software enables users to stay connected and responsive to their advertising campaigns, even while on the go. Whether users prefer using a desktop or a mobile device, they can now leverage the power of our software's ad management functionality to maximize the reach and impact of their advertising efforts.","support-for-sponsor-feed#Support for Sponsor Feed":"The software now includes support for sponsored content in the feed, enabling businesses or influencers to promote their content to a wider audience.","support-for-sponsor-blog#Support for Sponsor Blog":"Users can now monetize their social networking platform by allowing sponsored blog posts, where companies or individuals can pay to publish their articles or blog posts on the platform.","support-for-invite-only-registration#Support for Invite-Only Registration":"With this improvement, you can now enable registration on your social networking website only through invitations. This feature provides more control over user registration and can help maintain exclusivity or limit access to a specific audience.","live-video-on-pagegroup#Live Video on Page/Group":"Users can now create and broadcast live videos directly from their social networking pages or groups. This feature enhances the interactive and real-time nature of your platform, allowing users to engage with their audience through live video content.","performance-enhancements#Performance Enhancements":"The new version of the software includes various optimizations and improvements to enhance its overall performance. These performance enhancements may involve areas such as faster loading times, improved response times, reduced server resource usage, optimized database queries, and overall smoother user experience. The focus on performance ensures that your social networking platform operates efficiently and provides a seamless experience for your users.","resolved-known-issues#Resolved known issues":"Bug fixes are a crucial and essential part of software development as they improve the overall quality and functionality of the product. The new version of the software addresses and fixes various bugs and known issues in previous versions. These bug fixes ensure that the software functions as intended, eliminating any unexpected behaviors or errors that users have encountered.  They contribute to a smoother user experience and help maintain the integrity of your social networking software."}},"/release-notes/metafox-release-notes/metafox-5116":{"title":"MetaFox 5116","data":{"":"Release Date: Jan 1st, 2025","getting-started-new-app#Getting Started (New App)":"We’ve crafted a welcoming and engaging Getting Started experience that’s secure, responsive, and perfect for users on any device effortlessly. Our \"Getting Started\" process is built for simplicity, speed, and scalability, designed to provide a seamless onboarding experience.\nAllow Admin to manage To-do List in AdminCP.\nShow first-time members a list of what should be done after signing up.","core#Core":"Ban Words: Check and sanitize banned words in all contents.\nSEO\nSupport Structured data markup for Google Search\nChange attribute of Meta OG tag from name to property\nImprove the description below the Title field when editing a page.\nDisplay the property list supporting each page.\nUpdate the phrase for some specific page when editing.\nSupport banning users with IPs and Emails\nUpgrade TikTok SDK\nSupport new permission to download attachments in apps\nUI/UX Improvements\nMobile Apps\nLayout of Feed detail on Android.\nWhen recording video, not reset the record time when switching camera\nImprove the way push notifications are displayed when the app is running in the foreground state.\nImprove the loading icon when waiting to validate the social account.\nMove to the top when clicking on the \"Overview\" tab on the profile page.\nImprove creation time on items.\nImprove the layout of the suggestion locations of Google Map.\nRemove the loading icon after canceling the \"Logout Other Devices\" popup.\nUpdate Password - Remove the Logout Other Devices pop-up after user inputs password.\nWeb\nNew UI for Like-Share-Comment\nBasic Information - Change the ordering on the Location field\nImprove loading on the profile page of Page/Group/User when having a custom tab.\nImprove behavior for the tooltip on the button/icon when user takes action on it.\nChange the layout header to the same as a mobile app on the mobile web.\nImprove the behavior of scrolling to the top when changing the page.\nApply same \"Report\" icon on the photo detail as Feed item.\nAdd the Featured icon on the user's feed.\nDisplay the Scroll bar when loading the activity posts.\nImprove the item border on the attachment file.\nUpdate the default group cover photo on the Shortcut section.\nBasic Information - Change the Address icon on the Basic Information block.\nUpdate the message when users sign up for the account with the banned email.\nImprove the position of the Save/Cancel button on the Custom Privacy popup.\nShow the date time detail when the user hovers on the creation time on the item detail.\nNotifications - Hide the notification related to the post Link when the Feed app has been inactivated.\nAdminCP:\nSite Statistic: add a new metric to count daily/weekly active users.\nImprove \"Require Basic Field\" setting in Registration Settings page\nSupport validating and testing SMS after configuring Twillo settings in AdminCP\nCustom fields - Display the options on the Selection field by Keyword\nFlood Control: the counter ignores system generated items when validating users' capacities.\nBrowse Members: improve the label of the Display Name search box to enhance clarity.\nAppearances: rename the footer menus to enhance clarity.\nWhen deleting category, The \"Category\" dropdown only appears when selecting the \"Move all blogs and its sub-categories to\" option.\nNotifications: Admins can manage notification channels.\nMembers - Inactive Mailing: Admin can stop the ongoing / pending mailing process.\nSecurity Upgrade: Upgrade framework from v10.25.2 to 10.48.23 for CVE-2024-52301\nContact: Add \"Can access contact page?\" permission.\nInstallation: Verify the presences of the GD extension before continuing.\nFix bugs.","event#Event":"Ban Words: Check and sanitize banned words in all contents.\nUI/UX Improvements\nMobile Apps\nAdd the \"React\" button on the Event's feed and Events on Listing page.\nWeb\nImprove the size of contents/tabs on the event detail page.\nPin the Hosts/Similar Events/Guests blocks when users scroll the page.\nRedirect to the event detail after users duplicate an event\nFix bugs.","groups#Groups":"Ban Words: Check and sanitize banned words in all contents.\nManage Group: Group administrators can manage invitations.\nUI/UX Improvements\nMobile Apps\nUpdate the text size of the Categories and Publish Date fields on the About page.\nMove to top when clicking on the \"Discussions\" tab on Group\nImprove the placeholder text when searching items in the group.\nWeb\nPhotos - Improve the user list when users tag friend on photo on closed/Secret Group.\nImprove the layout for the photo block on the group.\nAbout Group - Add the tooltip for all about fields.\nMembership Requests - Add the column \"Modified User\".\nInvite Link - Change the warning message when invitee confirms the cancelled invitation\nFix bugs.","pages#Pages":"Ban Words: Check and sanitize banned words in all contents.\nUI/UX Improvements\nWeb:\nAbout Page - Add the tooltip for all about fields\nAdd the confirm popup when the admins' page removes/blocks the member.\nImprove the Upcoming Events block layout on the page.\nImprove the Photo block layout on the page.\nImprove the page's avatar on the event detail page created on the page.\nMobile Apps\nImprove the layout of the Featured/ Sponsor icons on the page.\nAdd the confirmation when the admins' page removes/blocks the member.\nMove to the top when clicking on the \"Overview\" tab on the page.\nUpdate the text size of the Categories and Publish Date fields on the About page.\nImprove the placeholder text when searching items in the page.\nAdminCP\nSupport pagination on the Manage Claims page.\nFix bugs.","stories#Stories":"Ban Words: Check and sanitize banned words in all contents.\nUI/UX Improvements\nMobile Apps\nImprove the clickable area for the Back icon on Android app.\nAdd the confirm popup when users leave the Create Story screen with the Back button of the Android device.\nWeb\nImprove layout for the group actions on Story detail.\nCreate Text Story: Add more/less button for Backgrounds section.\nAdminCP:\nSettings: Admin can set default story lifespan.\nFix bugs.","site-background#Site Background":"UI/UX Improvements\nAdminCP: Add a success message after editing the collection","comments#Comments":"Ban Words: Check and sanitize banned words in all contents.\nUI/UX Improvements\nWeb\nImprove the layout when users mention friends in comments.\nImprove the pointer when clicking on the comment button to open the comment screen. (Android devices)\nFix bugs.","feed#Feed":"Ban Words: Check and sanitize banned words in all contents.\nOptimize performance.\nUI/UX Improvements\nMobile Apps\nSchedule Post - Not allow the user to select the past time when posting the scheduled post.\nChange the title of the page when sharing the Video URL.\nDisable the Post button when the post is empty.\nSupport map view when posting activity posts with a check-in location.\nLink post - Improve the UX when users input the URL on the post\nWeb\nSupport map view when posting activity posts with a check-in location.\nKeep the user-chosen value of the Sort Feed among login times.\nEvents - Add the feed's info for the feed in the Event.\nRedirect to the location when clicking on the map view.\nImprove the layout of the new feed after creating and scrolling down on the page/group/profile.\nImprove the pointer when opening the composer post on Android devices.\nFix bugs.","invitations#Invitations":"Ban Words: Check and sanitize banned words in all contents.","marketplace#Marketplace":"Ban Words: Check and sanitize banned words in all contents.\nFix bugs","ewallet#EWallet":"Ban Words: Check and sanitize banned words in all contents.","photos#Photos":"Ban Words: Check and sanitize banned words in all contents.\nSupport users to edit privacy of default albums (Timeline, Profile and Cover Album) of User.\nUI/UX Improvements\nWeb\nUser Profile - Improve the layout of the Photos tab when the username is too long.\nEdit Media modal: Add a divider between the media section and the Cancel/Save button.\nImprove the layout of video items on the Edit Media dialog.\nMobile Apps\nUpdate the phrase for the \"Choose from Library\" option.\nFix bugs.","blogs#Blogs":"Ban Words: Check and sanitize banned words in all contents.\nFix bugs","chat#Chat":"UI/UX Improvements\nImprove the attachment file after clicking on the Send button.\nImprove the size and number of photos per row after sending.\nHide the action button when users have no permission to delete the conversation.\nFix bugs","forums#Forums":"Ban Words: Check and sanitize banned words in all contents.\nFix bugs","live-videos#Live Videos":"Ban Words: Check and sanitize banned words in all contents.\nFix bugs\nMFOXLIVEVIDEOS-207 - Mobile - Improve the placeholder text on the Go Live screen.","music#Music":"Ban Words: Check and sanitize banned words in all contents.","polls#Polls":"Ban Words: Check and sanitize banned words in all contents.\nUI/UX Improvements\nMobile Apps\nImprove layout for total votes on the poll when the votes = 0\nWeb\nAdd/ Edit Poll: Improve layout for click icon when hovering to the Change link at the Photo field.\nImprove layout for the poll's feed share,  Poll detail and Poll title on Create Post modal\nFix bugs.","quizzes#Quizzes":"Ban Words: Check and sanitize banned words in all contents.\nUI/UX Improvements\nMobile Apps\nImprove layout for total plays on the quiz when the plays = 0\nUpdate layout on the quiz feed\nFix bugs","friends#Friends":"UI/UX Improvements\nImprove the layout of the member item and the \"Profile Popup Viewer\" when user name is too long.\nHide the Mutual Friends tab when the Guest users view User Profile\nFix bugs.","sms#SMS":"Fix bugs","newsletter#Newsletter":"Fix bugs","advertise#Advertise":"UX Improvement - Limit the price on the Sponsor Setting\nFix bugs","featured-items#Featured Items":"UI/UX Improvements\nAdminCP\nAdd New Package: Check and validate the \"Price\" field when admin tries to input invalid data\nWeb\nFeature User - Prevent the users click continuously on the Feature button.\nFix bugs.","search#Search":"Fix bugs","video#Video":"UI/UX Improvements\nWeb\nImprove the space between the Reaction and Comment icons on the video detail screen on Android devices.\nImprove the title of the Edit video modal.\nDisplay the total view on the video detail page.\nCount views from the activity stream for uploaded video views.\nFix bugs.","chatplus#ChatPlus":"UI/UX Improvements\nWeb\nChange editor chat to lexical.\nImprove the text when replying to messages.\nImprove the background on the original message when the system jumps to it.\nFix bugs.","saved-items#Saved Items":"UI/UX Improvements\nWeb\nDisplay the action button on the collection listing on mobile layout.\nAdd New Collection: Improve text holder on the Name field\nFix bugs.","subscription#Subscription":"UI/UX Improvements\nMobile Apps\nAvailable Packages: Hide \"Choose Package\" button on the Super-Admin view.\nWeb\nPackage Comparison - Improve the layout for the divider below the Feature/Package Name row.\nFix bugs.","hashtag#Hashtag":"Avoid to create hashtags with emoji\nFix bugs","activity-points#Activity Points":"Display \"Deleted User\" on the Transaction when the user has been deleted.\nFix bugs.","reactions#Reactions":"Improve UX when users react/un-react comment.\nFix bugs.","stickers#Stickers":"Improve compatibility with core v5.1.16.\nFix bugs."}},"/release-notes/metafox-release-notes/metafox-514":{"title":"MetaFox 514","data":{"":"Release Date: Aug 14, 2023We're excited to introduce MetaFox version 5.1.4, packed with new features, enhancements, and bug fixes that aim to elevate your social networking experience. In this release, we've focused on improving user engagement, expanding administrative capabilities, enhancing payment workflows, and optimizing overall performance. Let's delve into the details:","features-and-enhancements#Features and Enhancements":"","support-for-sponsor-items#Support for Sponsor Items":"We're introducing support for sponsor items across all apps. Now you can seamlessly incorporate sponsor content, enhancing user interaction while opening up new opportunities for collaboration.","invite-code-on-signup#Invite Code on Signup":"Streamline the onboarding process with the ability to enter an invite code during signup. This feature enables a smoother user journey and reinforces user connections right from the start.","enhanced-member-management-with-tab-layout#Enhanced Member Management with Tab Layout":"We've reorganized the layout into multiple tabs in the Edit Member page, simplifying member management and providing intuitive access to essential functions.","french-language-package#French Language Package":"Introducing a new language option! The addition of the French language package further enhances accessibility and user engagement.","mobile-link-sharing#Mobile Link Sharing":"Our team has worked diligently to ensure a seamless integration between MetaFox and other apps on your mobile device. Your MetaFox app will be listed in the Share options so users can easily share links from other apps to your MetaFox app, boosting cross-platform interaction. When users come across content on a certain app that they want to share it with your MetaFox, simply tap the Share button within that app, select MetaFox, and watch as the link is effortlessly integrated into your MetaFox. Say goodbye to the hassle of copying and pasting links – now, sharing interesting content with your friends and followers is just a tap away.","enhanced-custom-fields#Enhanced Custom Fields":"With the release of this update, you now have the ability to add custom fields to your profile with Checkbox, Radio, Date, and Multiple Selection types. This feature elevates your profile customization, allowing users to share specific details about themselves in a more engaging and interactive manner.","apple-pay-support#Apple Pay Support":"Apple Pay supports an advanced payment method for MetaFox, providing you with a seamless and modern payment experience. With Apple Pay integration, making purchases has never been easier or more secure.Simple Setup, Effortless TransactionsSetting up Apple Pay on our product is a breeze. No need to enter card details repeatedly; with just a few clicks, you can authorize payments instantly.Swift, Contactless PaymentsWith Apple Pay, completing transactions is as simple as holding your device near the supported payment terminal and authenticating with Face ID or Touch ID. Within seconds, your payment is processed, providing a smooth and convenient experience.Enhanced Security for Peace of MindYour security is our top priority. When you use Apple Pay, your card information is never shared with merchants. Instead, a unique token is used for each transaction, safeguarding your sensitive data from potential threats. With the added layers of biometric authentication, you can rest assured that only you can authorize payments.In this version, we have integrated the Apple Pay with the following MetaFox features:\nPurchase packages of Activity points\nPurchase Subscription\nSupported payment processor(s): Stripe","manage-pending-comments#Manage Pending Comments":"Keep your platform's discussions meaningful by managing pending comments effectively. Admins can seamlessly stay in control of user-generated content of specific user roles by efficiently managing their pending comments, and maintaining the quality and relevance of discussions.","rewarding-user-invitations#Rewarding User Invitations":"We're enhancing user engagement by allowing members to earn activity points when they successfully invite others to join the community. Strengthen the bond between users and reward their proactive efforts.","improved-admincp-functionalities#Improved AdminCP Functionalities":"Add New Translation Phrases: Customize your platform by easily adding new translation phrases through the AdminCP.\nAdd New Countries, States, and Provinces: Tailor your network to specific regions by adding new countries, states, and provinces.\nConfigure Smart Banner for Mobile: Optimize the mobile experience with configurable smart banners that capture user attention.","improved-payment-gateway-workflow#Improved Payment Gateway Workflow":"Our payment system has been refined to offer a more intuitive and efficient selection of payment gateways. Enjoy a streamlined payment process that caters to your preferences.","performance-improvements#Performance Improvements":"At MetaFox, we're committed to providing you with an exceptional social networking experience. With version 5.1.4, we've gone the extra mile to enhance the performance of our platform, ensuring that your interactions are smooth, responsive, and enjoyable.","bug-fixes#Bug Fixes":"We've diligently worked to address various bugs  and polish existing features, ensuring a smoother and more enjoyable user experience.We're dedicated to continuously improving MetaFox to meet your needs and exceed your expectations. Thank you for being part of our journey. Explore these new features, engage with your community, and make the most of MetaFox version 5.1.4!For any inquiries, feedback, or assistance, please don't hesitate to reach out to our support team."}},"/release-notes/metafox-release-notes/metafox-515":{"title":"MetaFox 515","data":{"":"Release Date: Sep 19th, 2023","whats-new#What's new":"","features-and-enhancements#Features and Enhancements":"","monetization-with-e-money#Monetization with E-Money ":"We're excited to introduce our groundbreaking E-Money feature, designed to enhance your experience on MetaFox while offering you opportunities for financial growth. With E-Money, you can now seamlessly engage with our community and generate income while enjoying a secure and efficient payment system.\nSupports Admin commission earnings, allowing administrators to earn a commission fee for every transaction that occurs within the community. All payments initiated by users within the community will be routed directly to the payment account configured in the AdminCP. This streamlines payment processing, ensuring that funds are securely and promptly received.\nUser accounts will reflect the paid amount after deducting the payment commission fee. The actual amount processed will be based on USD (United States Dollar) after being converted using the latest currency conversion rates. This ensures that users have a clear view of their earnings and expenditures. Users can manage their finances effortlessly within the Account Settings section. This includes checking their current balance, reviewing transaction history, sending funds, and monitoring withdrawal requests.\nAdmins play a vital role in the E-Money system by managing user withdrawal requests. Upon receiving a withdrawal request, Admins have the authority to approve it. Once approved, the Admin will be redirected to PayPal to complete the payment processing.","added-security-with-multi-factor-authentication-mfa#Added Security with Multi-Factor Authentication (MFA) ":"Protect your account with an additional layer of security using Multi-Factor Authentication (MFA) via Email and SMS.\nBefore enabling MFA, users need to confirm the password to ensure secure access.","login-with-tiktok-and-phone-number#Login with TikTok and Phone number":"Streamline the registration process by allowing users to sign up with their phone numbers.\nOn top of social logins with Facebook, Google, and Apple, users can now seamlessly log in to your MetaFox account using your TikTok credentials, connecting you to a wider audience effortlessly.","birthday-reminders#Birthday Reminders ":"Never miss a friend's birthday with our new reminder feature, ensuring you celebrate those special days together.","brute-force-protection-for-login-and-mfa#Brute-Force Protection for Login and MFA ":"Rest easy knowing that your account is guarded against brute-force attacks with our robust protection mechanisms for both login and MFA.","performance-improvements-for-apis#Performance Improvements for APIs ":"Enjoy faster and more responsive API interactions with significant performance enhancements.","friend-suggestions-based-on-location#Friend Suggestions Based on Location ":"Discover new connections in your area with location-based friend suggestions, making it easier to connect with people nearby.","mention-friends-pages-and-groups-in-comments#Mention Friends, Pages, and Groups in Comments ":"Users can foster engagement and connection by mentioning friends, pages, and groups in their comments now.","related-groups-suggestions#Related Groups Suggestions ":"Find public groups that match your interests by exploring related groups your friends have joined or those in the same categories.","trending-hashtags-on-mobile#Trending Hashtags on Mobile ":"Users can stay updated with the latest trends by accessing trending hashtags on your mobile app.","multiple-languages-for-categories#Multiple Languages for Categories ":"Admin can define categories of Photos, Pages, Groups, Event, Forum, Marketplace, Blog, and Music for supported languages on the community.","profile-avatar-withuploaded-photos#Profile Avatar with uploaded photos ":"Users can update their profile easily by selecting uploaded photos as their avatar.","uiux-improvements#UI/UX Improvements":"Enhanced layout in Dark Mode when mentioning Pages, Users, or Groups.\nStreamlined flow for page owners that they can only mention page members, other pages, and other public groups when creating posts.\nUsers can change language more conveniently with Language selection under the dropdown Account menu.\nValidate phone number before sending invites via SMS.\nNumerous minor UI/UX enhancements.","support-apple-pay-and-google-pay-on-mobile-app#Support Apple Pay and Google Pay on Mobile app ":"Conveniently make payments using Apple Pay and Google Pay within our mobile app, providing you with secure and efficient payment options.","background-fetch-api-on-mobile-app#Background Fetch API on Mobile app":"Experience improved app performance and seamless data synchronization with the Background Fetch API on mobile, ensuring your content is always up to date.","bug-fixes#Bug Fixes:":"We've addressed various bugs and issues to provide you with a smoother and more reliable MetaFox experience. At MetaFox, we are committed to delivering a high-quality and reliable platform for our users. We want to thank you for your feedback and for helping us identify and resolve these issues. Your input is invaluable as we continue to refine and improve the MetaFox experience.If you encounter any further issues or have suggestions for improvement, please don't hesitate to reach out to our support team. We're here to assist you and ensure that your time on MetaFox is as enjoyable and trouble-free as possible."}},"/release-notes/metafox-release-notes/metafox-516":{"title":"MetaFox 516","data":{"":"We're excited to introduce MetaFox Version 5.1.6, packed with new features, enhancements, and bug fixes to elevate your social community experience. Let's look into what's new in this new version:","core-updates#Core Updates":"","enhanced-server-compatibility#Enhanced Server Compatibility":"MetaFox now smoothly operates on servers that do not support allow_url_fopen, ensuring a wider range of server compatibility.","file-type-verification#File Type Verification":"To enhance security, we've implemented a robust file type verification system. This feature checks file types before uploading, adding an extra layer of protection.","heic-file-support#HEIC File Support":"You can now upload HEIC files, expanding your options for sharing and enjoying high-quality images.","invite-code-registration#Invite Code Registration":"Registering an account is now more flexible. Users can verify their accounts using invite codes, making the registration process simpler and tailored to various devices.","custom-field-translations#Custom Field Translations":"Editing custom fields is more user-friendly. You can conveniently add translations to labels and descriptions without navigating to the Localization Phrases, streamlining the customization process.","relative-timestamps#Relative Timestamps":"MetaFox now supports translating relative timestamps, improving the localization of time-based information.","find-missing-language-phrases#Find Missing  Language Phrases":"You can now filter missing phrases in specific language packs, ensuring a more comprehensive and accurate translation experience.","framework-update#Framework Update":"We've updated the backbone framework to Laravel 10.x, bringing you the latest innovations in web development.","php-82-compatibility#PHP 8.2 Compatibility":"MetaFox is now fully compatible with PHP 8.2, ensuring optimal performance and security.","bug-fixes#Bug Fixes":"We've addressed various bugs to enhance your MetaFox experience and ensure a smoother user journey.","new-app-updates#New App Updates:":"With MetaFox 5.1.6, we're also launching new app updates that integrate seamlessly with the core features:","activitypointconversion#Activity Point Conversion":"Whether you've earned activity points through contributions, interactions, or community involvement, now you can transform those points into tangible value within your E-Wallet. The conversion rates as well as conversion fee are configured by administrators in the Admin Control Panel (AdminCP), ensuring fairness and transparency. We believe that this feature provides a valuable incentive for user engagement.","e-wallet-usability#E-Wallet Usability":"In the previous version, we introduced fundamental features to lay the foundation for the E-Wallet. These core functionalities include:\nE-Wallet Balance Management to keep track of users' earnings and balances, ensuring transparency and control.\nTransaction History for tracking user's earnings with ease.\nManaging user withdrawal requests\nAdmin earnings with transaction/withdrawal fee\nNow, E-Wallet is no longer just a balance. It's your gateway to a more enriching and interconnected experience within the MetaFox community. With E-Wallet Usability, we've opened up a world of possibilities:\nPurchase Listing Items and Activity Point packages: You can now use the funds in your E-Wallet to acquire listing items on the MetaFox community.\nUnlock Subscriptions: Use your E-Wallet balance to pay for one-time/monthly subscriptions quickly.","multilingual-announcements#Multilingual Announcements":"Announcements can now be translated into multiple languages, ensuring effective communication with your diverse user base.","minor-uiux-improvements#Minor UI/UX Improvements":"We've made subtle yet impactful user interface and user experience enhancements to create a more enjoyable and efficient platform.","core-compatibility#Core Compatibility":"These app updates are fully compatible with MetaFox Version 5.1.6, ensuring a seamless and cohesive user experience.","bug-fixes-1#Bug Fixes":"We've diligently addressed any bugs in the new app updates to guarantee smooth and reliable performance.Upgrade to MetaFox Version 5.1.6 to experience these new features, improved compatibility, and a more user-friendly environment.Thank you for being part of the MetaFox community, and we look forward to providing you with even more exciting updates in the future."}},"/release-notes/metafox-release-notes/metafox-517":{"title":"MetaFox 517","data":{"":"MetaFox 5.1.7Core Updates\nSupport Manage Transactions and Orders in AdminCP\nPrevent users from using usernames with Unicode characters\nInstallation Wizard:\nSet the minimum version of MySQL database to 5.7.\nCan download the most recent compatible version rather than the bundled app version.\nAdminCP\nPrevent the local storage from being edited to avoid unexpected issues due to misconfiguration.\nSupport initializing permissions for inherited custom roles when installing new app.\nSupport admin to remove the folder /public/install from ACP.\nSupport defining custom fields for specific user roles.\nIntegrate with Twitter API to support fetching preview from link.\nVerify Account\nSupport to reverify the user after updating the email/phone number.\nCan verify accounts with generated code instead of verification link.\nAdd a success message when users verify their account successfully\nSign Up: Update the warning message when users input invalid data into the 'Username' field.\nSupport list items that belong to sub categories when searching for parent category.\nUsers don't have to input all but at least a currency when creating the listing/package\nSync the dark mode/light mode among browsers after signing in\nBug Fixes\nNew App Updates\nAll apps - Updates for compatibility with MetaFox Core 5.1.7\nEvents - Update phrases on the Ongoing tab when having no events.\nFriends - Remove the unnecessary setting \"Friend Requests Total\"\nGroups - Hide all group items (blogs, events, discussions, etc.) if the group app is disabled\nPages\nSupport rich text editor in for Page description\nHide all page items (blogs, events, discussions, etc.) if the page app is disabled\nStories\nAble to create Video Story\nSupport crop and rotate the photo on the 'Create Story' page.\nAllow users to pause or view previous/next stories when using the arrow and space buttons.\nFeed - Add more details on the feed items of profile updates when they are shared.\nPaypal - Add instructions for configuring the merchant ID\nMarketplace - Add the Reset button to the Bought/Sold Invoices page\nSubscription\nSupport multiple languages for Cancel Reasons.\nAdd the Reset button to the Manage Transactions and Manage Packages pages.\nE-Wallet - Add \"Manage Transactions\" page\nActivity Points - Add Reset button on the Search form in Transactions History and Package Transactions pages\nPhotos - Support view the album detail of a page/group in the current browser tab instead of opening a new one.\nPhotos - UI/UX Improvements, such as\nUpdating phrases when there are no photos/albums\nHighlighting location on the photo/video detail.\nImprove the workflow when users view the photo detail and refresh the page.\nAdd border separators between photos on a status post with many photos.\nStatus Background - Improve UI of the background box layout in mobile app\nStickers - Improve UI/UX such as\nUpdate background layout of the Recent sticker tab in mobile app.\nReset the sticker button after users close the keyboard section (mobile app).\nAllow users to reorder stickers when adding/editing.\nVideos - UI/UX Improvements, such as\nUpdate phrases on the My Video page when there are no videos\nImprove the layout for the feed of new/shared video\nSupport play video with Shared URL in the app\nMusic - Support progress bar when uploading songs\nPolls - Improve UI on Poll Details and Create new Poll pages\nAnd, many bug fixes"}},"/release-notes/metafox-release-notes/metafox-5119":{"title":"MetaFox 5119","data":{"whats-new#What's new":"","new-apps#New Apps":"","in-app-purchase#In-App Purchase":"Unlock a seamless buying experience! The all-new In-App Purchase app lets your users buy subscription packages directly from their mobile device, using the payment methods they trust. No more redirects or complicated flows—just tap, pay, and enjoy. Perfect for boosting conversions and delighting your mobile audience!","key-highlights#Key Highlights":"Purchase subscription packages natively in the app\nSecure, fast, and user-friendly payment process\nSupports both iOS and Android","anti-spam-questions#Anti Spam Questions":"Say goodbye to bots and spam signups! The new Anti Spam Questions app empowers you to create custom questions for your registration process. Make it fun, make it challenging, and keep your community safe and authentic. Flexible options let you add images, set answer types, and more.","key-highlights-1#Key Highlights":"Add custom questions (with images!) to your sign-up flow\nFlexible answer types and validation\nReduce spam and ensure real users join your community","giphy-integration#Giphy Integration":"Bring conversations to life! With Giphy now integrated, users can search and share animated GIFs right inside their comments. Express yourself with the perfect reaction, every time.","key-highlights-2#Key Highlights":"Search and share GIFs in comments\nHuge library of trending and fun GIFs","core-improvements#Core Improvements":"Improved start up time for Android app\nNew setting to toggle public access to Home Feed\nEnhanced country member management in AdminCP\nDashboard and statistics UX improvements\nMore control over email appearance and member management\nMany more UI/UX enhancements and performance optimizations\nAnd, many bug fixes."}},"/release-notes/metafox-release-notes/metafox-519":{"title":"MetaFox 519","data":{"":"Release Date: Apr 12, 2024","core-updates#Core Updates":"","uiux-improvements#UI/UX Improvements":"Enhance the typing experience with the new Rich Text Editor.\nHide the placeholder when users fill in saved data in the Username field on the Login page.\nEnhance the profile popup position when hovering over the User/Page/Group profile.\nEnhance the visibility of the Feedback column in the Canceled Members page in AdminCP.\nImprove the color consistency of the pagination controls on some pages (Point Settings, Phrases).\nSupport general player button control for video\nImprove the Turn Off Two-factor Authentication popup.\nImprove the Display Name column when searching Members in AdminCP.\nEnhance the layout of the Registration form with less than 5 fields.\nEnhance wording on the Global Search box.\nImprove the comment box on the feed item on mobile\nIn User Profile, scroll back to the top of the profile page instead of opening the user story page when clicking on a sticky avatar icon.","localization#Localization":"Show the original translation key when enabling the Active Translation setting.\nReplace the \"User Group\" with the \"Role\" in phrases.","mobile-apps#Mobile apps":"Display the Previous Sign-In screen instead of the Sign-In screen if the user has previously logged in.\nUpdate React Native Firebase library to the latest.\nSupport the \"Profile Menu Settings\" page","admincp#AdminCP":"Members - Show confirm popup when clicking on the Logout All Users button\nAppearances - Themes: Support modifying variant thumbnails.\nAppearances - Should not reload the page after editing the theme variant\nCustom Fields - Use the toggle button instead of text (Yes/No) at Active column\nCustom Fields -  Optimize the column width in the Manage Custom Fields page**.**\nAdd a warning to remind for Migration from legacy FCM APIs\nEdit text color: Automatically change the color code when the admin points to another place in the Color Picker","others#Others":"Layout Editor - Only display newly added block within the layout editor after saving.\nFirebase - Migrate from legacy FCM APIs to HTTP v1\nForgot Password: Enhance the security of the workflow by limiting the maximum number of attempts to get the verification code.\nCustom Fields - Enhance the workflow of role-specific fields by supporting multiple roles and displaying them on registration accordingly.\nEmail - Support predefined variables to enhance the customizability of the email greetings.\nAccount Setting - Hide settings of inactive Apps in Account Settings > Privacy Settings > Your Profile Settings & Sharing Items\nPagination - Support \"Go To Page\" option so users can quickly navigate through paginated items.\nRich-text Editor - Support adding link to an image on Rich-text-editor\nNotification - Support deleting all notifications on the frontend web","app-updates#App Updates":"","pages#Pages":"Support Schedule post\nImprove the layout of the Edit Page Info page\nClaim Page: Improve wording of the success message when the user resubmits a claim request\nImprove wording of the privacy when users edit the post on the page","groups#Groups":"Support custom fields for groups.\nSupport Schedule post\nEnhance the logic of ordering Similar Groups by adding the factor of group member count.\nGroup administrators can disable Discussions, Members and Photos tabs.\nUI/UX Improvement for the Edit Page Info group","events#Events:":"Support Schedule post\nCompatibility with Core v5.1.9","stories#Stories":"Improve the font text when typing the text on the story on mobile apps\nProcess videos asynchronously while creating media stories.\nSupport the \"Friends Only\" setting in AdminCP to restrict all stories to users' friends only\nAllow users to mute/unmute on the Video Story\nUI/UX improvement on the Create story page.\nUsers can close the Privacy Settings with the gear button on the Mobile layout\nSupport context menu when users click on their profile who have already created stories.","comments#Comments":"Add settings for Reply Order and Reply Detail View\nUI/UX Improvement on the Comment screen\nUsers can comment with text and stickers at the same time.\nValidate fields belonging the \"Comment Hash Check\" setting.","marketplace#Marketplace":"UI/UX Improvement for the listing section on the view on map page after users scroll down the menu app.\nUI/UX Improvement for Label in Sponsor Settings section\nWhen users input the decimal amount for prices, automatically rebound to the second decimal place.\nUI/UX Improvement for the Back button of the browser on the \"View on Map\" page.","reactions#Reactions":"Support creating new or deleting reactions in AdminCP.\nIn Manage Reactions, automatically split the characters of the Reaction Label field when it has reached the limit\nAdd a setting that the admin can change the reaction icon\nUI/UX Improvement for font color of the warning message once the reactions are activated more than 6\nLimit the reaction list on the tooltip when hovering over the total reactions.\nDon't reload the page after removing the reaction.","friends#Friends":"Remove the unnecessary description of the setting \"Maximum Length for Friend List Title\"","newsletters#Newsletters":"UI/UX Improvement on the 'View Newsletter' form","advertise#Advertise":"When users input the decimal amount, the system should automatically rebound to the second decimal.\nAdd Description For Image Tooltip","feed#Feed":"UI/UX Improvement when sharing a post with a long location\nSupport Editing the schedule post on mobile\nOn shared posts, redirect to the original post detail when clicking on the original post's time","subscriptions#Subscriptions":"When users input the decimal amount, the system automatically rebound to the second decimal place.","e-wallet#E-Wallet":"UI/UX Improvement on scroll bar when viewing the Transactions page.","announcement#Announcement":"Update announcement Intro as optional.","activity-points#Activity Points":"When users input the decimal amount, the system automatically rebounds to the second decimal place.","photos#Photos":"Support editing videos after uploading them to the album photo\nSupport view next / previous photo with pagination\nUI/UX Improvement with viewing the photo detail page (not the popup).","status-background#Status Background":"UI/UX Improvement for the select background box when users have selected a background and opened this box again.","stickers#Stickers":"Improve wording on the Manage Stickers page.","videos#Videos":"UI/UX Improvement for the comment section on the video detail on mobile apps.\nSupport new user role permission to control upload file/ share URLs in AdminCP\nRemove \"Untitled\" title for video posted in Feed\nUI/UX Improvement with viewing the video detail page(not the popup).","live-videos#Live Videos":"UI/UX Improvement for the notification when users start a live video on the page/group.\nUI/UX Improvement when sharing to Story\nSupport view live video as popup mode and page mode","saved-items#Saved Items":"Add the \"Owner\" label when viewing the members list."}},"/release-notes/metafox-release-notes/metafox-5117":{"title":"MetaFox 5117","data":{"":"Release Date: Feb 12th, 2025","core#Core":"Notification\nAdd ability to mark individual notification as [Read] or [Unread] instead of all of them\nAdminCP\nSupport Manage Items page.\nSupport Mass Actions to admin can delete/ approve all items\nSite Settings - PWA: The App Description and Install Description can be translatable.\nDeny User: Administrators can either send an email or SMS when denying a user account.\nSupport CLI commands to activate/deactivate an app.\nCheck & refactor the URLs to avoid being matched against standard firewall rules.\nUI/UX Improvements\nAdminCP\nRelationship - Remove the redundant setting \"Enable Relationships\".\nApp - Installed\nSupport sortable columns\nAdd the Upgrade button to upgrade all apps\nSupport mass actions to activate/deactivate apps.\nMembers - Update phrases on the Search form of Inactive Members \nChange the Search field to Display Name field.\nChange the \"Any\" role text to \"All\".\nShow the total items on all data grid pages.\nMobile Apps\nImprove the pointer's behavior on screens having a text field/ area when closing the keyboard.\nUser Profile: add options to Approve or Deny a user account on the user profile page.\nFrontend Web:\nImprove Shortcut dialog popup.\nRemove the horizontal bar on the notification dialog.\nCK Editor - Remove the action sheet when users input the link to the content field.\nImprove the filter field on the transaction/invoice page.\nImprove the Layout when users select the location.\nFix bugs","event#Event":"AdminCP - Add Manage Items page.\nUI/UX Improvement - Hide the options: \"Duplicated Event/Export Event/Add to Calendar (mobile)\" on the pending events.\nFix bugs","groups#Groups":"AdminCP - Add Manage Items page.\nMember Request - Group administrators / moderators can enter reason when declining member requests\nUI/UX Improvements\nNotifications - Add the hyperlink for the \"Accept your request to join the group\" notification.\nMobile App - Manage Group - Adjust the layout on the Manage group on moderator\nMembers - Admin/Moderator Group will not unmute themselves.\nFix bugs.","pages#Pages":"AdminCP - Add Manage Items page.\nFix bugs","feed#Feed":"Support the \"Hide all from <user>\" option.\nAccount Settings - Add the Manage Hidden page.\nImprove feed performance by utilizing resource cache.\nUI/UX Improvements\nChange the \"Video URL\" shortcut to avoid confusion with media upload (photos and videos).\nMobile app - When post with link, allow user to input the characters when the loading icon displays.\nFrontend Web\nImprove border photo on feed item\nHide some actions on Group when viewing the Group's post on the NewFeeds\nFix bugs.","marketplace#Marketplace":"AdminCP - Add Manage Items page.\nUI/UX Improvements\nMobile Flatten - When viewing photos on the listing, improve layout of count total on the image.\nHide sponsor/feature action on the expired/ closed listing.","videos#Videos":"AdminCP - Add Manage Items page.\nUsers can move videos to different albums when editing videos.\nUI/UX Improvements\nImprove the layout of \"Created a new video\" notification.\nImprove the videos' title uploaded to the composer post on the Manage Videos page.\nComposer Feeds - Display the Title when sharing the URL video on Feed\nFix bugs.","blogs#Blogs":"AdminCP - Add Manage Blogs page.\nMinor UI/UX Improvements.","chatplus#ChatPlus":"Sanitize banned Words in messages.\nUI/UX Improvements\nMobile App\nImprove speed when opening a direct conversation from the group conversation.\nFrontend Web\nImprove the player of the video message on the conversation.\nImprove the position of the action button when hovering over the two photos message.\nUpgrade lib-jitsi-meet Library for Video calls.\nFix bugs.","forums#Forums":"AdminCP - Add Manage Items page.\nUI/UX Improvements\nChange the font size of Thread Title on the feed.\nImprove layout of the \"Created a new thread\" notification.\nOrder the post with the newest creation date on the Manage Posts page.\nFix bugs.","live-videos#Live Videos":"AdminCP - Add Manage Blogs page.\nUI/UX Improvements\nMobile Apps\nImprove layout of the sticker comment on the living video.\nHide the Go Live button when no services are configured.\nFrontend Web\nRemove the item border in dark mode.\nFix bugs.","music#Music":"AdminCP - Add Manage Blogs page.\nFix bugs","polls#Polls":"AdminCP - Add. Manage Blogs page.\nFix bugs.","quizzes#Quizzes":"AdminCP - Add Manage Items page.\nUsers can play quizzes on activity feeds.\nUI/UX Improvements - Web - Improve layout for Submit button on the quiz feed.\nFix bugs","photos#Photos":"AdminCP - Add Manage Items page.\nFix bugs.","advertise#Advertise":"Do not allow the admin to edit the Started Time.\nUI/UX Improvements\nImprove warning/error messages when creating new ad.","newsletter#Newsletter":"Support multiple languages when creating newsletters.\nFix bugs.","story#Story":"UI/UX Improvements\nStory Archive: Support viewing more stories in the Story Details section\nMove Editor to Lexical\nFix bugs","comment#Comment":"UI/UX Improvement - Improve the animation of comments after clicking on Send button.\nFix bugs","subscription#Subscription":"UI/UX Improvements\nPackage Comparison: enhance the visibility of feature marks\nRemove some redundant lines on Packages Comparison section.\nImprove the payment workflow when buying the package has the first free time and recurring manual.","featured-items#Featured Items":"UI/UX Improvement - Feature User - Prevent the users from continuously clicking on the Feature button.\nFix bugs","announcement#Announcement":"Fix bugs","status-background#Status Background":"UI/UX Improvements\nImprove the pointer behavior after users change the status background.\nNot display the horizontal scroll bar after switching to the status background.\nImprove UI of the mentioned user/page/group name on the status background.\nFix bugs","chat#Chat":"Fix bugs","friend#Friend":"Improve compatibility with Core v5.1.17.","invitations#Invitations":"Improve compatibility with Core v5.1.17.","e-wallet#E-Wallet":"Improve compatibility with Core v5.1.17.","hashtag#Hashtag":"Improve compatibility with Core v5.1.17.","activity-points#Activity Points":"Improve compatibility with Core v5.1.17.","search#Search":"Improve compatibility with Core v5.1.17.","reactions#Reactions":"Improve UX when user react on comment"}},"/release-notes/metafox-release-notes/metafox-518":{"title":"MetaFox 518","data":{"":"Release Date: Mar 5, 2024","core-updates#Core Updates":"Support the new Rich-text Editor\nEnable Rich-text Editor for Profile - About Me\nLocalization\nCountries - Support manage cities\nPhrases - Replace \"Group\" column with the \"Original Text\" column.\nLayout Editor Mode:\nAble to add Google Adsense block\nSupport Editor Mode on the Registration page\nUpdate link for the Help icon\nMinor UI/UX Improvements:\nDisplay the loading screen based on chosen light/dark mode.\nSupport display menu icons of static pages on mobile apps\nAdd the Close button at the right of the search field when users fill data to this field on the State/City screen\nImprove phrases of Reports\nImprove the button color of Sign in with Google or TikTok if it is the unique option\nMobile apps - Display calender picker when tapping on the calendar icon\nExtend the forgot password session lifetime to 5 minutes and improve the error message to avoid confusion\nUsers:\nAdmin can log out all users\nUser can log out his/her account on other devices\nRemove the custom gender to avoid discrimination\nRegistration Settings: Improve the workflow of the \"Force Users to Upload Profile Image\" setting\nDisable the Registration option for custom fields of specific roles\nSupport parse email addresses in the text content\nAppearances\nCan configure icon color of side menu items of the mobile apps.\nCan open link-type menus with context menu (right-click menu)\nFix bugs","app-updates#App Updates":"All apps\nImprove phrases\nManage Categories - Can view list of subcategories by clicking on the number of subcategories\nEvents - Include group events when listing events that users are interested in, attending or invited to.\nFollow - Add the 'Follow User' option on the Following/Follower sub-tab on the profile page\nPhotos\nSupport edit photo after selecting a photo\nAdd permission settings to allow users to add mature images with warnings\nAlbum Details - Not reload when deleting photo of the album\nVideos\nImprove video resolution\nReposition the Fullscreen option on iPad\nAble to share Rumble Video Platform\nPages\nSupport custom fields\nEnable the Like button on the shared-page feed items\nNewsletters - Admin can select multiple roles, genders and locations for a newletter\nChat - Support push notifications on Web/Mobile app when users receive a new message\nChatPlus\nAdd the \"Jump to this message\" action on the pinned messages\nCan jump to the original message when clicking on the reply message or searched message\nUsers can copy/paste and drag/drop multiple files (photo/video/...) into the conversation\nStories\nUsers can mute/unmute on the Video Story on web\nAdd friend suggestions for the Instagram-type story\nAdvertise - Improve the layout in the Manage Ads page\nComment - Add the \"View Post\" button on the Comment screen of mobile apps\nFeed\nAdd the permission setting \"Can save media posts?\" in the ACP\nChange permission setting \"Can pin activity feed?\" to \"Can pin posts on Profile User/Page/Group?\"\nInvite - Admin can manage invitations of all users in AdminCP\nReactions - Admin can manage existing reactions in AdminCP\nEWallet - Improve layout on mobile apps\nHashtags - Support multiple languages\nActivity Points - Add permission setting to allow users to create point conversion requests\nStatus Background - Support multiple language for the Collection title\nAnd, many bug fixes of apps"}},"/release-notes/metafox-release-notes/metafox-520":{"title":"MetaFox 520","data":{"whats-new#What's new":"Core\nUpgrade to Laravel 12 - Enhanced performance and security with the latest Laravel framework\nCompatible with PHP 8.4 - Support for the newest PHP version ensuring optimal performance and security\nCompatible with PostgreSQL 17 - Extended database compatibility for enterprise deployments\nReact Native 0.77 Support - Mobile apps now support Android 15 with the latest React Native framework\nAPI Versioning Support - Better API management and backward compatibility for developers\nImage Quality Control - New setting that allows users to toggle between viewing original uploaded images and resampled versions for better performance\nContact Form Enhancement - Added Terms of Service confirmation checkbox to contact forms for better compliance\nCSV User Import - Administrators can now import users from CSV files with sample file download support\nAdminCP Improvements\nMessage Queue Timeout Setting - Configure queue timeout settings for better performance management\nPassword Reset Link Expiration - Configurable expiration time for password reset links\nMember Management Enhancements:\nFilter members by Banned User role\nImproved workflow for reassigning super administrators\nEnhanced custom field handling with better error messages\nUpgrade Wizard Improvements - Better handling of incompatible apps during upgrade process\nPerformance Optimization - Faster language package setup during upgrades\nUI/UX Improvements\nRegistration Enhancement - Users are automatically logged in after completing email verification\nSocial Login Integration - Added signup buttons for social accounts on the registration form\nSEO Improvements - Customized SEO metadata now takes precedence over system-generated content\nEnhanced Search Functionality - Search results now include descriptions across all apps\nDark Mode Improvements - Better layout and color consistency in dark mode\nMobile Layout Enhancements - Improved video layout for directly uploaded content\nPhotos\nAlbum Management - Enhanced photo album creation and editing experience\nSearch Improvements - Better photo search functionality, including description-based searches\nSocial Connect\nEnhanced Social Login - Improved Facebook and Google login experience\nAvatar Handling - Better avatar resolution when logging in with social accounts\nMobile Stability - Fixed crashes when logging in with social accounts on Android\nComments\nGIF Support Enhancement - Improved description handling for comments containing Giphy content\nEdit History - Enhanced edit history descriptions for better content tracking\nEvents\nUI Improvements - Better event title display in Upcoming Events blocks\nGroup Integration - Enhanced event invitation system for group members\nGroups\nMenu Settings - Ability to deactivate default menus for better customization\nLanding Page Control - Improved UX for menus set as landing pages\nRole Management - Better role label display in dark mode\nPages\nMenu Customization - Enhanced menu settings with the ability to deactivate default options\nMusic\nMobile Enhancements - Fixed repeat/shuffle functionality on mobile layouts\nPlaylist Management - Improved album and playlist editing experience\nVideos\nMobile Layout - Enhanced video display layout for mobile applications\nSubscriptions\nTranslation Support - Multi-language support for subscription packages\nRole Management - Improved user role handling during subscription changes"}},"/set-up-community":{"title":"Set Up Community","data":{"":"Welcome to the \"Set up Community\" page, your launchpad for creating and configuring a vibrant and engaging online community. This comprehensive guide will walk you through each step of the process, from inception to customization, ensuring that your community thrives and resonates with your vision. Let's start"}},"/release-notes/metafox-release-notes/metafox-521":{"title":"MetaFox 521","data":{"":"Release Date: Dec 23rd, 2025","whats-new#What's new":"","core#Core":"Sponsorship prompts now support item_name parameter for better conversions.\nAdminCP: more explicit Service Keys guidance to reduce setup confusion.\nMail: unsubscribe link added to email footer for compliance.\nStatistics chart selections now stay cached for faster admin reviews.","chatplus#ChatPlus":"Message migration from Chat to ChatPlus.\nUpgraded Rocket.Chat engine to 7.x for stability and performance.\nMobile support updated for iPhone 17/17 Pro/17 Pro Max.\nWeb: shows message limit warnings before sending to avoid loss of content.","social-registration#Social Registration":"Added opt-in step for Terms of Service and notifications before account creation, improving consent flow.","mobile-experience#Mobile experience":"Web/Mobile push notification setting screens.\nSupport Google Play's 16 KB page sizes.","media--sharing#Media & sharing":"Fixed TikTok video sharing errors.","reliability-highlights#Reliability highlights":"Fixed Sort Feed on mobile app.\nFixed group invitation links now open with the correct URL and pending requests stay pending until reviewed .\nLocalization fixes for deactivating unused countries and currencies in AdminCP.\nOther minor fixes and improvements."}},"/release-notes/metafox-release-notes/metafox-5118":{"title":"MetaFox 5118","data":{"":"Release Date:","whats-new#What's new":"","tour-guide-new-app#Tour Guide (New App)":"Excited to show off your platform? So are we! The Tour Guide app is here to help you create engaging, interactive walkthroughs that guide your users through the heart of your community. Whether they’re brand new or exploring fresh features, Tour Guide makes every step feel intuitive and exciting. It’s easy to set up, fun to use, and a powerful way to turn first-time visitors into confident, happy members. Let’s show them around!","highlighted-features#Highlighted Features":"Site administrators can create a unique tour guide for each page and add multiple steps to guide users through specific elements or workflows.\nUsers can experience the tour guide step-by-step on the selected page.\nUsers can repeat the tour, go back to a previous step, refresh the guide, move forward, or end it at any time.\nThe tour guide is automatically disabled once the user finishes it, ensuring a clean and unobtrusive experience.","core#Core":"Compatible with PHP 8.3\nOptimize performance for API endpoint /settings\nREST API Generation: scan and fix general issues.\nImprove the avatar's resolution when logging in with a social account.\nSupport In-app purchase on mobile apps\nAdminCP\nMembers: \nAdmin can export users to CSV file.\nSuper Administrator can designate another user as a Super Administrator.\nMember Settings: Add a new setting to control token lifetime.\nRegistration Settings:\nAdministrators can configure multiple users for the 'On Signup New Friend' settings.\nRemove the Send Welcome Email setting. Welcome email will be managed on AdminCP > App Settings > Notifications > Types > App Name (User)\nAdd a new setting to configure Email logo\nReports: Add settings to control who will receive notifications whenever there are new reports.\nBuild Histories - Remove build bundles immediately after extracting to save disk space.\nLocalization - Add options for admin to set the default country and language.\nControl Staff access within AdminCP.\nStorage - The admin can remove storage configurations even if they contain uploaded files.\nBan Filters:\nAdd the Active column for the ban filter page (Email/IP Address/ Word).\nValidate the email's format before adding it to the banned email list.\nRegex Rules: Validate the regex rules format before adding to the system.\nUI/UX Improvements\nFrontend Web\nHide the member item viewer when hovering over the member's name on the Dashboard page.\nUpdate user information immediately after editing.\nInstallation Wizard\nVerify the existence of functions (symlink, link) upon installation.\nImprove the workflow when process functions (proc_open, proc_close) are missing\nLimit the page Title meta to 60 characters.\nMobile layout - Hide the total badge notification after opening the notification popup.\nEnhance color border contrast.\nHide the title when viewing the type detail on the global search.\nSupport changing languages on the Registration page.\nAutofocus on the \"Email Address or Phone Number\" field in the Forgot Password section.\nSupport SEO meta schemas for live videos\nAdminCP\nThe Backup Wizard should be executed in the background to avoid the timeout issue.\nImprove queue processing to avoid long-run background jobs from being retried unexpectedly.\nDashboard: reflect the statistical chart data by date accordingly.\nSite Statistic: Support monthly statistics. \nClear the search box after the admin selects a suggested option or go to another page.\nSupport the close button \"X\" to the \"Is Core\" dropdown of the App> Installed page.\nAdmin can reassign a category to a different sub-category during the modification process.\nMobile App\nComposer Feed - Hide the URL Video button on the Event/User Profile/ Group/ Page\nFlatten App - Improve behavior of the Birth Date field after selecting data.\nFix bugs","groups#Groups":"UI/UX Improvements\nUpdate the notification text of new posts in the group.\nFix bugs","pages#Pages":"UI/UX Improvements\nAdminCP:\nAdd a new settings \"Automatically follow selected pages on sign-up\".","social-connect#Social Connect":"Login with Facebook: compatibility with JWT token","invitations#Invitations":"Add permissions to manage who can invite others to the site.\nSupport Refresh Invite Code feature.\nAdd the Manage Invite Codes page.\nInactivate the invite code if the inviter is deleted from the site.\nUI/UX Improvements\nAdminCP:\nImprove the position of Search button.\nSupport mass Delete action and sortable columns in the Manage Invitations page.\nUI improvement for the checkbox after users use the mass action to resend their invitations.\nImprove the invitation content when having no personal message.\nFix bugs","paypal#PayPal":"Support Payment Return Url on Success and Cancelled Payment.","ewallet#EWallet":"Support Adjust Balance for Admin to control the user balance.\nWithdraw Request:\nSend withdrawal request notifications to all users who have Super Admin roles.\nRedirect to the Withdrawal Requests page after creating the request.\nUI/UX Improvements\nMobile \nAdd the \"Fees\" and \"Amount will be received\" rows on the Conversion Request popup.\nFix bugs.","marketplace#Marketplace":"UI/UX Improvements\nImprove workflow for pending invoices when the listing has expired/changed price.\nOn the listing that has expired/changed price, the PayNow button needs to be shown on the listing.\nRemake the option \"Repayment\" to \"Pay Now\"\nMore options for Status filter on Search form.\nNot zoom in on the map when clicking on the listing title on the map.\nFix bugs","activity-points#Activity Points":"UI/UX Improvements\nOn Package Transaction page\nAdd \"Pay Now\" option on the Pending transaction so that user can pay again.\nRemake column ID to Transaction ID\nAdmin/ users can order data by columns\nAdminCP -  Add Payment Method column and filter to admin can manage  package transactions via payment method.\nFix bugs","search#Search":"UI/UX Improvements\nHide the empty member section on the search result page.\nHide empty sections on the search result page.","chat#Chat":"UI/UX Improvements\nMobile apps - Jump to the original message when tapping it on the reply message.\nFrontend Web - Hide the total badge notification after opening the message popup.\nCompatible with MetaFox 5.1.18","chatplus#ChatPlus":"UI/UX Improvements\nFrontend Web - Hide the total badge notification after opening the message popup.\nDisable Chat app when enabling ChatPlus and vice versa.\nCompatible with MetaFox 5.1.18\nFix bugs","chatgpt-bot#ChatGPT BOT":"Support report ChatBot message\nUI/UX Improvements\nImprove chatbot to support creative works\nHide all ChatBot conversations when admin turn ChatBot feature off.\nCompatible with MetaFox 5.1.18","forums#Forums":"UI/UX Improvements\nFrontend Web - Improve the layout for thread items when searching on the global search/page/group.\nAdminCP - Open Manage Threads page by default when admin open the Forum app\nCompatible with MetaFox 5.1.18","photos#Photos":"Mature Images: Support blur image thumbnail when user shares link of mature images on the site.\nSupport Google Image metadata for structured data.\nCompatible with MetaFox 5.1.18\nFix bugs.","videos#Videos":"Support Setting for Mature Videos.\nSupport playback speed for natively uploaded videos.\nCompatible with MetaFox 5.1.18\nFix bugs.","getting-started#Getting Started":"UI/UX Improvements\nFrontend Web - Change the ordering display the Getting Started pop-up when the system has too many pop-up.\nAdminCP - Add the Check List on the Welcome page\nCompatible with MetaFox 5.1.18\nFix bugs.","announcement#Announcement":"UI/UX Improvements - Display the newest announcement on the first in the Announcements block.\nFix bugs","stories#Stories":"UI/UX Improvements\nThe publishing order of stories follows the posting order instead of the processing status.\nImprove the performance when loading story.\nImprove mobile layout for \"Create Story\" button on feed.\nFix bugs","newsletter#Newsletter":"Support multiple languages when creating newsletters.\nFix bugs","captcha#Captcha":"UI/UX Improvements\nImprove the UX of Recaptcha V3 when viewing pages that have no captcha rule.\nFix bugs","and#And,":"There are many bug fixes, minor UI/UX Improvements, and updates for compatibility with MetaFox 5.1.18 on other apps, such as Blog, Quiz, Poll, Event, Music, Site Background, Stickers, Follow, Status Background, Friends, Reactions, Save Items, Featured Items, Subscriptions, Advertise, Comment, Feed, SMS, Twilio, etc."}},"/set-up-community/configure-app-settings":{"title":"Configure App Settings","data":{"":"In this section, we will walk you through the process of customizing and personalizing your application experience. By configuring app settings, you can tailor various aspects of the software to suit your preferences and optimize its functionality according to your unique needs. Let's get started!"}},"/release-notes/metafox-release-notes/metafox-512":{"title":"MetaFox 512","data":{"":"Release Date: Jun 14, 2023","whats-new#What's new":"New Apps / Features\nInvitations 5.0.0\nData Migration from phpFox V4\nImprovements:\nAble to use different domains for Web (Frontend), API (Backend) and AdminCP\nUpdate workflow when buying an item with Activity Points\nSupports filtering of featured items\nAdd breadcrumbs to Create/Edit forms of items if their owner is not a user (ex: Page, Group, ...)\nImprove quality audio/video call\nImprove performance\nBug fixes"}},"/set-up-community/configure-app-settings/configure-chat-with-pusher":{"title":"Configure Chat with Pusher","data":{"":"This article will guide you step by step to configure Chat app.Chat app is using Pusher (https://pusher.com/) to push messages in a realtime manner. We assume that you have registered an account on Pusher and choose the appropriate Pusher plan. Now, let's log into your Pusher account and create a Channel app.On the Create your Channels app form, please input the fields of Name of your app and Select ClusterYou should choose the cluster based on your target users for the best performance.Once app is created, you can go to App detail page > App Keys to get Pusher keys.Now, you can go to AdminCP of your MetaFox site > App Settings > Chat to configure Chat with PusherLastly, to apply Chat config.That's it! You have completed the configuration for Chat with Pusher. NOTE: Please make sure that MetaFox Crons have been configured properly in order for Chat to work. Refer to the here.Now, you can go the frontend to check how Chat work."}},"/set-up-community/configure-app-settings/set-up-video-sharing-with-url":{"title":"Set up Video Sharing with URL","data":{"":"MetaFox supports sharing video URLs of many popular Video providers such as Youtube, Facebook, Vimeo. This guide will guide you how to set up Video Sharing with a URL","youtube#Youtube":"Here is step-by-step guide to enable video sharing with Youtube on MetaFoxAssume that you can and obtain the API key.In Google Cloud Console, go to APIs & Services > Enable APIs & Services section, search, and enable YouTube Data API v3 service.Now, you can go to AdminCP of MetaFox site > Settings > Service KeysConfigure the Google API key obtained in the previous step to the Youtube Data API Key setting. And click the Save Changes button to apply the config.","facebook-videos#Facebook Videos":"In this section, we are going to set up for video sharing with Facebook VideosAssume that you can and obtain the Facebook App ID and Secret Key.In the Facebook App Dashboard, go to App Reviews and submit requests for the OEmbed Read feature. You will follow the Facebook guide to get the approval for this permission.Now, you can go to AdminCP of MetaFox site > Settings > Service KeysConfigure the Facebook App ID and Facebook App Secret settings with details obtained in the previous step. And click the Save Changes button to apply the config.","thats-all-the-setup-for-video-sharing-is-done-you-now-can-share-videos-with-urls-of-videos-of-these-providers-on-your-metafox-site-as-of-now#That's all. The setup for video sharing is done. You now can share videos with URLs of videos of these providers on your MetaFox site as of now.":""}},"/set-up-community/configure-app-settings/set-up-sms-with-twilio":{"title":"Set up SMS with Twilio","data":{"":"In this article, we will guide you to set up SMS with Twilio service provider. Assume that you have completed the registration on Twilio web.After logging into the Twilio service page with your account, you can get the details of Account SID and Auth Token. Save these values to configure in MetaFox siteLet's log into your MetaFox site with Admin user. Then go to AdminCP > Settings > SMS > Settings. Make sure that the Send SMS Method is enabled with twilio option as below screenshotLet's move to the Services and edit the Twilio provider, you will see three inputs you need to fill in (Account SID, Auth Token, From Number). The first two fields you can get it from your Twilio home page above.Fill in the phone number you acquired from Twilio service into the \"From Number\" field. Twilio provided a detailed guideline for acquiring their phone number; kindly visit the link https://help.twilio.com/articles/223135247-How-to-Search-for-and-Buy-a-Twilio-Phone-Number-from-Console for more details.Then click the Save Changes button to apply the configuration.Congratulation. You just completed the setup for SMS with Twilio."}},"/set-up-community/configure-appearances-layout-and-themes":{"title":"Configure Appearances Layout and Themes","data":{"":"In this comprehensive guide, we will walk you through many topics of configuring appearances, layout, and themes in our social networking software. By customizing these elements, you can create a unique and visually appealing platform that aligns with your brand identity and engages your users effectively."}},"/set-up-community/configure-appearances-layout-and-themes/add-google-adsense-block":{"title":"Add Google Adsense Block","data":{"":"In this article, we are going to guide you how to add a Google Adsense blocks onto MetaFox site.Firstly, you will need a Google Adsense account. Refer to this article for more details.Log into your MetaFox site with the Admin user. On the Frontend, let's .Choose the Edit Site Content option if you want to add Google Adsense block into all pages. Or choose the Edit Page Content option if you want to add into the current page.In the Page Layout, click the Plus  icon to add the block in certain section you want.Then search for the Google Adsense block as belowAdd the Google Adsense snippet code into the Ins element textbox. Note that the snippet code includes 2 different sections for the header and the body. You will put the code section for the body here. For the code section of the header, you can refer to the  article.Then click Save Changes button.Now, the Google Adsense block has been added. You can publish the layout and .Congratulation. You can add the Google Adsense block into the MetaFox site"}},"/set-up-community/configure-app-settings/set-up-video-upload-functionality":{"title":"Set up video upload functionality","data":{"":"The video upload feature in our product allows administrators to enhance their users' experience by enabling them to upload videos from their local machines.To provide flexibility and compatibility, we offer two options for video processing: FFMPEG and Mux. This guide will walk you through the step-by-step process of configuring and setting up these video processing options to ensure seamless and efficient video uploads.","configure-video-upload-with-ffmpeg#Configure video upload with FFMPEG":"","install-ffmpeg-on-your-server#Install FFMPEG on your server":"Some hosting providers support FFMPEG by default. Thus, please check with your hosting provider for the FFMPEG PathIf FFMPEG isn't available, you have to begin by installing FFMPEG on your server or hosting environment. You can download the latest version of FFMPEG from their official website or use package managers specific to your operating system.If you aren't familiar with FFMPEG setup, please get in touch with your hosting provider or system admin for assistance to install this tool.","configure-ffmpeg-path#Configure FFMPEG Path":"Once FFMPEG is installed, ensure that the system recognizes its path. Now, we will configure FFMPEG service on MetaFox siteLet's log into your MetaFox with the Admin user and go to AdminCP Dashboard > App Settings > VideosClick on the Services menu on the header bar, then click on the FFMPEG item as the screenshot.Configure 2 settings with the proper paths of FFMPEG and FFPROBE you got in step 1. Note that the FFPROBE will be installed automatically along with FFMPEG.Then save changes.You can go to the Settings section by clicking on the Settings top menu. Choose the FFMPEG service for video upload and save changes as below screenshotYou will need to make sure that has been set up for uploaded videos to process.","configure-video-upload-with-mux-integration#Configure video upload with Mux Integration":"","create-a-mux-account-and-configure-mux#Create a Mux Account and configure Mux":"If you haven't already, sign up for a Mux account at https://mux.com/. Mux provides powerful video processing capabilities, including adaptive streaming and analytics.After registering Mux account successfully, you will need to set up Mux to get Access Token (Client ID and Client Secret ) and Webhook SecretSet up Access TokenOnce registered, log in to your Mux dashboard.Navigate to \"Settings\": In your Mux dashboard, locate and click on the \"Settings\" option, typically found in the top-right corner of the page.Choose the Access Tokens menu or within the \"Settings\" section, select \"Access Tokens.\" Here, you can manage your API tokens.Click on the \"Create New Token\" button to generate a new Access Token. Provide a descriptive name for the token, and you can also assign permissions to control API access as below. Then click \"Create\" to generate the Access Token.Once the Access Token is generated, copy it immediately and store it securely in a safe location. This Access Token is essential for authenticating requests of your MetaFox site to the Mux API.Setting Up Mux WebhookIn your Mux dashboard, go to the \"Settings\" section.Within the \"Settings\" section, select \"Webhooks.\" This is where you'll set up and manage your Webhooks.Click on the \"Create New Webhook\" button to set up a new webhook. You'll need to provide specific details about the webhook.Enter the URL where you want to receive the webhook notifications in the \"URL to notify\" field. Please fill the URL https://yourdomain.com/api/v1/video/callback/mux . You need to replace the yourdomain.com part the URL with the proper domain of your MetaFox siteAfter configuring the webhook details, click \"Create Webhook.\".Then you can click on the Show Signing Secret of the created webhook item to get the detailed signing secret. Copy and store it for later usageYou have set up your Mux account successfully. Now we can move to the next step to configure the Mux service on your MetaFox site.","configure-mux-service-on-metafox#Configure Mux service on MetaFox":"Go to AdminCP Dashboard > App Settings > Video > Services. Then choose Mux Video item as belowFill in the settings with the proper values you have when setting up your Mux account. Then save changes.Go to the Settings section by clicking on the Settings top menu. Choose the Mux service for video upload and save changes as below screenshot.Congratulations! You have successfully set up the video upload functionality using either FFMPEG or Mux. Now, you will see that the Upload option is enabled for users when creating a video"}},"/set-up-community/configure-appearances-layout-and-themes/configure-site-logo-favicon-and-site-assets":{"title":"Configure site logo favicon and site assets","data":{"":"This tutorial will show you how to change your site's appearance.","configure-the-site-logo-and-favicon#Configure the site logo and favicon":"This assumes you are already logged in as the Admin user and are now in the AdminCP.\nFrom **Apprearences> Assets>**Input the keyword Logo or favicon into the field Search\nYou will see two items to edit your logo: light and dark modes.\nFrom the Options section>Click on the Gear and choose **Edit>**Upload the new logo and Save Changes.\nTips: Don't forget to clear the cache to display your new logo properly.","build-site-to-apply-changes#Build site to apply changes":"Under AdminCP > Appearances, you go to Themes > Rebuild Site. Then, click on Rebuild Site button. It may take a few minutes for the build process to complete and update the frontend (web).Now, you can go ahead to change many other assets."}},"/set-up-community/configure-appearances-layout-and-themes/rebuild-web-frontend":{"title":"Rebuild web frontend","data":{"":"Frontend web of MetaFox is developed with React so it needs to be rebuilt when having updates such as installing/upgrading apps, or changing frontend assets (favicons, logo, etc). MetaFox Build is a powerful and essential service provided to administrators to effortlessly regenerate the frontend assets (JS, CSS etc.), ensuring the latest code changes and updates are effectively reflected in the live production environment. You just need to do few clicks in AdminCP to rebuild Frontend web as belowAssume that you have changes settings or installing apps that require to rebuild the frontend web. Now, click on the Rebuild icon on the top header menu bar in AdminCP, or go to Appearances > Themes > Rebuild site pageClick on the Continue button to start building frontend with MetaFox Build ServiceYou can check the status of your build requests as well as build history in the Build History pageIf the build request has been done and updated successfully, you will notice the green check on that build request."}},"/set-up-community/configure-appearances-layout-and-themes/enable-live-editor-mode":{"title":"Enable Live Editor mode","data":{"":"The powerful Layout Editor feature in our social networking software, allowing administrators to effortlessly modify page layouts and customize styles in a visual and intuitive manner. With this feature, admins can take full control over the design and appearance of their social networking platform, creating a unique and tailored experience for their users.In this article, we will guide you how to enable Live Editor mode to start the current theme variant as well as general introduction about various options this feature is supportingLet's start by logging into your site with Admin userOpen the Header Account menu on the top-right corner, click on the Editor Mode menu.  You will see that web frontend will be switched to the Live Editor mode and the toolbox will be displayed.You can disable Live Editor mode by simply clicking on the (X) button on the top of toolbox","layout-editor-toolbox#Layout Editor Toolbox":"Now, we will generally introduce you to the Layout Editor toolbox","view-as-guests#View as Guests":"Enabling this option to be able to configure/customize the Login page as well as viewing your site as Guests","for-screens#For Screens":"This tool provides options on the screen size to help you have visually check how your site display on different devices","live-edit#Live Edit":"This option is active by default when enabling the Layout Editor mode. In Live Edit, you can edit/add/remove block at the current page by clicking on the Edit icon on certain blocks and do necessary modifications.","#":"","edit-page-content#Edit Page Content":"You can Add/Edit/Delete blocks to certain layout sections of the current page, including: + Header page+ Top page+ Side page+ Main page+ Subside page","edit-site-content#Edit Site Content":"Similar to Edit Page Content but applying blocks for ALL pages.","edit-layout#Edit Layout":"With this feature, you can configure how a certain layout section (slot) displays or behave on the current page layout, such as scrolling behavior, width of layout sections (slots), etc.In the below screenshot, we are editing the side section (slot) of the layout of Home page","change-layout#Change Layout":"You can configure the layout of the current page according to their preferences.","edit-styling#Edit Styling":"Using Edit Styling option,  you can have various tools to customize the fonts and colors of their site effortlessly and visually. With this feature, admins can easily tailor the visual aspects of the platform to align with their brand identity or create a unique and engaging user experience. From selecting the perfect font styles to choosing vibrant color palettes, admins have full control to create a visually stunning and cohesive platform that reflects their vision and captivates users.","display-presets#Display Presets":"In this section, you can configure defined displaying styles for blocks, items. Blocks can be configured to use these defined displaying styles when editing a block with the Live Edit toolThe screenshot below is the configuration of the displaying style with name \"Account Setting\"You can then configure this \"Account Setting\" style when editing the block Account Setting in Live Edit","toggle-rtl#Toggle RTL":"You can enable this option to see how your site displays in Right-to-Left (RTL) layout","toogle-dark-mode#Toogle Dark Mode":"Dark mode offers a stylish alternative to the traditional light mode, reducing eye strain in low-light environments and providing a more immersive browsing experience. Experience enhanced readability, reduced screen glare, and a modern look with the Dark Mode.You can use this option to check how your site displays in Dark Mode.","view-histories#View Histories":"The View Histories tool allows you to trace and review changes made in the Layout Editor. With this feature, you can easily track the evolution of their page layouts, view a history of modifications, and revert to previous versions if needed. By providing transparency and accountability, the View Histories feature ensures that administrators have a clear understanding of the changes made, enabling them to maintain consistency and make informed decisions about their platform's design and layout.","discard-changes#Discard Changes":"The Discard Changes help you to discard any modifications or edits made to a page but haven't saved them yet. This feature provides a quick and convenient way to revert back to the original content or layout of a page, ensuring that unintended changes can be easily undone. With the Discard Changes feature, you can experiment and make adjustments with the confidence of knowing that they can easily discard any unwanted modifications and start fresh with the original content or layout.We have introduced briefly about the Layout Editor on MetaFox. With this powerful tool, you'll be able to configure appearances, layout, and themes in your social networking software, creating a visually appealing and personalized platform that resonates with your brand and captivates your users. Remember to regularly review and refine these settings to keep your platform fresh and engaging.Empower your community with a visually stunning and user-friendly social networking experience through effective configuration of appearances, layouts, and themes."}},"/set-up-community/configure-general-and-site-settings":{"title":"Configure General and Site Settings","data":{"":"In this section, we are going to guide you on how to configure general setting of your MetaFox site, include:"}},"/set-up-community/configure-general-and-site-settings/configure-site-info":{"title":"Configure Site info","data":{"this-article-will-show-you-the-way-to-configure-your-site-info-such-as-site-title-site-copys-right-meta-keywordetc#This article will show you the way to configure your site info such as site title, site copy's right, meta keyword..etc.":"From your Admin dashboard, select Site Settings under the Setting tab from the left menuHere, add the following information about your MetaFox site:\nWebsite title\nSite Name\nCopyright\nMeta Keyword\nMeta Description\nOther site info fields.\nDon't forget to hit the Save Changes button to save your changes."}},"/set-up-community/configure-general-and-site-settings/set-up-firebase":{"title":"Set up Firebase","data":{"":"MetaFox uses Firebase to many functionalities, such Live Video, push notifications on mobile apps and web, crash analytics, etc.In this article, we will walk you through step by step to set up Google Firebase on MetaFox site.","create-a-firebase-project#Create a Firebase Project":"Go to the Firebase Console, and sign in with your Google account.\nClick on \"Add project\" to create a new Firebase project.\nFollow the on-screen instructions to set up your project.","obtain-configuration-for-web-app#Obtain Configuration for Web App ":"On the Dashboard of your Fireabase project, let's create a new Web App and follow the on-screen instructions to register the Web app.After registering Web app successfully, go to the Project Settings > General tab. Choose the Web App that you just created and obtain the Firebase configuration as belowThe Firebase configuration of your Web app will be as be belowWe are going to configure the Firebase configuration within MetaFox site.Let's log in to your MetaFox site with Admin user and go to AdminCP Dashboard > App Settings > FirebaseConfigure Firebase settings with the related values above as the screenshotClick the Save Changes button to apply the settings.","enable-firebase-cloud-messaging-fcm#Enable Firebase Cloud Messaging (FCM)":"In the Firebase Project Settings, navigate to the \"Cloud Messaging\" tab from the left sidebar. Then, follow the on-screen instructions to enable FCM","generate-service-account#Generate Service Account":"Now, in the Firebase Project Settings, navigate to the Service accounts tab and to generate New Private Key At this step, you can download the JSON file for the Service Account.","configure-service-account-in-metafox#Configure Service Account in MetaFox":"Let's get back to AdminCP Dashboard of your MetaFox site. Go to App Settings > Firebase > Import Settings pageUpload the JSON file obtained in the previous step. The Firebase configuration of Service Account will be updated automatically then.That's it! You've successfully set up Firebase on your MetaFox site."}},"/set-up-community/configure-general-and-site-settings/set-up-policy-terms-and-other-static-pages":{"title":"Set up policy terms and other static pages","data":{"":"This tutorial will show you how to find and edit the Term of Use & Privacy well as create a new static page*Find and edit the Term of Use & Privacy:This assumes you are already logged in as the Admin user and are logged into the AdminCP.From the **Admin Dashboard>Appearances>**Choose PagesIt will redirect you to the current Static Page items: Term of Uses & PrivacyOn the right side, you can see the field **Options>**Click on the gear to Edit the content for Term of Uses & Privacy or delete them*Create a new static page:Back to the Dashboard of the Static Page>Pages>Choose Add New PageThen, Fill in Slug, Tittle & Content for the new page. After that, hit the button Create to complete.Tip: It's always a good idea to clear your site's cache after adding anything."}},"/set-up-community/configure-general-and-site-settings/set-up-smtp-mail-settings":{"title":"Set up SMTP Mail settings","data":{"":"SMTP settings are particular protocol that works for outgoing messages. Most email software is designed to use SMTP for communication purposes when sending emails.We recommend not using the default PHP mail functions are usually marked as spam by popular email providers. You should send emails by using the email service of good providers via SMTP method. We recommend Sendgrid, Sparkpost or some other transactional mail service. This tutorial will show you how to set SMTP settings for your mail needs, whether using your server SMTP or transactional mail.From AdminCP > Settings > Mail. Go to the Mailer tab.There are many mailer options of popular mail service providers such as Mailgun, Postmark. In this tutorial, we will guide to to configure SMTP option which can be used for all mail service provider. Let's scroll down and choose the SMTP method, and fill in all of the fields from either the host SMTP or the Transactional Mail Service details.\nEnter the SMTP host and SMTP port. It is very important that you enter the correct port.\nSelect the cryptographic protocol that is enabled on your SMTP mail server.\nEnter the SMTP username and SMTP password.\nFill in your From and Email Address. Note that to keep things out of spam, the From and Email should be the same thing, both set to an email for the site. Anything other than a site email and you will wind up with many in spam.\nDon't forget to click on the Save Changes button to save your configurations.\nYou also can test whether your configurations work by entering a test email."}},"/set-up-community/configure-general-and-site-settings/setup-contact-us-form":{"title":"Setup Contact Us form","data":{"":"This is an essential feature to allow people to contact you in certain cases. Following this article's instructions, you will know how to set up the Contact Us form on your MetaFox site. Assume that your MetaFox site has been configured Mail settings.Now, you can go to AdminCP > App Settings > Contact. In this page, you can configure email addresses for staffs to receive notification emails when people use the Contact Us formClick Save Changes to save your config."}},"/set-up-community/configure-user-settings":{"title":"Configure User Settings","data":{"":"In this section, we are going to guide you to configure user settings, such custom fields, roles and permissions, etc."}},"/set-up-community/configure-user-settings/add-and-edit-custom-fields":{"title":"Add and edit Custom Fields","data":{"":"Custom fields in a user profile are additional data fields that you can add to a user's profile to store information beyond the standard set of user attributes, such as username, email address, and password. These custom fields allow you to collect, store, and display specific information about a user on your MetaFox site. MetaFox supports the custom group \"About\" and some certain custom fields by default and you can have a quick look on how custom fields are displayed on user profile below.In this article, we are going to walk you through step-by-step to create new custom groups as well as their custom fields. To explain you more conveniently, we will add a new custom group \"Working Info\" and a custom field \"Company Name\" into this group","add-new-custom-group#Add new custom group":"Let's log into AdminCP Dashboard and go to Members > Custom Fields > Manage Custom SectionIn this page, you will see the list of all available of custom groups. The About and Basic Information section group are added by default.Click on the Add Section button at the top menu bar, then fill info of new group into the form as below. Then click the Create button. You can see that a active custom group \"working\" is now created.","add-custom-fields-to-custom-section#Add custom fields to custom section":"Now, we will add a custom field \"Company Name\" info the custom group \"Working Info\" added in the previous step.Let's go to AdminCP > Members > Custom Fields > Add Custom Field page and fill the form as screenshot below.There are many supported options for Editing Component such as Radios, Checkbox, TextArea, etc. In this example, we choose using Text for users to input.Once completing the form, you can click on the Create button.Congratulation! You just finished adding a custom field into user profile. Users can fill the info when editing their profiles. The new custom field will display on the About tab of User Profile page now.","translate-phrases-of-custom-fields#Translate phrases of custom fields":"If your MetaFox site supports multi-languages, you can easily translate phrases of new add custom field as belowLet's go to AdminCP > Localization > Phrases. The translation keys associated with the label and description of your custom field \"companyname\" are:\nprofile::phrase.companyname_description\nprofile::phrase.companyname_label\nYou can add above keys and their phrases to the supported languages. Then click on Save Changes button.Now, clear the site cache and refresh the profile page(s) in that language,  you will see the label and description of custom field are translated accordingly."}},"/set-up-community/manage-apps":{"title":"Manage Apps","data":{}},"/set-up-community/configure-general-and-site-settings/set-up-google-api-key":{"title":"Set up Google API Key","data":{"":"An API key is a unique identifier. Each time that you use the Google Maps API or Google Youtube API, you must include a key, or other credentials, to validate your request.Google API key is a necessary component for several apps and pages to display content correctly and completely such as Maps, Places, Youtube, Date... This guide will instruct you on how to obtain and setup Google API key with all fundamental services.","create-google-app#Create Google App":"First of all, you need to create a Google app to generate the key.1/ Go to Google Console Page & Login into your Google account.https://console.cloud.google.com/apis/dashboard?project=php-app-9d6e62/ Select Create Project from Console Dashboard or Select projects menu, then click on the + symbol on the popup window to create a new project.3/ Enter the name for the new project, select your preference of email notification and lastly choose Yes to agree on Terms of Service >> Create.","enable-services-for-google-app#Enable Services for Google App":"From the project Dashboard, click on Go to APIs overview under API section.On the next page, choose Enable APIs and Services on top of the page.You will see the library of available services you can apply to your Google app. From here, you can find the services you want to enable in the list or Use the search box for quick reference.Next, we will guide you on how to enable a service, for instance, \"Google Calendar API\" which is vital for displaying dates and times on several components. \nType \"Google Calendar API\" into the search box, and select it from the result list.\n      2. Select Enable to activate this service. You successfully enabled the service for your Google app.You can enable these below services for your Google app to ensure all settings work and content displays correctly on your site.Map & Location services:\nGoogle Places API Web Service\nGoogle Maps Geocoding API\nGoogle Maps Geolocation API\nGoogle Maps JavaScript API\nGoogle Static Maps API\nYoutube services:\nYouTube Data API v3","generate-google-api-key-from-google-app#Generate Google API Key from Google App":"After enabling all necessary services, we need to generate the API key to use to setup in the phpFox setting.Go back to Dashboard and select Credentials from the left menu.Select Create credentials and choose API key from the drop-down list. A popup will show up with a generated API key of the app. You now have your Google API key, note this key down.","setup-google-api-key-for-metafox-settings#Setup Google API Key for MetaFox Settings":"As you just retrieved your Google API key, you need to set up and put it into your MetaFox settings.From AdminCP, type \"Google Map API Key\" to search in the settings box and select the result or go to AdminCP > Settings > Site SettingsEnter your Google Map API key to the setting  and Save Changes. You can do above step to search and configure the \"YouTube Data API Key\" setting with your Google API key.Congratulations, you just successfully set up Google API keys for your MetaFox site."}},"/set-up-community/manage-apps/purchase-apps":{"title":"Purchase apps","data":{"":"You will need to have a official MetaFox license to purchase appsAssume that you are holding a MetaFox license. This article will guide you on how to purchase apps, such as ChatPlus solution on the MetaFox Appstore in 2 ways: on MetaFox AppStore and in AdminCP of MetaFox site.In this section, we will walk you through step by step to purchase app in AdminCP. Assume that your MetaFox site has been set up with an official MetaFox license successfully.Now, you can log into your MetaFox site with Admin user and go to the AdminCP > Apps > Find More pageOn this page, you can search and then view the app you would like to purchase, such as ChatPlusIf your MetaFox site is compatible and eligible to purchase the app, the Purchase button is enabled (with blue color). You can click on Purchase button to process payment via Paypal.Once payment is made successfully, the app license will be added and associated with your MetaFox license automatically. You will verify your purchase in the AdminCP > Apps > Purchased page.Firstly, you will need to log into the MetaFox Appstore (https://appstore.phpfox.com) with the same credential on Client Area (https://clients.phpfox.com)After logging into MetaFox Appstore successfully, you can search and go to the app you would like to purchase.Click the blue Buy Now button on the top-right pricing box, you will go to the Checkout page as below. In this page, you can\nAdd Coupon code to apply discount if having any\nChoose MetaFox license that the app license will be associated to. You can use the Check License button to make sure that your MetaFox license is compatible with the app license.\nThen, you can click on Place Order button on the Checkout page to process payment with Paypal.Once payment is made, app license will be added and associated with your MetaFox license automatically."}},"/set-up-community/set-up-advertise":{"title":"Set up Advertise","data":{"":"This section will include articles to guide you in setting up the Advertise app on your MetaFox site."}},"/set-up-community/configure-general-and-site-settings/insert-external-scripts-into-header-and-body":{"title":"Insert external Scripts into header and body","data":{"":"Sometimes, you may want to add scripts into header or body section of all pages for either customization or Third-Party Integrations (like analytics tools, advertising networks, social media widgets, or chat plugins). This article will guide to step by step to add script onto the header section of  all pages of MetaFox siteLet's log into your MetaFox site with Admin user and go to AdminCP DashboardGo to Settings > Site Settings page, add external scripts to the appropriate settings based on your needs\nAppend Head Scripts : scripts will be inserted before the </head> tag of all pages in MetaFox site\nPrepend Body Scripts: scripts will be inserted right after the <body> tag of all pages\nAppend Body Scripts: scripts will be inserted right before the </body> tag of all pages\nHere is the sample of scripts of Google Tag Manager configured onto the MetaFox siteOnce all scripts are added and saved successfully, you can to apply changes."}},"/set-up-community/set-up-advertise/create-advertise-placements":{"title":"Create Advertise placements","data":{"":"Assume that you can install Advertise app and enable it on your MetaFox site. We will guide you in creating Ads placement that defines the price, pricing model (Pay per click, Cost per mile), and which roles can view ads of this placement.In this article, we will add an Ads placement on the Top Right Panel of the Home Feed page.Let's log into your MetaFox site with the Super Adminitrator or Admin user. Then, go to AdminCP > App Settings > Advertise > Create New Placement. Then, fill all the details of Ads Placement as below screenshot.We are configuring to charge users 1 EURO for 1000 views (CPM), and this Ads placement will be available for certain roles. You can let Viewable User Roles empty to make this ads placement available for all user roles.Now, go to the Home Feed page and enable Editor Mode. Choose Edit Page Content as we suppose to add an Advertise block to the Home Feed page only. If you would like to add a block into all pages, you can use Edit Site Content Click on the Plus icon on the subside section to add a block into this area, as we would like Ads to display on the Top Right panel of this page.On the Add Block form, search Advertise blocks and click Add Block buttonThen, you can configure the Advertise block as the blow screenshot. Note that at the Placements field, choose the placement option we just created above. Then, click Save Changes to add this block.The last step is we will save changes for Editor Mode and Publish Layout to rebuild the frontend web.Congratulation. We have done setup for a new Ads placement on the Home Feed. You can follow this procedure to add Ads placements for other pages of your MetaFox site."}},"/set-up-community/set-up-advertise/grant-user-permission-to-create-ads":{"title":"Grant user permission to create ads","data":{"":"This article will guide you to grant users permission to create ads on the MetaFox site. Assume that Advertise app has been installed correctly.Let's log into the AdminCP. Then go to App Settings > Advertise > PermissionsSelect the Role that you want to grant permission on Advertise app.In the image above, we have chosen the Registered User role. The permissions will be loaded for the chosen role automatically.There are many permissions of the Advertise app that you can check and grant appropriate ones for that role by toggling associated settingsOnce you have done configuration, click on Save Changes button at the bottom.Congratulation! You have granted permissions for a specific user role"}},"/set-up-community/set-up-chatplus-solution":{"title":"Set Up ChatPlus Solution","data":{"":"ChatPlus is the communication solution on phpFox sites with Advanced Messaging functionalities, fun reactions, voice messages, video calls and more. ChatPlus solution is supported on both web version and mobile apps. It brings more fun for users to interact together.The one-time price of this solution ($539) is for ChatPlus software and setup only. It doesn't include a monthly fee of infrastructure (server, service) to support this feature.ChatPlus solution includes 2 parts:\nChatPlus app is installed on your phpFox site. It provides front-end functionalities of Chatplus on the web version, APIs for mobile apps and communicates with Chatplus server. This app can be installed and upgraded within AdminCP as other apps on phpFox AppStore.\nChatPlus server is to process and store all chat/ discussions. It is necessary to note that video call processing is always an intensive-CPU task. To avoid a significant impact on performance on web and mobile apps when having too many video calls, the ChatPlus server should be installed on the different server on which the phpFox site is installed on. You can refer to the .","main-features-list#Main Features List":"Advanced Instant Messaging features:\nSupport Private Chat (between 2 users) or Group Chat (with many users). In the case of Group chat, users can join private groups (which require invitations) or public groups.\nSharing Photos, Videos, GIFs, Files, Emojis and Stickers on chat/discussion\nSupport send voice messages (on mobile apps only)\nAdding reactions to messages\nCall Features:\nSupport both audio and video calls.\nUsers can make Direction Call (02 members) and Conference Meetings (in Chat Group).\nBack-End: support many general settings and user group settings for AdminCP to configure ChatPlus. All settings will be synced to the ChatPlus server.\nManage Permissions area is to allow admin to configure if members could create a channel (chat group), a broadcast channel, a read-only channel as well as others.\nSettings\nConfigure and secure Chatplus and VoIP servers\nEnable Video/Audio Chat\nEnable Video/Audio Chat for the channel (chat group) \nPrivacy settings:\nFriend Only: Users can chat with their friends\nPublic Mode: Users can chat with all members\nConfiguration for push notification on mobile apps:\nFirebase/APN to push notification to Mobile device"}},"/set-up-community/set-up-chatplus-solution/set-up-chatgpt-bot":{"title":"Set up ChatGPT Bot","data":{"":"In this article, we are going to guide you how to set up ChatGPT Bot on your MetaFox site.","prerequisites#Prerequisites":"The ChatGPT Bot is currently supported for ChatPlus only. So you will need to purchase and install ChatPlus on your site first.\nOpenAI key is required to use APIs of OpenAI . OpenAI charges a fee for API usage. You should check their pricing first.","obtain-openai-key#Obtain OpenAI key":"Assume that you have registered your account at the OpenAI website at https://openai.com and subscribe an API plan that fits your needs successfully. Let's log in using your existing credentials.Now you can generate an API key. API keys are used to authenticate your requests to OpenAI's API.\nGo to your OpenAI account settings. You can usually find this by clicking on your account profile or settings icon.\nLook for the API Key section and click on \"Generate API Key\" or a similar button to create a new API key.\nOnce you've generated an API key, it's crucial to keep it secure. Treat your API key like a password and never share it publicly. You can use environment variables or other secure methods to store and access your API key in your applications.","configure-openai-key-and-enable-chatgpt-bot-on-metafox-site#Configure OpenAI key and Enable ChatGPT Bot on MetaFox site":"Assume that you can install the ChatGPT Bot app on your MetaFox site in AdminCPAfter installing this app successfully, go to AdminCP > App Settings > ChatGPT Bot > Settings pageConfigure setting of OpenAI API Key with the API key obtained above and then enable ChatGPT Bot as the screenshot.You can also configure either GPT-3.5 GPT-4 models as well as the bot's creative elements, from its style and tone to its visual presentationThen click Save Changes button.Now, ChatGPT Bot will display to users at the right-bottom corner of your site as below","train-your-chatgpt-bot#Train your ChatGPT Bot":"You may need to train your ChatGPT Bot for certain knowledge about your community. Let's go to AdminCP > App Settings > ChatGPT Bot > Chat Bots page. Then Edit the current ChatGPT botYou can configure the Knowledge Base setting for the knowledge you want to train your Chatbots. Then click Save Changes button."}},"/set-up-community/set-up-chatplus-solution/chatplus-server-requirements":{"title":"ChatPlus Server Requirements","data":{"":"ChatPlus server requires to be installed with Docker on dedicated server or VPS using Linux OS (such as Ubuntu, CentOS, Debian, etc). And, generally, the more powerful server is, the more users Chatplus can handle.Here is our recommendation for the server configuration for Chatplus:","for-chat-features#FOR CHAT FEATURES":"Minimal Server Requirements\n- Single core (2 GHz)\n- 1 GB RAM\n- 30 GB of SSD\nThe above minimal configuration is fine for small deployments of up to 200 users, up to 50 concurrently active and minimal level of mixed uploads, sharing, and chat activities.Recommended Server Requirements \n- Dual-core (2 GHz)\n- 2 GB RAM\n- 40 GB of SSD\nThe above configuration can accommodate small deployments of up to 500 users, up to 100 concurrently active and moderate levels of mixed uploads, sharing, and chat activities.","for-audiovideo-call-features#FOR AUDIO/VIDEO CALL FEATURES":"Recommended Server Requirements\n- Intel Xeon Platinum 8000 3.6 GHz x 4 core\n- RAM: 8 GB\n- Hardware basic: 250GB\n- Network bandwidth : Min 250 Mbb/sSystem requirement can serve 50 users with stream video, audio at the same time (default 720p)"}},"/set-up-community/set-up-chatplus-solution/set-up-chatplus-server":{"title":"Set up ChatPlus server","data":{"":"This article will guide you to set up ChatPlus on your server by yourself. In this article, we assume that you are already familiar with  Linux server management and docker, know how to use terminal, access SSH with root/super users privileges and set up necessary software such as Git, Docker, NginX/Apache as Reverse proxy, etc.If you aren't familiar with setting up ChatPlus server, please feel free to open ticket to request our support. You aren't charged any fee for the 1st setup.Firstly, you will need to install and run following software on your Linux server:\nDocker and Docker-compose\nNginX or Apache (as Reverse Proxy)\nGit\nThen, let's start setting up ChatPlus server","configure-subdomains-for-chatplus-server#Configure subdomains for ChatPlus server":"Create 2 different domains or subdomains for chat and call features, such as chat.yourdomain.com and voip.yourdomain.com\nConfigure these 2 domains/subdomains above with Reverse Proxy server (NginX or Apache) for Websocket.\nSet up SSL for domain/subdomain\nFor Chat domain/subdomain, configure to proxy requests to port 3000 (default Port of Chatplus), such as http://127.0.0.1:3000 . You can use another port for Chatplus, but will need to update this port into docker-compose.yml file and chatplus.env file for Chat as described later.\nFor Call domain/subdomain, configure to proxy requests to port 8443 (default port of Call feature), such as https://127.0.0.1:8443 .  You can use another port for Call feature but will need to follow guide to configure this port for Call/VoIP server as described later.","set-up-chat#Set up Chat":"Create main folder for Chat, such as at /var/www/chatplus/chat\nGo to the main folder for Chat, run following command to download the docker-compose.yml file and chatplus.env\nAfter the command runs completely, you will see that 2 files are downloaded into the folder: docker-compose.yaml and chatplus.env .\nIf you use another custom port instead of the default port 3000, you will need to update port custom port in the docker-compose.yaml\nOpen chatplus.env and update environment variables for Chat as below. Then, save it.","start-chat-server#Start Chat server":"Run following command to download/update docker images and run docker containers\nOnce Chatplus docker containers are running properly, you will check to see if the Setup page is working at https://chat.youdomain.com . However, you don't need to proceed with any setup steps there at this time. It will be done automatically while configuring in AdminCP of MetaFox site.","configure-chatplus-on-metafox-site#Configure ChatPlus on MetaFox site":"Install ChatPlus app in your AdminCP (After purchasing the Chatplus solution, you should see the ChatPlus app under AdminCP > Apps > Purchased. If the ChatPlus app isn't available there, please feel free to open a Support ticket in Client Area.)\nGo to the AdminCP > App Settings > ChatPlus page\nIn Settings, configure the following settings and save them:\nServer: it is the URL of domain/subdomain for chat. In our example, it is \"https://chat.yourdomain.com\". \nChatPlus Secret Code: configure the same string as configured for SECRET_CODE in chatplus.env file\nConfigure iOS settings for push notification on your iOS app such as iOS bundle ID, APN Key and APN Key ID, Apple Team ID.\nSelect Video Bridge Service: you can choose \"Free Video Bridge Service\" or \"phpFox Video Bridge Service\" for now. You can set up your self-host call service and configure all related settings later.\nWith Free Video Bridge Service, the Call will use free service for Jitsi Meet\nWith phpFox Video Bridge service, the service is provided by phpFox with limited usage.\nIn Sync Users, click on the Sync Users to sync users from MetaFox site to Chatplus manually. ChatPlus server will need to get details of existing users at the 1st setup time. New signup or changes on user details then will be synced automatically.","set-up-folders-and-environments-for-built-in-call-feature-optional#Set up folders and environments for built-in Call feature (Optional)":"Chatplus server supports and can use the default VoIP server of Jitsi to make voice/video calls. For better performance, please set up this separately with ChatPlus server. You can find the full guide hereOnce, Jitsi VoIP server is installed completely. You will need to update some configuration to update Jitsi branding with your own branding. Please replace the phrases with square blanket [] by respective value","enable-jitsi-jwt#Enable Jitsi JWT ":"To secure VoIP server to accept calls from your phpFox site only, you will need to enable Jitsi JWT as below:\nGo to voip_folder/.env and change all of these\nDelete folder ~/.jitsi-meet-config/ and restart VoIP docker again.\nAlso, you will need to enable JWT Authentication and configure same values of JWT_APP_ID and JWT_APP_SECRET in the AdminCP > Apps > ChatPlus > Settings page","change-default-jitsi-web-configs#Change default Jitsi web configs":"Go to ~/.jitsi-meet-config/web and change these in file interface_config.js :","update-jitsi-web-imageslogos#Update Jitsi web images/logos":"Run \"docker ps\" to get the running container ID of jiti-web.\nAccess docker container of jiti-web service :\nGo to directory:\nReplace any image/logs you want to:\nwatermark.png -> watermark image when user is in call/voice if flag SHOW_JITSI_WATERMARK is true\nlogo-deep-linking.png -> image at on top when deep linking page is showed (No mobile app installed) when flag MOBILE_APP_PROMO is true\njitsiLogo.png, JitsiLogo_square.png"}},"/set-up-community/manage-apps/install-and-uninstall-apps":{"title":"Install and Uninstall apps","data":{"":"This guide aims to assist you in the process of installing apps in the AdminCP of your MetaFox site. Apps can enhance your platform's functionality, and this guide will ensure that you can install them effortlessly.","prerequisites#Prerequisites":"Before proceeding, ensure that you have administrative access to the MetaFox site and you have already purchased the app licenses on the Appstore.","installre-install-an-app#Install/Re-install an app":"Let's log into AdminCP > Apps > Purchased . In this pages, all apps you have purchased will be displayed as belowNow, click on the app you want to install. For instance, we will try to install/reinstall the ChatPlus app in this guide, so we will click on the ChatPlus item to go to the App Details pageClick on the Install/Reinstall button to starting installing the ChatPlus app. You will need to wait for the installation to complete.During the installation, the site will send build request to MetaFox Build service to build frontend web with the new app. Thus, it may take a few minutes for the app to display on the frontend.After installing successfully, you can reload the AdminCP and start configuring app as your need by going to AdminCP > App Settings, search the newly installed app and accessing its settings","managing-installed-apps#Managing Installed Apps":"","viewing-installed-apps#Viewing Installed Apps":"Navigate to the AdminCP > Apps > Installed. Here, you can see a list of all installed apps on your site.","disabling-or-enabling-apps#Disabling or Enabling Apps":"Toggle the app's Is Active to \"Disable\" or \"Enable\" as required.\nDisabled apps won't function until re-enabled.\nSome apps are mandatory and cannot be inactive","uninstallapps#Uninstall Apps":"You can uninstall the inactive apps by going to the AdminCP > Apps > Installed. Then, click the Uninstall option and follow the prompts to complete the uninstallation process."}},"/set-up-community/set-up-chatplus-solution/set-up-reverse-proxy-with-nginx":{"title":"Set up reverse proxy with NginX","data":{"":"Assume that you would like to set up Chatplus with 2 subdomains chat.yourdomain.com and voip.yourdomain.com . Here are NginX configurations for ChatPlus:","chat#Chat":"","video-bridge#Video Bridge":""}},"/set-up-community/set-up-chatplus-solution/update-chatplus-server":{"title":"Update ChatPlus server","data":{"":"This guide will guide you to update ChatPlus server. Assume that ChatPlus server has been set up at */var/www/chatplus/chat* on your server. Let's log into your server with the SSH root account and run the following commands to update the ChatPlus serverCongratulation. You have just updated ChatPlus server!"}},"/set-up-community/set-up-languages":{"title":"Set up Languages","data":{"":"Basically, MetaFox will automatically check and prioritize to use language in the following order:\nPrimary Language configured by users in the Account Settings section\nLanguage chosen at the Login/Signup form\nPreferred language configured on the current browser\nDefaul language configured in AdminCP\nNow, we are going to walk you through topics to set up and edit languages on MetaFox"}},"/set-up-community/set-up-languages/edit-language-phrase-in-admincp":{"title":"Edit language phrase in AdminCP","data":{"":"This article will guide to edit or translate a language phrase of a certain language in AdminCPLet's log into the AdminCP. Then, go to Localization > Phrases.Search for the phrase you want to edit/translate. Please use some search options to help you filter phrases quickly. Then, click on the Option icon of that phrase, choose Edit option to editEdit text on the popup. But please don't modify the variables (which are between the brackets symbols) since their values will be replaced dynamically when rendering.After completing your modification, click Save Changes button to update the phrase.Last, you can  to apply changes of the phrase."}},"/set-up-community/set-up-languages/export-phrases-into-csv-file":{"title":"Export phrases into CSV file","data":{"":"This article will guide you to export phrases into CSV files so you can edit/translate all phrases more conveniently with your prefer editor toolLet's log into AdminCP. Then, go to Localization > Languages.Click on the Option icon > Export phrases option as belowChoose the location and save the CSV file onto your machine. Now you can use editor supporting CSV format to edit/translate phrases on your local machine."}},"/set-up-community/set-up-languages/create-a-new-language":{"title":"Create a new language","data":{"":"In this article, we will guide to to create new language on MetaFox site. By default, MetaFox supports only English language pack. You can add many other languages to your site and translate phrases with following steps:Log into AdminCP of your MetaFox site. Then, go to Localization > LanguaguesClick to Create New Language link on the top menu barOn the Create New Language form, fill the info as below:\nLanguage Name: Name of language will display to users\nLanguage Code: This is a two-letter language code, refers to https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes. \nVendor: fill any name you want. The vendor name should be unique if you would like to publish your language packs on Appstore for sale in future\nRoot language: choose the language to copy its phrases to this new language\nOnce all details are filled, you can click the Create button to create a new language.Congratulation, you just created a new language successfully.Now, you can start translating phrases of the new language in 2 ways:\nand translate them. Then, into that language.\none by one in the AdminCP"}},"/set-up-community/set-up-languages/import-phrases-from-csv-file":{"title":"Import phrases from CSV file","data":{"":"Assume you have and done all modifications/translations on phrases of a specific language on your local machine. We will guide you to import phrases into the language. After importing, all phrases in your CSV file will be updated to the language.Now, let's log into AdminCP. Then, go to Localization > LanguagesClick on the Option icon of the language you want to import phrases to. Then, select the Import phrases.On the popup, select the CSV file on your local machineClick Upload button to start uploading CSV file. Phrases will be imported automatically when the upload is done.to apply changes of phrasesCongratulation! You can import successfully phrases from the CSV file now."}},"/set-up-community/set-up-live-streaming-solution/live-streaming-how-to-go-live-with-obs-software":{"title":"Live Streaming - How to go live with OBS Software","data":{"":"OBS Studio (formerly Open Broadcaster Software or OBS, for short) is a free and open source software for video recording and live streaming and in this walk-through we'll introduce you about how to setup and go live with OBS.In order to start Livestreaming on the website with OBS. First of all, you need to install a streaming software into your desktop/personal computer. There is a lot of free Streaming software on the internet, however, you can search for \"OBS Studio\", then download and install it in your desktop/PC. You can also refer this link: https://obsproject.com/ to download OBS Studio.After successfully installing Streaming software (OBS studio) into your desktop/PC, then from your  MetaFox website, press Go live Copy them.Copy the info of Stream Key + Server URL on the formNext, Open OBS Software on your PC and go to Settings > Stream \\Add the Stream Key + Server URL that you got before. Then press OK to save the Settings.]Press Start Streaming from OBS.After that, please go back to MetaFox site and wait for the connection between the broadcast software and your MetaFox site, then click \"Go Live\" button to start streaming.Note: This guideline is applied for live streaming by using OBS Studio, for other software, you can configure similar."}},"/set-up-community/set-up-live-streaming-solution":{"title":"Set Up Live Streaming Solution","data":{"":"Live Streaming lets users instantly share their moments through live videos and connect with their audience from anywhere. Whether you want to host talk sessions, webinars, live events, or showcase your products/services, Live Streaming has got you covered. This solution comes equipped with features like notifications for new live videos, real-time reactions, comments, and stickers for the best community engagement. Expand your reach and boost your views through live videos!","key-features#Key Features":"Live streaming from PC or mobile apps\nChat and comments throughout the live streams\nReactions on live streams\nWatch all the live-streaming videos again\nIn this section, we will guide to to set up Live Streaming with on MetaFox site"}},"/set-up-community/set-up-live-streaming-solution/live-streaming-infrastructure-requirements":{"title":"Live Streaming - Infrastructure Requirements","data":{"":"To operate the Live Streaming solution, on top of a one-time payment for this solution, you will need to pay a monthly fee for infrastructure and external services such as storage, video live encoding, and streaming.The monthly cost is based on the following factors:\nThe monthly live streaming videos\nDuration of an average live stream\nMonthly live stream view count\nHow long does the average viewer watch\nTo help you control your budget more conveniently, we can give you some estimation in some certain cases:The monthly live streaming videos100500100010001000100010001000Duration of an average live stream (in minutes)44444102020Monthly live stream view count10,00010,00010,00075,00075,00075,00075,00075000How long does the average viewer watch?30%30%30%30%50%50%50%90%Rough estimation for a monthly cost$50$160$300$410$490$1,200$2,450$3,200If you have any questions for other cases, please feel free to contact us via Ticket System."}},"/set-up-community/set-up-live-streaming-solution/live-streaming-set-up-mux":{"title":"Live Streaming - Set up Mux","data":{"":"This guide will walk you through the step-by-step process of setting up Mux and configure Live Video app on the MetaFox site to enable Live Streaming feature.","create-a-mux-account-and-configure-mux#Create a Mux Account and configure Mux":"If you haven't already, sign up for a Mux account at https://mux.com/. Mux provides powerful video processing capabilities, including adaptive streaming and analytics.After registering Mux account successfully, you will need to set up Mux to get Access Token (Client ID and Client Secret ) and Webhook SecretSet up Access TokenOnce registered, log in to your Mux dashboard.Navigate to \"Settings\": In your Mux dashboard, locate and click on the \"Settings\" option, typically found in the top-right corner of the page.Choose the Access Tokens menu or within the \"Settings\" section, select \"Access Tokens.\" Here, you can manage your API tokens.Click on the \"Create New Token\" button to generate a new Access Token. Provide a descriptive name for the token, and you can also assign permissions to control API access as below. Then click \"Create\" to generate the Access Token.Once the Access Token is generated, copy it immediately and store it securely in a safe location. This Access Token is essential for authenticating requests of your MetaFox site to the Mux API.Setting Up Mux WebhookIn your Mux dashboard, go to the \"Settings\" section.Within the \"Settings\" section, select \"Webhooks.\" This is where you'll set up and manage your Webhooks.Click on the \"Create New Webhook\" button to set up a new webhook. You'll need to provide specific details about the webhook.Enter the URL where you want to receive the webhook notifications in the \"URL to notify\" field. Please fill the URL https://yourdomain.com/api/v1/live-video/callback/mux . You need to replace the yourdomain.com part the URL with the proper domain of your MetaFox siteAfter configuring the webhook details, click \"Create Webhook.\".Then you can click on the Show Signing Secret of the created webhook item to get the detailed signing secret. Copy and store it for later usageYou have set up your Mux account successfully. Now we can move to the next step to configure the Mux service on your MetaFox site.","configure-mux-service-on-live-videos-app#Configure Mux service on Live Videos app":"Assume that you could install Live Video app onto your MetaFox site successfully.Go to AdminCP Dashboard > App Settings > Live Video > Streaming Services. Then choose Mux item as belowFill in the settings with the proper values you have when setting up your Mux account. Then save changes.Go to the Settings section by clicking on the Settings top menu. Choose the Mux option for the Streaming Service setting and save changes as below screenshot.Congratulations! You have successfully set up the Live Video functionality using Mux."}},"/set-up-community/set-up-payment-gateways":{"title":"Set up payment gateways","data":{"":"Payment Gateway feature is a Core component of online transactions used in many Monetization features of MetaFox apps, such as Subscriptions, Activity Points, Marketplace, etc. Its main functionality is to securely and efficiently facilitate the transfer of payment information between a web browser/device and merchant's payment processor/bank. The Core Payment Gateway feature is supported by many phpFox payment gateway extensions such as Paypal, Apple Pay, Google Pay. It has been designed to be easily extendable with many other payment gateways via 3rd-party apps.This section will walk you through the process of setting up various payment gateways on your MetaFox platform. Our platform offers flexibility by supporting multiple payment gateways, allowing you to provide your users with convenient and secure payment options for their transactions, such as purchasing marketplace items, subscription plans, etc."}},"/set-up-community/set-up-payment-gateways/set-up-apple-pay":{"title":"Set up Apple Pay","data":{"":"This guide aims to assist you in seamlessly integrating Apple Pay as a payment method on your MetaFox platform. With Apple Pay, your users can make secure transactions using their Apple devices, enhancing their payment experience.Assume that you have installed the Apple Pay app on your MetaFox successfully. You may want to refer the for app if needed.Let's go to AdminCP > App Settings > Payment. You will see the Apple Pay item listed as belowEdit the Apple Pay and choose a payment processor you want to use with Apple Pay. You will need to make sure that the chosen Payment Processor has been set up properly. You can refer to the guide for more detail.Then, Check the Active checkbox and save changes to complete the set up for Apple Pay.Congratulations. You have done the setup for Apple Pay on MetaFox site!"}},"/set-up-community/set-up-live-streaming-solution/live-streaming-set-up-transcoder-server-for-live-videos-with-webcam":{"title":"Live Streaming - Set up transcoder server for live videos with webcam","data":{"":"Livestream (Live Video) has the feature to live from directly built-in devices on your computer without the streaming software's support. Furthermore, this new feature still leverages Mux and its features to provide a smooth experience for users. In this article, we will guide you to set up the transcoder server to enable this feature.","requirements#Requirements":"Dedicated server/VPS/cloud server for transcoder server\nAt least 8G RAM, 4 vCPUs\nLive Video app version 5.1 or later.","transcoder-server-setup#Transcoder server setup":"Firstly, the transcoder server had been built and pushed to DockerHub at https://hub.docker.com/r/foxsystem/metafox-transcoder-livevideo. Therefore, you can update docker-compose.yml to have a new service - \"transcoder\" as below. \ndocker-compose.ymlMoreover, to make the server operate correctly, you also have to update your .env to adapt a few variables that the server needs\n.envGiven that,\nWS_PORT and WS_EXTERNAL_PORT: defining the internal and external WebSocket server ports.  \nNODE_ENV: configures running mode for better performance.\nJWT_SECRET: is the key used for signing and verifying JSON Web Tokens (JWTs). You can set to any random string.\nMFOX_BASE_API_URL: specifies the API URL of MetaFox.\nFinally, you can just restart the docker to apply new service by using command","proxy-setup-optional#Proxy Setup (Optional)":"You can set up web server (NginX/Apache) to proxy to transcoder service with certain domain. Here is the sample Nginx configuration to for transcoder with domain demo-transcoder.metafox.app","configure-metafox#Configure MetaFox":"Now, let's go to AdminCP of MetaFox to configure Live Video with the transcoder server. Visit AdminCP > App Settings > Live Videos > Settings and configure two settings: Allow Webcam Streaming and Transcoder Server Url (see in image below).Given that,\nAllow Webcam Streaming: turn on if you want to allow streaming using webcam.\nTranscoder Server Url: the URL of transcoder webserver."}},"/set-up-community/set-up-payment-gateways/set-up-google-pay":{"title":"Set up Google Pay","data":{"":"This guide aims to assist you in seamlessly integrating Google Pay as a payment method on your MetaFox platform. With Google Pay, your users can make secure transactions using their Android devices, enhancing their payment experience.Assume that you have installed the Google Pay app on your MetaFox successfully. You may want to refer the for app if needed.Let's go to AdminCP > App Settings > Payment. You will see the Google Pay item listed as belowEdit the Google Pay and choose a payment processor you want to use with Google Pay. You will need to make sure that the chosen Payment Processor has been set up properly. You can refer to the guide for more detail.Then, Check the Active checkbox and save changes to complete the set up for Google Pay.Congratulations. You have done the setup for Google Pay on MetaFox site!"}},"/set-up-community/set-up-payment-gateways/set-up-payment-processor":{"title":"Set up payment processor","data":{"":"This guide aims to assist you in setting up Stripe as the payment processor for Apple Pay on your MetaFox platform. Stripe offers a robust payment processing solution that integrates seamlessly with Apple Pay, providing a streamlined transaction experience for your users.","benefits-of-stripe-payment-processor#Benefits of Stripe Payment Processor":"Secure payment processing with industry-standard security features.","prerequisites#Prerequisites":"Before proceeding, you will also need to create an active Stripe Account. You will need to create and verify an active Stripe account to enable payment processing.","set-up-stripe-account#Set up Stripe account":"Once you have an active Stripe account, you will need to:\nEnable Apple Pay for Stripe if you intend to use Stripe with Apple Pay\nEnable Google Pay for Stripe if you intend to use Stripe with Google Pay\nGet the Public Key and Secret Key \nSave these keys to configure payment processor on MetaFox site later.\nAdd a webhook with as below:\nUse the Endpoint URL https://yourdomain.com/api/v1/payment-processor/callback/stripe . You need to replace the yourdomain.com with the actual domain of your MetaFox site.\nEnable following Stripe events: Payment Intent, Customer, Invoice.\nRetrieve your webhook's secret from Stripe Dashboard’s - Webhooks settings, select webhook, and obtain the secret to configure on the MetaFox site later.\nNow, you have done setup your Stripe account. Let's configure payment processor to integrate with your Stripe account","configure-stripe-payment-processor-on-metafox#Configure Stripe payment processor on MetaFox":"Log into AdminCP and go to App Settings > Payment. Then edit the Apple Pay.In the Edit popup, you can click on the Click here to setup Payment Processor link to go to the Manage Processors page. This page will list all supported payment processors on MetaFox. Click on the Edit option of the Stripe item as belowFill in all settings of Public Key, Secret Key and Webhook Secret that you got in the previous step. Make sure that the Active checkbox is checked also.Then, save changes.Congratulation! You have completed the setup of the payment processor for Stripe."}},"/set-up-community/set-up-payment-gateways/set-up-nowpayments-gateway":{"title":"Set up NOWPayments gateway","data":{"":"This guide will walk you through the process of integrating NOWPayments gateway as a payment method, enabling smooth and secure transactions.","prerequisites#Prerequisites":"Before proceeding, you will also need to create a NOWPayments (https://nowpayments.io) account and install the NOWPayments app on your MetaFox site.","configure-nowpayments-in-metafox-admincp#Configure NOWPayments in MetaFox AdminCP":"Log into your site with Admin user and go to AdminCP > App Settings > Payment > Gateways. Then Edit the NOWPayments option.On the Edit form, configure fields as below\nTitle: the gateway title shown to end-users. This can be freely configured according to your preferences.\nAPI Key: must be configured after generating API credentials on NOWPayments. Please visit the following URLs to obtain your API key\nProduction: https://account.nowpayments.io/store-settings#keys\nSandbox: https://account-sandbox.nowpayments.io/store-settings#keys\nIPN Secret: must be configured to verify IPN callbacks sent by the gateway, preventing frauds. The IPN secret is available after configuring Instant Payment Notifications on NOWPayments. \nProduction: https://account.nowpayments.io/store-settings#notifications\nSandbox: https://account-sandbox.nowpayments.io/store-settings#notifications\nThe IPN handler should be pointed to https://YOUR_DOMAIN/api/v1/nowpayments/notify \nActive: Check to enable the gateway to allow end-users to make payments using NOWPayments.\nTest Mode: Check to enable test mode (sandbox) to fully test the workflow without affecting real balances.\nEnsure that you have configured the correct API and IPN credentials according to  your preferences.","references#REFERENCES":"Integration Guide: https://nowpayments.io/blog/integration-guide \nAPI Key: https://nowpayments.io/help/dashboard/how-to-create-an-api-key \nIPN: https://nowpayments.io/help/what-is/what-is-ipn \nTest Mode (sandbox): https://nowpayments.io/blog/how-to-use-the-sandbox-a-guide"}},"/set-up-community/set-up-payment-gateways/set-up-payment-with-e-wallet":{"title":"Set up payment with E-Wallet","data":{"":"In MetaFox, users can make payments with money in their E-Wallet to purchase listing items, subscription plan, activity points. This guide will guide you how to enable payment option with E-Wallet on your MetaFox siteLet's log into the AdminCP Dashboard. Then go the App Settings > Payments and activate E-Wallet option as the below screenshotThe setup is done. Now you will see the E-Wall option showing up when making payments as below.Note that if your site supports multiple currencies and want to allow users to purchase with currencies different from USD, you will need to set up and enable Exchange Rates in App Settings > E-Wallet > Exchange Rates page."}},"/set-up-community/set-up-payment-gateways/set-up-paypal-gateway":{"title":"Set up Paypal gateway","data":{"":"This guide will walk you through the process of integrating PayPal as a payment method, enabling smooth and secure transactions.","prerequisites#Prerequisites":"Before proceeding, you will also need to create a PayPal Business Account.","creating-a-paypal-business-account#Creating a PayPal Business Account":"","registering-for-a-paypal-business-account#Registering for a PayPal Business Account":"Visit the PayPal website.\nSign up for a PayPal Business Account using your email address.\nFollow the prompts to provide necessary information and verify your account.\nYou will have to follow PayPal's verification process, which may include linking your bank account and confirming your identity.","get-paypal-client-id-and-client-secret#Get Paypal Client ID and Client Secret":"PayPal integrations use a client ID and client secret to authenticate API calls:\nA client ID identifies an app. \nA client secret authenticates a client ID so you will need to keep this secret safe.\nHere's how to get your client ID and client secret:\nSelect Log in to Dashboard and log in or sign up.\nSelect Apps & Credentials.\nNew accounts come with a Default Application in the REST API apps section. To create a new project, select Create App with the type of Merchant.\nCopy the Client ID and Client Secret to configure in MetaFox site in the next step\nAfter creating app successfully, in the App Details page, you can add Webhook with URL https://yourdomain.com/api/v1/paypal/notify (replace yourdomain.com with your actual domain) and check All Events option as shown below screenshot.Click Save button on the Add Webhook popup to complete the setup at Paypal's end. You can get the Webhook ID as below. You need to save this value to configure in MetaFox site later.","configuring-paypal-integration-in-metafox#Configuring PayPal Integration in MetaFox":"Log in to the AdminCP of your MetaFox platform using your admin credentials and go to App Settings > Payments. Then click on Edit option of Paypal item as belowOn the Edit Gateway popup you can fill in 2 settings of Client ID, Client Secret and Webhook ID that you got above. Then save changes.","enabling-sandbox-mode#Enabling Sandbox Mode":"To testing payments, you can set up Paypal with Sandbox mode as below\nIn Paypal Developer Dasboard, switch to the Sandbox mode and then create Paypal app\nConfigure corresponding Client ID and Client Secret of the Sandbox app for Paypal gateway\nEnable Test Mode setting"}},"/set-up-community/set-up-social-connect":{"title":"Set up Social Connect","data":{"":"Social Connect is a safe, fast, and easy way to log in by using existing accounts from Facebook, Google, etc. With Social Connect, saving time to sign up and securing passwords will make your website more friendly, professional, and interactive. Social Connect helps you reduce customer care and password recovery cost and achieve greater customer satisfaction by eliminating the frustration associated with user forgetting login credentials (usernames and passwords).In this section, we will guide you to set up Social Login with Facebook, Google, and Apple"}},"/set-up-community/set-up-social-connect/set-up-facebook-login":{"title":"Set up Facebook Login","data":{"":"Since Facebook is one of the largest and most popular social network sites for the publicity, many people would like to use their Facebook accounts to join to other networks. By using Facebook Connect app, your users can join your community conveniently by logging in with their Facebook account.This guide will instruct you to set up the Facebook login for your site using Facebook Connect.","create-a-facebook-application#Create a Facebook Application":"Go to Facebook Developers page and Login to your Facebook account.\nFrom header menu, select My App , then Create app \nEnter the Display Name and Contact Email for your app and click on Create App ID to create your app. You might need to enter the captcha to verify.\nChoose Settings from the left menu >> Basic content will appear on the right.\nOn Setting content, you will see App ID. Click on Show button to reveal App Secret. Now you already have both App ID & App Secret to use with Facebook Connect app. However, you need to configure your Facebook app a bit more to make it fully work.Choose Settings from the left menu and select Basic. Enter your website URL , App Domains,  Contact email and hit Save changes \nScrolling down, select Add Platform and choose Website from the list on the popup.\nNew Website field shows up below after select Website platform. Enter your Site URL in this field then Save changes\nOn the top panel, switch to Live for App Mode to make your app work with normal user.\nFrom Product > click on Add product, choose Facebook loginOn the next page, select Settings under the Facebook login, set settings as shown in the below screenshotIn Products > Choose Settings under Facebook Login (You might need to add Facebook Login section before proceeding).Choose the settings as instructed in the below image.Input your Site Domains into Allowed Domains for the JavaScript SDK field.","request-required-permissions-for-facebook-login#Request required permissions for Facebook Login":"Facebook Login requires 2 permissions with access level of Advanced Access: public_profile and emailAt this step, you can go to the App Review > Permissions and Features, search 2 permissions of public_profile and email then request for Advanced access as the belowYou will need to follow Facebook guide and provide necessary info if needed to complete the permission requests.Now you finish setup your Facebook app. Go back to Dashboard and note down App ID & App Secret of your Facebook app. We need these 2 information for next step.","set-up-facebook-app-on-metafox-site#Set up Facebook App on MetaFox site":"Let's log into your MetaFox site with Admin user and go to AdminCP, go to App Settings > Social Connect > FacebookFrom here you can see following settings:\nEnable Facebook Login: Enable/disable login via the Facebook account. We choose to Enable in this case to enable Facebook login.\nClient ID: Enter here your App ID of the Facebook app.\nClient Secret: Enter here App Secret of the Facebook app.\nSelect Save Changes to save the settings. You have successfully setup for Facebook login."}},"/set-up-community/set-up-social-connect/set-up-login-with-google":{"title":"Set up Login with Google","data":{"":"The \"Login with Google\" feature offers a convenient way for users to access your platform using their Google credentials. To enable this feature, you'll need to obtain a Client ID and Client Secret from the Google API Console. This article serves as a comprehensive guide to help you navigate the process step by step.Create a Project in Google API ConsoleLog in to the Google API Console: Go to the Google API Console, sign in with your Google account. Then create  and select your new project.Create CredentialsNavigate to \"Credentials\": From the sidebar, select \"Credentials.\" Click on the \"Create Credentials\" button and choose \"OAuth client ID.\"Select \"Web application\" as the application type.Configure Authorized Redirect URIs and Authoriszed Javascript Origins: Enter the redirect URIs where users will be sent after granting permissions. This is usually the URL of your MetaFox site as the screenshot but with your proper domainStep 4: Obtain Client ID and Client SecretAccess Your Credentials: Under \"Credentials,\" you'll find a list of your credentials. Locate the newly created OAuth client ID and click on it. Find Client ID and Client Secret: Here, you'll find your Client ID and Client Secret.These are essential for integrating the \"Login with Google\" feature into your application.Integrate Client ID and Client Secret in MetaFox siteLog into AdminCP of your MetaFox site. Then go to App Settings > Social Connect . Select Google menu on the top and configure the obtained Client ID and Client Secret. Don't forget to enable the \"Enable Google Login\" checkboxCongratulation! The setup for Login with Google was done now. The Google Login button will be displayed on the Login and Signup form."}},"/set-up-community/set-up-social-connect/set-up-login-with-tiktok":{"title":"Set up Login with Tiktok","data":{"":"In this article, we are going to guide you to set up Login with Tiktok on MetaFox site with following steps:\nObtain Ticket API Key and Secret Key\nConfigure Login with Tiktok on MetaFox","obtain-ticket-api-client-key-and-secret-key#Obtain Ticket API Client Key and Secret Key":"You will need to have Tiktok Developer account to get API Client Key and Client Secret key. If you haven't got one yet, please register your account at Tiktok Developer page (https://developers.tiktok.com/).Now, log into Tiktok Developer with your credentials. Then go to the Manage Apps section at https://developers.tiktok.com/apps/ Click Connect An App button and follow the guide to create your app to use for Login with Tiktok.At this step, you will need to fill all required details of your app and submit for review to get approval.Once the app is created successfully and approved, you can obtain the Client Key and Client Secret in the App Details page. We will configure these values in MetaFox to enable Login with Tiktok then.Now, we will add 2 products within Tiktok App: Login Kit and ScopesThen, configure the Web Redirect URI of Login Kit and the user.info.basic of Scopes as the screenshot","configure-login-with-tiktok-on-metafox#Configure Login with Tiktok on MetaFox":"Now, let's log into AdminCP Dashboard and go to App Settings > Social Connect > Tiktok page.In this page, you can configure Client Key and Client Secret key that you have obtained in the previous step. And use your site URL as the Redirect URL as the below screenshotClick Save Changes button to complete the setup for Login with Tiktok. The Login option with Tiktok is now available on the Signup form as below"}},"/set-up-community/set-up-storage":{"title":"Set up Storage","data":{"":"MetaFox supports many popular storage systems to contain user files. In this section, you'll discover how to configure and optimize your media storage spaces for photos, videos, and music. Tailoring your storage settings ensures efficient organization, easy access, and a seamless media experience within your platform."}},"/set-up-community/set-up-storage/set-up-different-storage-system-for-user-files":{"title":"Set up different storage system for user files","data":{"":"Assume that you are having some external storage systems, such as Amazon S3 and Digital Ocean Spaces, etc along with local storage of server disk. MetaFox supports to set up different storages for file types (musics, videos, photos, etc.). For example, you can set up to store videos on Amazon S3, music on Digital Ocean Spaces while others are stored on the local server. The detailed guide on how to set up storage systems, such as Amazon S3, etc. will be in other topics.In this article, we assume that the configurations of Storages have been set up properly and this article will walk you through step-by-step guide to configure those storages to store corresponding user files.Let's log into AdminCP. Then go to Settings > Storage . Then choose the Storages menu as belowIn the storage files, you will see the list of many item types and default local storage will be used for themNow, we will configure to store video files on the Amazon S3 which has been set up with configuration s3. Then save it.Done. You just completed the configuration to store videos on Amazon S3. As of now, new videos uploaded will be stored on the Amazon S3."}},"/set-up-community/set-up-storage/set-up-storage-with-amazon-s3":{"title":"Set up Storage with Amazon S3","data":{"":"Amazon S3 (Simple Storage Service) offers secure and scalable cloud storage solutions for your media files, ensuring reliability and accessibility. Follow these steps to seamlessly integrate Amazon S3 storage into MetaFoxSet Up Amazon S3 BucketYou can refer to the Amazon S3 User Guide for a detailed guide on this service. Generally, setting up an Amazon S3 bucket includes following steps:\nLog into Amazon Web Services (AWS) Console with your AWS account using your credentials. From the AWS Management Console, navigate to the Amazon S3 service.\nClick the \"Create bucket\" button to initiate the bucket creation process.\nChoose a unique bucket name and select the region closest to your target audience.\nSet bucket properties, such as logging, versioning, and tags, based on your requirements.\nTurn Block all public access setting off\nDefine bucket-level permissions using Access Control List (ACL). Decide who can read and write data to the bucket.\nCreate a bucket policy to control access on a granular level. Assign permissions to users, groups, or even specific IP addresses.\nSet Up User CredentialsNavigate to AWS Identity and Access Management (IAM) and create a new user with permissions to access the above Amazon S3 bucket. Please refer to Amazon IAM User Guide if needed.\nOnce user is created, obtain the access key and secret for the user. Ensure that these credentials are securely stored. We will use them to configure in MetaFox site then.\nConfigure S3 on MetaFoxLet's log into AdminCP of your MetaFox site. Then go to Settings > Storage > ConfigurationsThere are some storage configurations in this page.You can edit the existing S3 configuration or create a new configuration of S3 storage if needed.You will need to fill in the Edit/Create form at least all required fields (Access Key, Secret Key, Bucket and Region) that you have obtained above. Then click the Save Changes button.Congratulation! You just completed the setup for Amazon S3 on MetaFox site. You can"}},"/set-up-community/set-up-subscription/create-subscription-packages":{"title":"Create Subscription packages","data":{"":"This guide will walk you through step by step to set up subscription packages on MetaFox site. Assume that the Subscription app has been installed successfully on your MetaFox site.Let's log into your MetaFox site with the Admin user. Then go to AdminCP > App Settings > Subscription . Click on the Create New Package link.In the Create New Package form, you will need to fill in details of the Subscription package as below:\nTitle: The name of your Subscription package\nDescription: Explanation about the subscription package\nUser Role on Success: Select a certain role that users will be assigned to when using this Subscription package.\nAvailable For User Roles: select roles whose users can see and purchase this new subscription package\nEnable on Registration: Check to allow this subscription package on the Registration form\nActive: Check to make this subscription package active. Inactive packages won't be displayed to users.\nPackage that this package can be upgraded to: (optional) Choose other subscription packages that the user using this subscription package can be upgraded to\nFree package? : Check if this subscription package is free\nPrice: If package isn't free, configure its prices with available currencies\nRecurring package: Check if this subscription package is a recurring plan.\nRenew type: Automatically or Manually\nRecurring period\nRecurring price\nNumber of days to notify users before subscription expiry\nOnce all details have been filled in, click the Create button to complete the Create procedure for the Subscription package.You will see your new subscription package in the AdminCP > App Settings > Subscription > Manage Packages page.You can go ahead to create all necessary Subscription packages of your community.","enable-subscription-packages-for-users-to-purchase#Enable Subscription packages for users to purchase":"After adding subscription packages, you will need to enable Subscription package on frontend by enabling the Enable Subscription package setting in AdminCP > App Settings > Subscription > SettingsThen, your active subscription packages will be displayed to user on the frontend as belowThat's all. You just completed the setup for Subscription packages."}},"/set-up-community/set-up-subscription":{"title":"Set up Subscription","data":{"":"This section is your comprehensive guide to seamlessly configure and manage subscription settings within MetaFox. As you are an administrator responsible for overseeing subscriptions or looking to personalize subscription preferences, this manual provides step-by-step instructions to ensure a smooth and tailored experience.Child pages will be listed here"}},"/set-up-community/set-up-subscription/enable-subscription-on-registration":{"title":"Enable Subscription on Registration","data":{"":"In this article, we will guide you enabling subscription on Registration so your users can choose their appropriate Subscription package during registration.Let's log into your MetaFox site with the Admin user. Then go to AdminCP > App Settings > Subscription > SettingsEnable the Is a Subscription required in Registration? setting to require members to select a subscription package when they register.All Subscription packages enabled for Registration and available for Guest User role will be listed on the Registration formThat's it. You can enable Subscription packages on the Registration form now."}},"/software-migration/migrate-data-from-phpfox-v4":{"title":"Migrate data from phpFox V4","data":{"":"This article will guide you to migrate your community from phpFox V4 to MetaFox. The migration process includes 2 parts: Export data on phpFox V4 site and then Import data on the MetaFox.","export-data-on-phpfox-v4-site#Export data on phpFox V4 site":"Log into the AdminCP of your phpFox V4 siteGo to AdminCP > Apps > Find More, then search and install the MetaFox Exporter app from phpFox Store (https://store.phpfox.com/apps/metafox-exporter/)Go to AdminCP > Apps > Installed > MetaFox Exporter, and click the Export button to start exporting data on your phpFox V4 site.A phpFox cron job will handle the Export process. Once the exported file is ready, you can click the Download Zip button to download the zip file to your local machine. We will upload this zip file on the MetaFox site to import data.It may take up to a few hours to complete the Export process","import-data-on-metafox#Import data on MetaFox":"We assume that you could install the MetaFox site successfully. We can go ahead to import data into the MetaFox site.","import-data#Import data":"Log into the MetaFox site and go to AdminCP > Maintenance > Import Data, click on the Upload Data link on the top menuClick on the Attach button and choose the zip file that you have downloaded in the Export data on phpFox V4 site step. Then, click on the Upload button.A MetaFox cron job will handle the Import process. You can check the status of Import process in the Browse tab. It may take up to a few hours to complete the Export process","migrate-user-files#Migrate user files":"Now, we will migrate user files (such as photos, music, videos, etc.) from phpFox V4 to MetaFox. You can copy the following folders from the server hosting phpFox V4 to the server hosting MetaFox:Folder path on server hosting phpFox V4Folder path on server hosting MetaFoxPF.Base/file/picstorage/app/public/file/picPF.Base/file/attachmentstorage/app/public/file/attachmentPF.Base/file/videostorage/app/public/file/videoPF.Base/file/musicstorage/app/public/file/musicPF.Site/Apps/core-comments/assets/images/stickersstorage/app/public/PF.Site/Apps/core-comments/assets/images/stickersPF.Site/Apps/p-status-background/assets/imagesstorage/app/public/PF.Site/Apps/p-status-background/assets/imagesFor files stored on external storage systems, such as Amazon S3, Digital Ocean Space, etc. , they will work on the MetaFox site seamlessly as the external storage configurations will be migrated to MetaFox automatically. There are no additional steps to migrate them.","update-for-searching#Update for searching":"We will need to reindex migrated data for global searching. Let's go to AdminCP > Maintenance > Reindexing page. And click on the ReIndex button. Please note that it will take a while for migrated data to be searched.Congratulations. You have completed the Migration from phpFox V4 to MetaFox."}},"/software-migration":{"title":"Software Migration","data":{}}}